{"numFound": 48, "start": 0, "numFoundExact": true, "docs": [{"id": 3447360, "paper": "Garfield County News", "type": "page", "date": "1995-01-12T00:00:00Z", "year": "1995", "month": "January", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/4c/2e/4c2e0c42defbd2660130b578f201d8860aecfebc.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/51/6b/516b1d24c6d388bc58de1d6234698fd3ddb03def.pdf", "page": 1, "parent": 3447408, "version": 1739891002704920578}, {"id": 3447361, "paper": "Garfield County News", "type": "masthead", "date": "1995-01-12T00:00:00Z", "year": "1995", "month": "January", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/19/a7/19a7b91f600b87bbefc17eacddc0113c0f31cbc6.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/81/59/81591b81af245427593eb4120734fd55962ba004.pdf", "page": 1, "parent": 3447408, "version": 1739885555709116420, "ocr": "mmm smm mm  Volume 74 Number 02 Tropic, Utah Thursday, January 12, 1995 Price 450"}, {"id": 3447362, "paper": "Garfield County News", "type": "article", "date": "1995-01-12T00:00:00Z", "year": "1995", "month": "January", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/a7/20/a720a329f878e7fb85bed1214ccab14a975ed8e0.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/66/b8/66b81e3df68e74f55a2104b9e67e237fccbdd30d.pdf", "page": 1, "parent": 3447408, "version": 1739887078014976000, "ocr": ". . i 1  .- -J; \"i '  !  i  it  i  New county clerk Camille Moore, administers  the oath of office to the county's officers,  elected Nov. 8, 1994: Recorder Les Barker,  Assessor Tom Simkins, Justice Clare Ramsay,  Co mmissioner Maloy Dodds, and Treasurer!  Judy P. Henrie. Moore, Sheriff Than Cooper  and County Attorney Wallace Lee were sworn  in earlier because of pressing county duties.", "articleTitle": "Local News"}, {"id": 3447363, "paper": "Garfield County News", "type": "article", "date": "1995-01-12T00:00:00Z", "year": "1995", "month": "January", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/33/2b/332bb2c92f929d957119c26390c868654a262771.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/cc/c2/ccc26fef8b2112f354bac4739ffaac3c7f9cc72d.pdf", "page": 1, "parent": 3447408, "version": 1739892281295503362, "ocr": "Orton Announces $1.7 Million  FAA Panguitch Airport Grant  PANGUITCH Rep. Bill  Orton, D-Utah, announced Jan. 6  that the Panguitch City Airport  will receive a SI. 7 million grant  from the Federal Aviation  Administration for the construction  of additional airport facilities.  \"We need to make sure the federal  fed-eral government continues to  uphold its commitment of provid  ing airport funding to our nation's  rural areas,\" Orton said. \"This  grant is vital to airports in rural areas  ar-eas such as the Panguitch City Airport  Air-port because almost all of their capital  cap-ital development for improving  runways and taxiways comes from  FAA funding.\"  Orton says the grant, made possible  pos-sible through the FAA's Airport  Improvement Project, will fund various  var-ious proposed projects at the airport.  air-port. The grant is part of an ongoing  effort to provide additional funding  for Utah's rural airports. In the past  year alone, Orton has announced  similar grants for airports in Hebcr  City, Monticello, Price and Green  River.  \"This project is especially important  im-portant to us because Panguitch has  the only hospital on Highway 89  between Richfield and Kanab,\" said  Panguitch City Manager Allen  Henrie.  Merle Prince, who functions as  part time economic development di-  rector and airport manager for Panguitch  Pan-guitch City, explained that the S2.3  million project has been several  years in the planning. He said that  Panguitch completed its master  plan for the airport about a year ago  and at that time qualified for placement  place-ment on the FAA's list for potential  poten-tial funding. He said that because  of other airports higher up on the  FAA's list, Panguitch did not anticipate  antic-ipate funding until 1996. Another  airport selected for funding failed to  complete its requirements and  monies were shifted to Panguitch  instead.  Prince said Creamer and Noble  Engineers, St. George, are currently  completing plans for improvements  that will include construction of an  apron and connector taxiway and extension  ex-tension of the airport runway by  750 feet at either end to  accommodate life flights. He said  that theFAA requires that work  must be under contract by the end  of March  Planned originally as a five-year  project to be completed in increments,  incre-ments, FAA requested that all im-  (See Panguitch Airport Grant  On Page 4A)  Airport Grant  From Page One  provements be included in the one  fiscal year. Rather than $1.7 million,  mil-lion, FAA will increase funding to  $2.1 million to allow the city to  complete the project earlier. The  state will provide $101,000 and the  city the additional $101,000. In  order to come up with $101,000,  the city sought backing from the  county for $80,000 from the  county's special service district  funds. The city will reimburse the  county from a grant for $101,000 it  hopes, in turn, to obtain from the  Community Impact Board.", "articleTitle": "Orton Announces $1.7 Million FAA Panguitch Airport Grant"}, {"id": 3447364, "paper": "Garfield County News", "type": "article", "date": "1995-01-12T00:00:00Z", "year": "1995", "month": "January", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/18/f1/18f1d8ce02b7bf4ce229cd2ba56debdaf7e8fc55.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/4c/12/4c12f46ca08cbd4e8042f8420d957cc1c944a0df.pdf", "page": 1, "parent": 3447408, "version": 1739890948381343746, "ocr": "Cedar City Man  Faces Forgery,  Check Charges  PANGUITCH David  Mitchell Scott, 26, Cedar City,  made an initial appearance Jan. 5 in  Sixth District Court before Judge  David Mower. He is charged with  four second degree felony counts of  forgery and nine third degree felony  counts of forgery involving 13  different checks. He is also charged  with one count of issuing a bad  check, a second degree felony and  one count of theft by deception, a  second degree felony. The checks  in question were written to the  Round-Up, a Panguitch convenience  conven-ience store, beginning Nov. 10,  1994.  Scott was appointed a public  defender. A preliminary hearing has  been set for Feb. 2.", "articleTitle": "Cedar City Man Faces Forgery, Check Charges"}, {"id": 3447365, "paper": "Garfield County News", "type": "article", "date": "1995-01-12T00:00:00Z", "year": "1995", "month": "January", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/c5/5e/c55ed4ef3d5ff3f2b0098bc2f29f4cee1738ca16.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/7f/77/7f7779f2406a864d800ac708767664301d5ba336.pdf", "page": 1, "parent": 3447408, "version": 1739885785319997440, "ocr": "Anasazi Indian  Village Remodel  BOULDER Visitors will  find an expanded and improved visitor  vis-itor center at the Anasazi Indian  Village Slate Park, when current  renovation work is completed. The  visitor center will be closed Jan. 5  through Labor Day weekend.  \"When the renovation is completed  com-pleted we'll have double the  amount of space we have now,\" said  Park Manager Larry Davis. When  the visitor center reopens visitors  will find an auditorium and increased  in-creased display space. A climate  controlled artifacts storage area,  additional space for sale items and  additional office space will be  available for park staff.  A multi-agency information  center, where information about  southwestern Utah will be available  avail-able for visitors to pick up, will  also be part of the new visitor center.  cen-ter. The park staff is currently taking  tak-ing displays apart and packing artifacts  arti-facts for storage, Davis said.  \"As the construction progresses  we will try to make the ruin and  picnic area available to visitors,  when it's safe for them to be in  those areas,\" Said Gordon Topham,  southwest region manager with the  Utah Division of Parks and  Recreation. \"During times when  it's not safe, due to the construction  construc-tion work, those areas will be  closed to visitors.\"  A small trailer will be set at  the park and park personnel will be  available to host visitors and answer  an-swer questions.  Anasazi Indian Village State  Park, site of one of the largest  Anasazi communities west of the  Colorado River and believed to  have been inhabited between A.D.  1050 to 1200, is located near  Boulder on Scenic Highway 12.", "articleTitle": "Anasazi Indian Village Remodel"}, {"id": 3447366, "paper": "Garfield County News", "type": "article", "date": "1995-01-12T00:00:00Z", "year": "1995", "month": "January", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/32/9c/329c163e1e542cced404e095c1ff00410841f510.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/16/9c/169c6ff03c045490ac582941ecb7a72f942e9960.pdf", "page": 1, "parent": 3447408, "version": 1739889574439550978, "ocr": "Two Juveniles  Admit Assault  PANGUITCH Two  Panguitch male juveniles, ages 14  and 15, alleged to have sexually  assaulted a 13-ycar-old female at a  Panguitch residence on Nov. 2,  1994 have both been charged and  admitted guilt in juvenile court  before Judge Louis G. Trevort.  The young men were charged  with one count each of Lewdness  Involving a Child, a class A  misdemeanor and Unlawful  Detention, a class B misdemeanor.  Both were ordered to undergo  evaluation through ISAT, the  Intcrmountain Sexual Abuse  Treatment Center in Cedar City  prior to sentencing.  y", "articleTitle": "Two Juveniles Admit Assault"}, {"id": 3447367, "paper": "Garfield County News", "type": "birth", "date": "1995-01-12T00:00:00Z", "year": "1995", "month": "January", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/ef/c4/efc42351874a8dffa7383a468f198694d87461fd.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/51/af/51afc494764a3d89ede1cca9e7e90db3924cebdf.pdf", "page": 1, "parent": 3447408, "version": 1739890963636027393, "ocr": "\" \"  - 1  v ' v. -  \" ' -  v  i ' ,  - '  A young Mt. Carmel couple made the trek to Panguitch for Dr.  Richard Birch to deliver the first baby of '95 at Garfield  Memorial Hospital. Kline and Cami Esplin try to get some  response out of son Riley Roland born Jan. 3 at 1:25 p.m.  First Baby Of 1995 Born  At Garfield Memorial  PANGUITCH - \"We're excited  that we have a boy and feel very  lucky,\" say the Esplins, the parents  of the first baby born at Garfield  Memorial Hospital in 1995.  A boy, Riley Roland Esplin was  born to Kline and Cami Esplin on  Jan. 3, at 1:25 p.m. Riley weighed  in at 6 pounds, 13 ounces and  measured 20 and one-half inches.  He is the first newborn for the  parents, who have been married  nearly two and one-half years  New mother Cami was born in  Aurora, a daughter of Jerold and  Billie Lou Johnson of Aurora. She  also attended SUU receiving her  four year certificate in elementary  education, graduating in 1992.  New dad Kline Esplin was born  and reared in Mt. Carmel , a son of  Cleve and Lorene Esplin. He  attended Southern Utah University  where he earned a bachelors degree  in agri-business in 1994.  The couple now resides in Mt.  Carmel where they work in the  family livestock business, Esplin  Livestock, along with Kline's father  Cleve and brother Eric Esplin.  Great-grandparents of the newborn  new-born are Vilate Esplin of Mt. Carmel  Car-mel and Melva Johnson, Aurora.  The family enjoyed the many  gifts that were generously donated  by several area businesses: Tod's  Travel Center (S10 gift certificate);  First Security Bank, Escalante (S50  savings bond); Kaibab Industries  (S10 gift certificate); Welcome  Market ($15 gift certificate); Zions  First National Bank, Panguitch  (S25 savings account); Leland's  Chevron \"C\" Store (bucket of  Chester chicken); Panguitch Drug  ($10 off baby-related item);  Cowboy's Smokehouse (complete  dinner for parents); Garfield  Memorial Hospital (case of  diapers); Country Corner Cafe (S10  gift certificate); Round-Up ((two  hamburgers and two large drinks for  parents); Little Indian Curio (baby  moccasins); Napa Auto Parts (five  quarts Napa oil ad one Silver Line  filler); Thomas Auto Repair (state  vehicle inspection); Garkanc Power  Association (hooded towel and  washcloth); and Hub of the West  video (one new release rental).", "articleTitle": "First Baby of 1995 Born at Garfield Memorial"}, {"id": 3447368, "paper": "Garfield County News", "type": "article", "date": "1995-01-12T00:00:00Z", "year": "1995", "month": "January", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/9e/0f/9e0f9e5adbcf2104df91384c0c4ddd0ca95efbed.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/b5/9b/b59b2af0b41dcecfd534ddd7c13419cc0980a9f4.pdf", "page": 1, "parent": 3447408, "version": 1739893689546702849, "ocr": "Looking Back At 1994  - The Year In Review  We continue with our highlights  high-lights of events in 1994 as reported  in the Garfield County News for  your interest.  June  Garfield County Commissioner  Louise Liston was among representatives  represen-tatives of the National Association  of Counties who testified in  Washington, D.C. before the House  Subcommittee on National Parks,  Forests and Public Lands.  Dennis Moser, assistant administrator  admin-istrator at Garfield Memorial Hospital,  Hospi-tal, announced that proceeds from  the auction and fund raiser dinner  for the new long term care center  totalled $7,000.  Tom Heywood, son of former  Panguitch residents Fred and Rita  Heywood, was hired as the new  basketball coach at Bryce Valley  High School. The 6-fcet 10-inch  Heywood comes to BVHS from  Colorado Northwestern Community  Commun-ity College at Rangely, Colo.  Two Glcndale teens were seriously  seri-ously injured in a one-car accident  accident eight miles north of  Panguitch.  The first annual Wide Hollow  Fishing Derby was held June 1,  sponsored by tie Escalante District  of the Dixie National Forest,  Escalante Petrified Forest State  Park and the Utah Division of  Wildlife Resources. Some 42  young angles, mostly boys and  girls under 18, took part in the  event.  The firsi traffic lights in all of  Garfield County's 5,200 square  miles wee only temporary, installed  in-stalled foi the construction of the  new bridgi over the Escalante River  near Calf -reck.  An inaphylactoid reaction  claimed the life of a 38-year-old  Bclgianvisitor at Bryce on June 24,  the scond death and fifth similar  inciden in the area in the past three  years. Walter Eduard Jcann Bergen  and hi; wife and daughter were part  of a Blgian group touring the area.  A hopital spokesman said that in  each :ase individuals with asthmatic  or alcrgic-type problems had been  on r around horses when their  rcadons took place.  July  ligh winds and extremely dry  coditions prompted a high conccn-traion  conccn-traion of fire-fighting activity on  IhJC lightning-caused wildfires on  lb Escalante District of the Dixie  Nlional Forest. All three were  rj.ickly and effectively controlled.  Two Garfield County commissioners,  commis-sioners, working directly with the  Bureau of Land Management,  National Park Service and Forest  Service over a number of months  presented the \"Canyons of the  Escalante,\" a new cco-rcgion concept  con-cept proposed as an innovative way  to manage public lands in the Escalante  Esca-lante River area.  Twelve separate accidents were  reported in a single record-breaking  week in Garfield County. One of  the 12 resulted in a fatality when  25-year-old Travis Jcssop was killed  instantly when his 10-whcel dump  truck loaded with rip-rap failed to  negotiate a downhill curve and went  off the opposite side of Highway 12  one-half mile north of Calf Creek  Campground.  Garfield County employment  showed first-quarter 1994 growth as  unemployment in the five-county  area of Garfield, Kane, Iron  Washington and Beaver counties  fell to a very low 3.5 percent.  Escalante's Emilie Lott brought  the \"Miss Rodeo Utah\" title back to  southern Utah for the first time iin  almost 30 years. The 22-year-old  beauty was named queen of Utah  Rodeo for 1994-95 on July 25 after  a full week of fierce competition at  the Ogdcn Pioneer Days Rodeo.  August  Fire crews fighting a wildfire on  Forest Service land only four miles  southwest of Bryce Canyon National  Nation-al Park were able to bring the fire  under control, burning 213 acres in  five days  Law authorities in three states  were searching for three juveniles,  suspects in an aggravated assault on  two adult counselors at Turnabout  Ranch in Escalante. The three,  who subsequently surrendered themselves  them-selves individually, were sentenced,  after their pleas of guilty to felony  charges, to lockup rehabilitation.  Larisa Decker of Panguitch was  named Miss Garfield County at the  annual Miss Garfield County  Scholarship Pageant held in Panguitch.  Pan-guitch. Named as first attendant  was Sally Cooper of Panguitch and  as second attendant, Mavis Munson  of Escalante.  Just as rescuers arrived to help,  17-year-old Dawn Walker of  Alpine, who had saved her 11-ycar-old  sister Brooke from drowning by  keeping her afloat, disappeared  beneath the murky waters of Otter  (See Looking Back At 1994  On Page 5A)", "articleTitle": "Looking Back at 1995 the Year in Review"}, {"id": 3447369, "paper": "Garfield County News", "type": "article", "date": "1995-01-12T00:00:00Z", "year": "1995", "month": "January", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/f4/77/f4779ccbfadf3176dfaee9413d7d2a9b447db03c.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/7e/5c/7e5c100792076a39cc89dcf1fe34c314e66136cf.pdf", "page": 1, "parent": 3447408, "version": 1739883603617120257, "ocr": "Seven Elk Killed Near  Foothills of Alpine  Utah Division of Wildlife  Resources law enforcement officers  offi-cers are seeking information about  the killing of seven Rocky  Mountain elk, which were shot and  left to rot in the north foothills of  Alpine, 30 miles southeast of Salt  Lake City. Conservation Officer  Karen Green said the poachers  killed an adult cow elk, three yearlings  year-lings and three calves, probably  around Christmas.  \"Whoever shot these elk made  no attempt to use the meat,\" she  said. \"I just don't understand why  anyone would commit such a useless  use-less act. This is one of the most  thoughtless poaching incidents I've  investigated in my 16 years with  the Division of Wildlife  Resources.\" Green speculates that  more elk may have been killed or  were wounded and died somewhere  else.  \"This represents about seven to  10 percent of the wintering herd in  that area,\" said Bruce Giunta,  Central Region Wildlife Manager.  \"This could negatively impact elk  viewing and hunting opportunities  and wildlife viewing opportunities  for some time.\"  The Division of Wildlife  Resources is asking anyone with information  in-formation about the incident to  call the DWR \"Poaching Hotline\"  at 1-800-662-DEER (3337) or the  Central Region office at 489-5678.", "articleTitle": "Seven Elk Killed near Foothills Alpine"}, {"id": 3447370, "paper": "Garfield County News", "type": "article", "date": "1995-01-12T00:00:00Z", "year": "1995", "month": "January", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/47/46/4746d8a02fca63264b85d59a6ebccd21ddb0365c.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/eb/d5/ebd5581c28684023b8cde8216752891884a9933d.pdf", "page": 1, "parent": 3447408, "version": 1739883667761659904, "ocr": "Jail Escapee Bound Over  For Arraignment Jan. 19  PANGUITCH Harold  James Dreyer, who escaped from  the Garfield County Jail October 9,  1994 appeared in a preliminary  hearing in Sixth Judicial District  Court before Judge David Mower  on Thursday, where it was determined  deter-mined there was sufficient probable  proba-ble cause to bind him over for arraignment.  ar-raignment. The 25-year-old Salt Lake City  man had been serving a mandatory  prison term of 10 years to life for  aggravated sexual assault and had  been transferred four months earlier  ear-lier from Utah State Prison at  Point of the Mountain to the  Panguitch facility.  He escaped the jail during a late  night smoking session in the exercise  exer-cise yard just prior to lock-up and  was not missed until 7 or 7:30 a.m.  the following day, a Sunday morn  ing. He made his way over a 12-foot  12-foot razor wire security fence and  was believed to have stolen a 1990  Lincoln Towne Car belonging to a  local resident.  Dreyer had earlier been appointed  ap-pointed the services of public defender  de-fender Kent Winward who appeared  ap-peared alongside his client in answering  an-swering the two charges of Escape  from Jail and Theft of an Operable  Motor Vehicle, both second degree  felonies. They are punishable by  from 1-15 years in prison andor a  fine of up to S10.000 plus an 85  percent surcharge.  At the Thusday prclimary hearing  hear-ing the state produced Sheriff Than  Cooper, Jail Commander Robert  Harris and JailerDispatcher Joann  Orton as witnesses for the state.  Arraignment has been set for Jan  19.", "articleTitle": "Jail Escapee Bound over for Arraignment Jan. 19"}, {"id": 3447371, "paper": "Garfield County News", "type": "article", "date": "1995-01-12T00:00:00Z", "year": "1995", "month": "January", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/c2/18/c21848abf32ae7e2c8aa01e87ffbee1699250d76.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/a5/27/a5278ff443c8af5455cbf4d8bbfe2fd1836e9c5f.pdf", "page": 1, "parent": 3447408, "version": 1739892893703733250, "ocr": "May 22 Date  For North Star  Preliminary  PANGUITCH A preliminary  hearing has been set for May 22 -27  for two owners and seven  employees of North Star Expeditions,  Expedi-tions, Inc. of Escalante who are  charged with third degree felony  abuse or neglect of a disabled child  in the March 1994 death of a 16-year-old  boy participating in the  youth wilderness program. The  hearing will be held in Sixth  District Court in Panguitch before  Judge Kay L. Mclff, newly  appointed Sixth District judge who  replaced retired Judge Don V.  Tibbs.  North Star closed its doors at the  end of October when its license to  operate was not renewed and when  principals in the company were  forced to remove themselves from  any personal involvement in the  business because of felony charges  against them.  (See North Star Preliminary Set  On Page 4A)  North Star Set  For Preliminary  From Page One  An autopsy revealed that young  Aaron Bacon died of peritonitis  resulting from a perforated ulcer.  He had been a participant in the  program for 30 days at the time of  his death. His parents, Robert and  Sally Bacon of Phoenix, Ariz., filed  a lawsuit in Maricopa County,  Ariz, against North Star charging  gross negligence.", "articleTitle": "May 22 Date for North Star Preliminary"}, {"id": 3447372, "paper": "Garfield County News", "type": "unclassified", "date": "1995-01-12T00:00:00Z", "year": "1995", "month": "January", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/59/25/5925b74a1e9555a7eb4f1cc923446240c43dab88.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/c9/4b/c94beafb1d6d2cb6d520e2a0aeed8505921ffb07.pdf", "page": 1, "parent": 3447408, "version": 1739893882403946498, "ocr": "Weather  Date High Low Precip  Jan. 04 3 8 24 .02  Jan. 05 3 8 27 .07  Jan. 06 37 17 .02  Jan. 07 39 14  Jan. 08 44 17  Jan. 09 4 5 29  Jan. 10 45 31  Weather is reported by Chris  Dalton, Dixie National Forest  weather observer, Powell  District, and is an official part of  the United States Weather Service  statistics.", "articleTitle": "May 22 Date for North Star Preliminary"}, {"id": 3447373, "paper": "Garfield County News", "type": "page", "date": "1995-01-12T00:00:00Z", "year": "1995", "month": "January", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/cb/e8/cbe827d50f6eaa13abf05de3fa446d6c6567ac18.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/ca/d2/cad29a370b2acdd8c21c3cdce565b0ca978f6615.pdf", "page": 2, "parent": 3447408, "version": 1739892422445367300, "ocr": "Weather  Date High Low Precip  Jan. 04 3 8 24 .02  Jan. 05 3 8 27 .07  Jan. 06 37 17 .02  Jan. 07 39 14  Jan. 08 44 17  Jan. 09 4 5 29  Jan. 10 45 31  Weather is reported by Chris  Dalton, Dixie National Forest  weather observer, Powell  District, and is an official part of  the United States Weather Service  statistics.", "articleTitle": "May 22 Date for North Star Preliminary"}, {"id": 3447374, "paper": "Garfield County News", "type": "unclassified", "date": "1995-01-12T00:00:00Z", "year": "1995", "month": "January", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/bb/16/bb16999453d1f5aca4ea79e805c742728b2d434a.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/a6/c3/a6c3cf694aa0d8f6145a36e1a42b82af49979faa.pdf", "page": 2, "parent": 3447408, "version": 1739892843503157250, "ocr": "9-A GARFIELD COUNTY NEWS Thursday. Jan. 12. 1995", "articleTitle": "May 22 Date for North Star Preliminary"}, {"id": 3447375, "paper": "Garfield County News", "type": "unclassified", "date": "1995-01-12T00:00:00Z", "year": "1995", "month": "January", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/a9/30/a930868cb4bf97d6af06e5759587c2a5b525fdb4.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/92/c3/92c35ccc7fa351660f01a105ea0d4be8644e08b6.pdf", "page": 2, "parent": 3447408, "version": 1739891655465500673, "ocr": "BELVEDERE by George Crenshaw  r-7?. K r  P\"  CM, WHY POM'T W L-6T HIM MK. JUST ONE PHOME  CALL- TO Ue UAWY&e IP M& INSl6T5.?'", "articleTitle": "May 22 Date for North Star Preliminary"}, {"id": 3447376, "paper": "Garfield County News", "type": "article", "date": "1995-01-12T00:00:00Z", "year": "1995", "month": "January", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/be/ea/beead6ce61e0cef48130bd4ea54d465faf44e832.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/2d/60/2d6037d59b97024efa0c728b503b8ca3484ebfd7.pdf", "page": 2, "parent": 3447408, "version": 1739887553508540419, "ocr": "WilliamsonAllen  PANGUITCH Making plans  for a Jan. 14 wedding at the Logan  LDS Temple are Amber  Williamson of Rexburg, Ida. and  Clint Allen of Panguitch. They  will be honored at a reception that  evening in Rexburg.  A reception to honor the  newlyweds is also set for Thursday,  Thurs-day, Jan. 19 from 6:30 until 9 in  the evening at the new LDS chapel  in Panguitch.  Announcement of the forthcoming  forth-coming marrriage is made by the  parents of the bride-to-be, Dee and  Janet Sevy Williamson of Rexburg.  Parents of the prospective bride-  groom are Charles Allen of  Panguitch and Connie Wilcox of  Twin Falls, Ida.  The bride-elect graduated from  Madison High School in Rexburg  and currently attends Utah State  University at Logan . She will  graduate in nutrition science before  attending medical school.  Her fiance graduated from  Panguitch High School and also  attends USU where he is majoring  in animal scienceagricultural  systems.  The couple will reside in Logan  following their marriage where they  will continue their education.", "articleTitle": "Williamson/Allen"}, {"id": 3447377, "paper": "Garfield County News", "type": "article", "date": "1995-01-12T00:00:00Z", "year": "1995", "month": "January", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/48/7b/487bfb13fb8c07fca9f4e94707b549d559e1cb37.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/6f/2a/6f2a4ec33b056eadd7f853dc5f9f7c90da06aeda.pdf", "page": 2, "parent": 3447408, "version": 1739891991017160708, "ocr": ": ii Ad I ill Mte.Wilffll!finiiiliNlfrfli y 1! ihJ MiMif! m Jill 1  By Betty Wiley  624-3215  Phew . . . Had a little snow this  morning and we are thankful for  every little bit we get!  Bernice Jolley has her grandson  here to live with her and he is attending  at-tending Antimony Elementary.  Ted and Karma Jolley traveled  to Las Vegas, Nev. where they met  their son, Darrin, who came in on  the plane for business. They are  hoping he might find some kind of  job close to home as he has been living  liv-ing in Texas.  Corlas Montague has a triple  bypass heart operation at the Utah  Valley Medical Center last Friday.  He has been doing so well that they  let him come home on Wednesday.  His family has been up north with  him.  Jerry and Janene Savage have  moved Teresa Savage and family  home from Nephi. The girls are  now back in school here.  Seems everyone is exhausted  since the holidays so there isn't  much news.  Judy Fielding look her daughter  to the Primary Childrens Hospital  for a checkup as she has been wearing  wear-ing a heart monitor for several  days.  Barbara Gardner will be working  work-ing at the Antimony Merc while  Marcia Brindley is gone to market  in Denver next week. Mareiawill  fly out of Salt Lake City this  Monday.  Visiting over the the New  Years weekend at the Van Wileys  were Martin and Kim Mathews  from up north.", "articleTitle": "Antimony News"}, {"id": 3447378, "paper": "Garfield County News", "type": "article", "date": "1995-01-12T00:00:00Z", "year": "1995", "month": "January", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/36/22/3622fcbf08462b05e4769d2531697cf2fb4f6910.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/5e/43/5e4330173a5763a506170273f1ac0d502a8a5144.pdf", "page": 2, "parent": 3447408, "version": 1739886852225105922, "ocr": "jlllllJIll Hmm .toil ihiijlllLijwiJi Uiil Jlliili  By May Sawyer  735-4207  Charlotte and Will Lane and  children of Page, Ariz, spent the  Christmas holidays with Calvin  and Ruth Wilson.  Vonee Roundy spent Christmas  with her children in Las Vegas.  Layton and Floriene Barney and  the Vic Gordon family went to  California to attend the blessing of  Melissa Ann Phillipi, daughter of  Brad and Stephany Phillipi.  The Hatch Camp DUP meeting  was held Wednesday, Jan. 4 at the  home of Ruth Wilson. There were  six present. Ardis Evans gave the  lesson. Ruth Wilson was hostess  and served a lovely luncheon. The  lesson was about Mr. Hancock, an  early pioneer.  Speakers in LDS Sacrament  meeting were LaVal Sawyer, Carla  Sawyer, Lance Sawyer, Lucinda  t  Josie and Nicole Rheese.  Visiting the LaVal Sawyers  this past week were the Ryan Josie  family; the Jeff Rheese family of  Kanab and the Bennett Josie family  of Panguitch.  Word was received by the  Robert Evans family that son  Michael Evans of Arizona was recuperating  re-cuperating from surgery and that  he is doing fine.  May Sawyer went to Mesquite,  Nev., to visit the Kurt and Phyllis  Sawyer family and to be present at  the baptism of grandson Brett  Thomas Sawyer. Other visitors at  the baptism were Rick and Sharon  Sawyer of Hatch, Nile Sawyer and  Viola Cox of St. George. They all  met at the Kurt Sawyer home for  light refreshments.  May Sawyer visited Reva  Lowder at the Phase II Plantation  rest home in St. George on Sunday.", "articleTitle": "Hatch News"}, {"id": 3447379, "paper": "Garfield County News", "type": "article", "date": "1995-01-12T00:00:00Z", "year": "1995", "month": "January", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/de/e6/dee6f95b63e03d17ed08c7fc5521bc2530d1de35.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/e1/9f/e19ffef95c8a352e0a107893bbcc550019ebff85.pdf", "page": 2, "parent": 3447408, "version": 1739885385351168003, "ocr": "Single EMT Run SUBSCRIBE NOW!  PANGUITCH Emergency  Medical Technicians in Garfield  County responded to a single call  for assistance this past week according  ac-cording to Ambulance Operations  Officer Mona Partridge.  On Monday, Jan. 9 at 9:56 a.m.  Ella Bybee, 69, Tropic, was taken  from Garfield Memorial Hospital  to the Panguitch Airport for life  flight to the LDS Hospital in Salt '  Lake City by EMTs Mona  Partridge and Kevin Moore.", "articleTitle": "Single EMT Run Subscribe Now!"}, {"id": 3447380, "paper": "Garfield County News", "type": "advertisement", "date": "1995-01-12T00:00:00Z", "year": "1995", "month": "January", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/55/9f/559ff15c2a2a9f1b20ce6439ffb5500013f4d759.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/5f/24/5f2415392f68769700ce574e13a56791d07894d9.pdf", "page": 2, "parent": 3447408, "version": 1739891337867558912, "ocr": "i j  i ' I  IEscalante  BAPTIST CHURCH  Community Center  Sunday School 10 a.m.  Morning Services 1 1 a.m.  Evening Services 7 p.m.  BibleStudy  i Wednesdays 7 p.m.  Pastor James Dagglt  I 826-4915 J  I Mil II I  r \" 1 - ' ;  PCBDILOG MEMM  UTAH'S ECO-REGION PLAN FOR  THE REVITALIZATION  OF THE ESCALANTE CANYON'S  AREA INTO THE 2 1ST CENTURY  OF TOURISM  Sponsored By The Office  Of Governor Leavitt  A A A .W Tf- AAAAAAAAAAAA W \" J\". A A A A A A -J. A A A A A tftf A Ss A A A A A A A A  A A A A A A A N1\"\" AAAAAAAAAAAAA .fe\". ftf A A A A A A A A A ft AAAAAAAAAAA' A  It Is Vital That You Attend To  Help Organize A Task Force  And Develop A Suitable,  Successful Plan.  I 'I I' II I'l ft I. ,11 U l\"l I. M ill II II II ill i II i fii II .11 M II II II I. ,11 II II i.l .,1 .1. ,1k I. II II II II II Ml. M II,, II, II II ill II II II II II, Q II, II, .1,1  ' 1 1  Printing Is Our Specialty  679-873Q  PANGUITCH CITY DOG OWNERS  Dr. David Burgermeister, DVM will be at the Panguitch  City Fire House on Iriday, January 13, 1995 from Noon to  4:30 p.m. and Saturday, January 14, 1995 from 8:00 a.m.  to noon to give youi dogs the rabies shots needed to obtain  ob-tain the City requirel dog license. Cost of the rabies shot  will be $6.00. ,  Dog licenses may be purchased at that time or at the  City Office every wedtday from 9:00 to 5:00, excluding  12:00 to 1:00. Licenses must be purchased before February  Febru-ary 1, 1995 or a late fee will be assessed.  D)g License Fees  Neutered Malt and Spayed Female $5.00  Unneutered Maleand Unspayed Female $50.00  Dr. Burgermeister will be available for any other shots  which your dog may need. '  Published in the Garfiefl County News on January 5 and  12, 1995.  )  BUYING OR SELLING  A UTAH BUSINESS  IS SERIOUS BUSINESS  Choosing a Business Broker is a  lot like choosing a parachute, you  better make sure it's one you can  count on. You could lose your life  savings by choosing the wrong  Broker. Mike Webster has owned  19 businesses and as a Licensed  Business Broker, sold over 175  businesses. If you are serious  about buying or selling a Utah  business, call Mike Webster. Professional,  Pro-fessional, confidential, experienced,  experi-enced, references. We do extensive  exten-sive out-of-state advertising.  WEBSTER BUSINESS GROUP  702-870-2199  Lie. R E Bkr. - UT & NV", "articleTitle": "Single EMT Run Subscribe Now!"}, {"id": 3447381, "paper": "Garfield County News", "type": "unclassified", "date": "1995-01-12T00:00:00Z", "year": "1995", "month": "January", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/dc/3c/dc3c4d6cf941da5da139d2f7caa3e607978d218c.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/cb/3d/cb3d8aff2377e425bd43bcf233b2083e39042948.pdf", "page": 2, "parent": 3447408, "version": 1739892278747463680, "ocr": "mm en m  ProductlonManagementSubscrlptlonsMailing D  1 20 North Main Street I)  P.O. Box 127 I  Tropic. Utah 84776  801-679-8730 Fax 801-679-8847  Garflld County Nw$ (ISSN: 1064-7309) Is published each Thursday In Tropic.  Trop-ic. Utah 84776 for $16.00 per year In Utah and $21.00 per year out of Utah  by Garfield County News. 120 North Main Street. Tropic. Utah 84776. Second  Sec-ond class postage paid at Tropic. Utah 84776. POSTMASTER: Send address  changes to Garflld County Nws, P.O. Box 127, Tropic. Utah 84776.  Single Copy45c  Katie Thomas.Publisher  Nancy Twitchell, Editor  Rebecca Bales.Computer & Layout  Deadlrw for weddng and mlMlonciry announcemsntj, columns and regiJar news articles: 5 p m. Friday.  Fri-day. Copy jbmrrted after deodlne may not be used utKI the following week's publication. Deod-  Hne for classified ods and dispioy ocfr noon. Tuesday.", "articleTitle": "Single EMT Run Subscribe Now!"}, {"id": 3447382, "paper": "Garfield County News", "type": "article", "date": "1995-01-12T00:00:00Z", "year": "1995", "month": "January", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/7c/e5/7ce5216ac4dde276e43abd1852d1bf8ee28617af.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/eb/8a/eb8a91f9fadf056c098d29b0bf9f2e8bd58f7372.pdf", "page": 2, "parent": 3447408, "version": 1739884931190882307, "ocr": "liSSIlBi SICE  By Mamie Talbot  676-8084  Counting snowflakcs this past  week has used up some meditating  time but last Thursday on top of  Bear Valley would have taken a  computer. We know of one group  of folks returning from the temple  in a blinding snow storm who were  too busy praying to count. With  only a trace of a car track to guide  drivers as to where the road was, it  was nerve wracking, but what a relief  re-lief to see the UDOT trucks and a  highway patrolman on the way.  We really don't appreciate those  folks who do their jobs as a matter  of course to make it safe for us.  Thanks guys. You are tops.  Denny and Jean Orton and Alta  Orton visited up north with Judy  Mann and did some post Christmas  shopping.  Earl and Evalyn Roe enjoyed  having daughter Beverly's family  here from Panaca, Nev. Beverly  says that they enjoy living in the  small town that is much like Pan-guitch.  Pan-guitch. Her husband teaches school  there.  Norma Talbot just returned from  Price where she spent the holidays  with Hal and Roma Wilcock.  Mamie Talbot was happy to  have daughter-in-law Marilyn Tal-.  Tal-. bot and kids Danielle, Jasmine,  Laycee, Caitlyn, Sessily and  Bridger stay overnight on their way  back to Orem after a visit in California.  Cali-fornia. Dad Rich stayed home to  clean up the Christmas mess and  catch up on his school and archaeological  archaeo-logical work.  David and Michelle Schow are  thrilled over the birth of their baby  boy. Grandparents here are Evancll  Schow and Norm and Dora Ann  Henrie.  Doris Nichols is the new head  honcho at the senior citizens center  since Faye Worthen retired. You  did a great job for many years,  Faye. Thanks.  The birthday party at the Center  will be held on Jan. 12. Support  it, folks!  Doris is happy to have daughter  Betty Ann Johnson and baby spending  spend-ing time with her. They had 16  family members here for Christmas  dinner.  Bill and Elaine DcLong called to  say how much they appreciate the  help they have had from neighbors  and friends since Elaine has had  throat surgery and Bill still can't get  around since his foot amputation.  There's just not anyone like home  town folks is there?  Harold and Rcna Orton have a  baby boy. He was flown to Salt  Lake City for medical attention but  is now home where grandpa and  grandma Gary and Coleen Orton  have a hand in spoiling him.  Metal fire doors are being installed  in-stalled in the Elementary School  after many years.  We hear that several local  stockmen have gone out of the  sheep business. Hatch Livestock  Company and Steele Henrie are two  of them. Well, after all, lamb  chops don't have a lot of meat on  them, wool has slipped out of use  since synthetics have taken over and  the coyotes don't pay a thing for  their meals. Not many farm flocks  left in the valley. Maybe stockmen  can breed a new type of calf with  horns on all four sides to fight off  the predators.  DcVon Dalton, son of the Mike  Daltons was baptized recently.  Kent Osborn and Jan Frandsen  were released from the Panguitch  LDS First Ward Primary while Jeri  Lou Houston and Cynthia Barney  changed jobs there. Youth speakers  were Mark Henrie and Luke Yard-ley.  Yard-ley. Main speakers were college  students Stacee Yardley, Shara  Blais, Jana Black, Trudy Yardley,  Anne Marshall and Tammy Baldwin.  Bald-win. Hope Goulding had the Joel and  Nancy Dutton family and Stephanie  Pace from the Kanab area visit during  dur-ing the holidays. Hope is glad to  be on the mend after a long lime on  the down side.  Charles and Lorene Hcpworth  had Kevin, Colleen, Michael and  Jonathan visiting from Clearfield.  Mr. and Mrs. Charles Patterson  (the former Adcle Dodds Clarice and  Ned Dodd's daughter) of Salt Lake  City visited with Hope Goulding,  who had 40 family members for  Christmas dinner at the Hcpworth  home.  Nina Hatch McQuarrie and  Memphis Talbot report on Gean  Exccll Scvy Henries quilt making  project, which amounted to many  years, making 1600 of them.  When Gcan finds a new pattern, she  and husband Vcrl Henrie will start  the new year by starling number  1601. The quilts arc given lo family,  fam-ily, friends, needy, Primary Medical  Center, Relief Society and wherever  else they are needed. It's interesiing  to learn what home town folks arc  doing even if they are not here.  And they are so glad to hear from  home through! the Garfield County  News.  Memphis Talbot just returned  from a trip east with family even if  it was in a wheel chair. And Nina  says that her son's London England  Mission President Don Steele reports  re-ports much success in teaching the  gospel there. Don's daughter, Nicole  Ni-cole has been called to Toronto  Canada where Don served his mission  mis-sion as a young man.  Elder David Foy, son of Stan  and Lana Foy reported his Chicago  LDS mission in the Panguitch  Third Ward. He says the big city  mission was very interesting and  productive and quite a change for a  country boy. Michael and Robert  Foy were the youth speakers in the  Third Ward. The Primary children  sang a song. A violin number was  presented by Barbara Heaton, Laura  Pearson, Elaine Matthews, Karrcn  Harris and Pain Robison. Dennis  Moser has been called as choir  leader and Ircta Henrie as Relief Society  So-ciety chorister. Rawley Burning-  ham, son of Rick and Sherry, was  baptised.  Travis and Lnn Hatch were  called to work in the Primary and  Wally Dodds as assistant priests advisor.  ad-visor. We hear that Kin Soper is married  mar-ried and got two ntw sons and a  pretty little daughte-, along with  wife Lorie. We wisi you happiness  happi-ness Kim and familv.", "articleTitle": "Panguitch News"}, {"id": 3447383, "paper": "Garfield County News", "type": "article", "date": "1995-01-12T00:00:00Z", "year": "1995", "month": "January", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/26/28/2628ea9ce0067602592242c2f29b06a0b48dcfb8.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/78/7f/787fb5b5e9140965cfd7563903d4075953ff27f4.pdf", "page": 2, "parent": 3447408, "version": 1739886717625696259, "ocr": "li'willPfl  iiiiiiiliiitiJLffl  By Marta Peterson  834-5306  The new year has arrived with  the usual snow and cold weather.  January is living up to its normal  precipitation records. The white  stuff has been of super powder quality  qual-ity as the many cross country ski  enthusiasts can attest to.  The college kids have returned to  school for another quarter of  semester of study. It is a good feeling  feel-ing to know that our local college  students are able to successfully  compete with small towns as well  as large-city-matriculated-young  people.  Maggie Magee and Edd Franz are  off to Mt. Rainier to pursue their  careers. They will be missed.  Their going-away party was almost  washed away with the many tears  shed over the lingering good-byes.  Maggie and Edd received many gifts  and more importantly many small  speeches of how they would be  missed. Cass and Melissa Castag-netto  Castag-netto graciously consented to the  use of their home for the pizza  reirtv  1 111 1 1 ii ' iniiiiiia t  Dan Ng spent a couple of weeks  in California helping his family in  their time of need. Dan's dad recently  re-cently suffered a stroke. He has  been discharged from the hospital  and has entered a nursing home.  A number of our young people  have taken up the sport of snow  boarding. It is being reported that  snow boarding is expected to become  be-come more popular than skiing. It  always seems like the kids are on  the cutting edge of every sport", "articleTitle": "Bryce Canyon News"}, {"id": 3447384, "paper": "Garfield County News", "type": "article", "date": "1995-01-12T00:00:00Z", "year": "1995", "month": "January", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/63/9f/639f623d9c69814e66228a383fdc09ae0c5fb22b.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/a9/cc/a9cc411776a3eae9f9f8421e35720714e1ad32b9.pdf", "page": 2, "parent": 3447408, "version": 1739893360001286146, "ocr": "March of Dimes  Volunteers Set  Volunteers are in place for the  1995 Mother's March, Jan. 16-21.  Dawn Stock, key leader in the Bryce  Valley area has announced the  following volunteers to assist her  this year.  Marie Barton in Tropic; Toni  Foster at Bryce; in Cannonville  Loni Nelson in Cannonville and  Beverly Thompson in Hcnrieville.  The March of Dimes is a national  na-tional volunteer health agency  whose mission is to improve the  health of babies by preventing  birth defects and infant mortality.  Last year all of Garfield County  contributed a total of $1,815.93  with the Bryce Valley area  collecting $845.14 of that total.  This is the first time in the organization's  or-ganization's 56-year history, that  an ambassador from Utah has been  chosen. Devin Knight, 4 -years-old,  son of Jay and Charlcne Knight of  Springvillc, is the national ambassador  ambas-sador for 1995.", "articleTitle": "March of Dimes Volunteers Set"}, {"id": 3447385, "paper": "Garfield County News", "type": "page", "date": "1995-01-12T00:00:00Z", "year": "1995", "month": "January", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/f3/7d/f37d17aa49f2f9b62151358b84363199f8da0282.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/01/fa/01fa24f2c4090695f9c552c04c3a2c09b6cd6c58.pdf", "page": 3, "parent": 3447408, "version": 1739888119659888642, "ocr": "March of Dimes  Volunteers Set  Volunteers are in place for the  1995 Mother's March, Jan. 16-21.  Dawn Stock, key leader in the Bryce  Valley area has announced the  following volunteers to assist her  this year.  Marie Barton in Tropic; Toni  Foster at Bryce; in Cannonville  Loni Nelson in Cannonville and  Beverly Thompson in Hcnrieville.  The March of Dimes is a national  na-tional volunteer health agency  whose mission is to improve the  health of babies by preventing  birth defects and infant mortality.  Last year all of Garfield County  contributed a total of $1,815.93  with the Bryce Valley area  collecting $845.14 of that total.  This is the first time in the organization's  or-ganization's 56-year history, that  an ambassador from Utah has been  chosen. Devin Knight, 4 -years-old,  son of Jay and Charlcne Knight of  Springvillc, is the national ambassador  ambas-sador for 1995.", "articleTitle": "March of Dimes Volunteers Set"}, {"id": 3447386, "paper": "Garfield County News", "type": "advertisement", "date": "1995-01-12T00:00:00Z", "year": "1995", "month": "January", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/fd/0f/fd0fb00083d5eef90656a03846de2825bc9683eb.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/29/c1/29c1e4ac31803ec94799587d311aebd96a078e2c.pdf", "page": 3, "parent": 3447408, "version": 1739885281516978177, "ocr": "; I for fat action,  PLACE Y(UR CLASSIFIED  CLASSI-FIED Af IN THE  ; GARFIEL COUNTY  NEWS -- TP To 20 Words,  i Only $4; 0 Cents A Word  '- Thereafter. Send Your Ad &  Your Che to P.O. Box 127,  ; Tropic, Itah 84776, or Call  ' 679-8730oy Noon on Tuesdays.  J OR  ; PLACJ YOUR CLASSI-  FIED A.D IN NOT 1, NOT  : 2, BIT 43 NEWSPAPERS  ; THROUGHOUT UTAH.  One Placement, One Payment,  ; Puts You Into The \"Utah Classified  Classi-fied Ad Network\". Reach Over  -' 38,000 Utahns For Only $99.  ; Call The Garfield County News  ; At 679-8730 For Further Information.  STEEL BUILDINGS! Winter  Sale! SAVE-Buy Now! Most  Sizes Available. Take Advantage  Of Special Factory Discounts.  Spring Delivery Available. Call  NOW For Special Pricing 800-766-4790.  (ucan)  4 AH Steel Bldgs.  Factory Sale  Limited Quantities  Free Building  Systems Guide.  Sale Ends Jan.  31. Call Larry  801-635-2080.  EXCELLENT PROFITS LOG  Home Wholesalers Join Proven  18 Yr. Log Manufacturer 16 Kiln-Dried  Kiln-Dried Log Styles, Starting $9800.  Exclusive Territory. Mr. Buck 1-800-321-5647,  Old-Timer Log  Homes. (ucan)  SUNQUEST WOLFF TANNING  Beds - New Commercial - Home  Units From $199.00. Lamps - Lotions  Lo-tions - Accessories Monthly Payments  Pay-ments Low As $18.00. Call Today  FREE NEW Color Catalog 1-800-462-9197.  (ucan)  ; BECOME A PARALEGAL. Join  One Of America's Fastest Growing  Professions. Lawyer Instructed  Home Study. Specialty Programs  Offered. P.C.D.I., Atlanta,  Georgia. Free Catalogue. 800-362-7070  Dept. LLA729. (ucan)  : BRIAN HEAD RESORT Is Now  ; Hiring Maids, Janitorial Staff,  Laundry And Other Housekeeping  Positions. AM & PM Shifts  Available. Daily Shuttle From  Panguitch For AM Shift. Call  Vicki At 677-2035, Ext. 185.  (5,12,19,26,2)  ALASKA JOBS! EARN UP To  $30,000 In Three Months Fishing  Salmon. Also Construction, Canneries,  Can-neries, Oil Fields And More! For  Immediate Response Call 1-504-646-4513  Ext:7296K-01, 7 Days.  (ucan)  $300-$1000 WEEKLY! Join  Centerpress Distributing And  Hlep The Nation's Fastest Growing  Grow-ing Brochure Distributor Mail  Brochures From Home. Free Info.  Send S.A.S.E. To: Centerpress Distributing,  Dis-tributing, P.O. Box 2549 1-UP,  Phoenix, AZ 85002. (ucan)  DRIVERS: FLATBED 48 STATE  OTR. Assigned New Convention-als  Convention-als Competitive Pay, Benefits.  $1,000 Sign On Bonus, Rider Program,  Pro-gram, Flexible Time Off. Call  Roadrunner Trucking 1-800-876-7784.  (ucan)  HOME TYPISTS, PC Users  Needed. $35,000 Potential. Details.  De-tails. Call (1) 805-962-8000 Ext.  B-2236. (ucan)  IIH.HII-J  MUST SELL IMMEDIATELY!  Two Arch Style Buildings. 25 x  32 And 50 x 120. 1-800-843-1300  Ext. 896. Complete With Door.  (ucan)  t imw y  ALL TYPES OF FINANCIAL  Loans. No Up-Front Fees. No  Fees If Not Approved. Fast  Courteous Service. Ridgeback Connection,  Con-nection, Connecting Borrowers  With Lenders. (801) 679-8737,  Monday-Saturday, 8:30 A.M. - 9  P.M. (tfn)  300 HEAD OF YOUNG CALVIE  Cows. You Pick. 462-2731,427-3796.  (ucan)  CLEAN COAL AFTER Holidays  Special. Burn In Stove Or  Fireplace. Burns Longer And  Cleaner Than Wood. 12 Ton $75,  34 Ton $90. Call 800-796-4213.  Delivery Can Be Arranged, (ucan)  UP TO $1,000.00 A WEEK AND  More! For Details, Send 10 Self  Addressed Stamped Envelope To.  S.W.J. Enterprise, 328 Flatbush  Ave. Suite 264, Brooklyn, N.Y.,  11238. (718)629-0322. (ucan)  NEEDED: GIFT BOXES For  Jewelry And Small Items. Also  Wanted Old Jewelry, Any  Condition And Old Buttons.  Harriet Priska, Serenidad Gallery  360 West Main, Escalante. (801)  8264810. (tfn)  WATCH SHEPHERD'S CHAPEL  On Satellite, Galaxy 4 Trans 6.  (sclfn)  ARE YOU A DIE-HARD Basket-ball  Basket-ball Fan? Be Sure To Watch  KBYU-YV's Replay Of BYU  Basketball Thursday, January 12  At 10:30 P.M. The Cougars Take  On San Diego State In Basketball  Action You Won't Want To Miss!  (ucan)  GUITAR WANTED!! Local  Musician Will Pay Up To $12,500  For Certain Pre-1970 Gibson.,  Fender, Martin, And Gretsch  Guitars. Fender Amplifiers Also.  Call Toll Free 1-800 995-1217.  (ucan)  JrM.kMM-.l:!;!-'  YOU CAN OWN YOUR OWN  Home! No Downpayment On  Miles Materials, Attractive  Construction Financing. Call  Miles Homes Today, 1-800-343-2884  Ext, 1. (ucan)  RESUMES THAT GET RESULTS  RE-SULTS From Scratch Or Revisions.  Revi-sions. Excellent English, Grammar,  Gram-mar, Spelling Skills; Quality  Computer Work; Laser Printing  Also Business Letters, Family  Histories, Manuscripts. Call  Nancy At 679-8504. (dhtfn)  HARDING GLASS (Formerly  Kanab Glass) Will Be In the Panguitch  Pan-guitch Area Weekly For Residential,  Residen-tial, Commercial And Auto Glass  Repairs. Local Contact: Margaret  Frandsen, 676-8835 Or Call 1-800-  871-2757 Kanab. (tin)  GOT A CAMPGROUND Membership  Mem-bership Or Timeshare? We'll Take  It. America's Most Successful  Resort Resale Clearinghouse. Call  Resort Sales Information Toll  Free Hotline 1-800-423-5967.  (ucan)  CaE,E,H,ME  Land Wanted  E Tropic, Henrieville, 1  or Cannonville  area, 1-25 acres of  farm or grazing land  with irrigation water g  and possible power.  Also, small fix-it-up  B house with 1 - 10 H  (acres farm land,  power and water.  Call Ray at  I 702-896-0729 1  evenings.  'lYfllH'Vlilafc  WANTED TO LEASE - Dry  AndOr Wet Pasture In Or Near  Escalante. Desire Grazing For  Several Cattle In Spring Or Fall.  Short Or Long Term. Possible  Purchase Interest. 801-559-7202  Or 805-983-6161.- (29,5,12)  WANTED TO RENT - Single  Christian Female, Non-Smoker.  Looking For Room To Rent In  Bryce-Tropic Area. April-November.  Call 826-4964 After 5:30  P.M. (12,19)  NOTICE PLEASE: Garfield  County News Does Not Endorse,  Promote Or Encourage The Purchase  Pur-chase Or Sale Of Any Product Or  Service Advertised In This Newspaper.  News-paper. Advertisements Are The  Sole Responsibility Of The Advertiser.  Adver-tiser. Garfield County News  Hereby Disclaims All Liability  For Any Damage Suffered As The  Result Of Any Advertisement In  This Newspaper. Garfield County  News Is Not Responsible For Any  Claims Or Representations Made  In Advertisements In This Newspaper.  News-paper. The Garfield County News  Has The Sole Authority To Edit  And Locate Any Classified Advertisement  Adver-tisement As Deemed Appropriate  And Reserves The Right To Refuse  Any Advertising.  'QdbCalting  f-h Little Book -v  (That Points the Path to )  VPersonal Peace J  Special Only $2.95  Available At  Garfield County News  CardOflhanks  There are so many people that  have Been so -wonderful with  love and support shown to- f  wards our family, just  want to acknowledge a few  people. Lisa Taylor, enon  HyBee and April Lejevre for  taking our kids. To OQithryn  Tollocki 9darie 'Barton, and  ay Snafcespear for food that  was Brought in for our kids.  To 'Bryce 'Valley School and  the school district for the  plants. To'EarlSlack.and  Lonnie Tollockjor their love  and concern and also to Aunt  Louise and Uncle Stan -to  everyone in the loving  town of Tropic. Thanks for  Being there when we have  neededyou.  Sherri 9ley wood and family  Hearing Clinic  Scheduled At  Local Clinic  Take advantage of the hearing  hear-ing clinic at Garfield Memorial  Clinic, Panguitch.  Jeffrey Manwaring, a clinical  audiologist, will be providing  free hearing assessments. ,  1 4  ( l  S  Jeffrey Manwaring, M.S., CCC-A  Other services include hearing  hear-ing aid repairs and new hearing  aid fittings on a 45-day trial basis.  ba-sis. The clinic will be held on  Wed., Jan. 18, from 9 - 11:30  a.m., Panguitch Garfield Clinic.  Call 676-8842 for an appointment.  appoint-ment. Paid Advertisement I  EOSDIKIIISS PDRIiCTEY  Join Our Happy Business Directory Advertisers. Your Specialley Designed  Ad Appears Weekly For Only $25Month. Call Garfield County News 679-8733.  S FREE HEARING EVALUATIONS IS  THURSDAY, FEBRUARY 2 I ) 8  C Senior Citizens Centers f 8  g C Panguitch Henrieville Escalante - I 8  V9 ' H am- Noon -I p.m. 3 -5 p.m. J v 3  5 Repairs Available For All Brands 'J ' S  p Trained To Fit The New L , . .-..J.g  g All-in-the-Canal Hearing Aid Ted R. Yowell 8  , ; HEARING 2  ? Chadwick INSTRUMENT ft  6 I VVVV Hearing; Centers J SPECIALIST 3  FOR ALL YOUR  HAIR CARE NEEDS  Call Chris Davis or  Tammi Burton  Licensed Barbers  Cosmetologists  \" . I. . I. ii  a, a tff M a  \"SERENIDAD GALLERYI  FINE ARTS & ANTIQUES  Featuring  ( Lynn Griffin )  Carolyn Bowmar  Harriet Priska  V  826-4810  360 West Main Escalante  Aaron Dybee  Plumbing  c3 PADnpi  i (Plumbing SeJwkaA  1?fr Faucets  'J Taps. Drains  6 New & Remodel  0  Licensed Contractor  679-8618 - Tropic  SHDRT  tyPskerrie 'butkley  featuring the latest in  CUTS STYLES PERMS  walk-Ins or by appointment  46 N. MAIN PANGUITCH  676-8546  Refrigeration Heating  Air Conditioning  Richard & Chanc Crofts Q  s Licensed Contractors a  $ 676-2341 y  l Panguitch &  tfe& Garfield  vf Veterinary  k$CL Service  ( 1 ) David  Vp y Burgermeister, DVM  Large & Small Animals  In Escalante every 1st & 3rd Wed.  676-8350  1185 N. Hwy. 89  Panguitch  Hills Science Diets Now Available  BEAUTY PARLOR  Complete Hair Care  Tanning Bed  HaircutShampooBIow .Dry $10.00  TRDPIC B79-8823  mmm  State Inspections  Service & Repair  nixes co::oco  1C3 N. rtein  Panrjuitch  07C-0CG2  &  1 Yard Icy f  Insurance  Home - Life - Health 6  2 Auto - Commercial ;  Call Jim or John  676-2240  ibC9 North Main Pansuitch  \"\"\"k \"\"J i\"k jTL '  ' VIIULUIS 1  Auto Repair  OPEN 7 Days A Week!  1 Full Mechanic Service I  24-HOUR TOWING 1  State Inspections  jQAinterize Your Car NowQ  G7G-0111  lCenter & Njain Parpurtchr  f  tFROSTY'S 1  Carpet  , Upholstery  '5fr\"\" Cleaning  FREE ESTIMATES  Truck Mounted  Steam Elxtrcction Unit  648-2178  Orderville  r . i  f - - - -  .: .-  TVs VCR S  Stereos 'Appliances  Guaranteed Service  Reasonable Prices  Satellite Systems And Service  577-2545  In Panguitch  l Tucs. & Fri. 1  E r Tgf-c; jfgz  J;ntu tifrTETT.  1SO So. Pahreah Ln.  Cannonvglw  Qur Specialty  Tune-ups & Brakes  I STATE INSPECTIONS- j  679-8807 fr  f  CELLULARCnr  Wow Serving The  HUH!  $QAAq2. JJwmpAnn  G70-0C03  s (evenings) t  Complete Fabrication  & Repair  Macfjirie Shoo Services  Lettering & Striping  5 5ob  676-8259  930 N. Hwy. 89 Panguitch  PAINTER'S  SUN COUNTRY CHRYSLER  Specialising 9n  NEWpODGL TRICKS  New & Used -  Autos & Trucks s  (hk J'M ?(omA. (Didhn  1-800-888-8857  1600 S. Hilton Dr. St. George  f", "articleTitle": "March of Dimes Volunteers Set"}, {"id": 3447387, "paper": "Garfield County News", "type": "article", "date": "1995-01-12T00:00:00Z", "year": "1995", "month": "January", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/26/85/2685d177e400455f8bddbfc8148445d0f04d732e.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/0e/2a/0e2a72b81c0cf9e32d5a8d9552fe79bd20dba510.pdf", "page": 3, "parent": 3447408, "version": 1739888802619457536, "ocr": "By Harriet Priska  826-4810  It is still snowing as I write this  and the snow on the ground measures  mea-sures at least 6 inches. Some  ranchers are already dealing with  calving. A January thaw is predicted  pre-dicted for next week with really wet  weather coming in February.  Thclma Cottam is recovering  from a stroke suffered Christmas  Eve. She is at the Red Cliffs Rehabilitation  Re-habilitation Center in St. George  and is doing well considering the  severity of the attack.  Thais and Gene Griffin had family  fam-ily here over the holidays including  Melanie Griffin from Las Vegas,  Nev.; Stephanie Griffin and Mark  Griffin and his children from St.  George and the Gary and Sheila  Griffin family from American Fork.  Thais and Gene are now in Mesa,  Ariz, where they are looking forward  for-ward to warmer weather for three  months and Thais will be found at  the swimming pool daily no doubt!  Bill and Carolyn Bowmar enjoyed  en-joyed a visit from son Bruce Bow-mar  Bow-mar and wife Janyce and grandson  Willie from Pacific Palisades,  Calif.  Mary Ellen Coleman and husband  hus-band Hyram went to Lindon for  Christmas to see her daughter and  son-in-law Irene and Lewis Brown,  who have recently moved down  from Alaska. While in Lindon,  Mary Ellen was delighted to visit  Maude Spencer who lived here until  she suffered a stroke last spring.  Maude was visiting with her daughter,  daugh-ter, Ruth Hawn in Lindon. Maude  can walk with a walker, but is still  unable to speak. She lives in a rest  home in Orcm and looks happy and  her health is improving. The  Colemans then went to Provo to  see Curtis and Nicole Brown, Mary  r. .. . .-, - ,.., -  Ellen's grandson and their first  child, Joshua. This was Mary  Ellen's 37th great-grandchild.  Then, just before the New Year the  Colemans went to Beaver to see her  son Lynn and wife Garna Mclnclly  and daughter Cynthia and husband  Todd Bradshaw and their new baby,  Mary Ellen's 38ih great-grandchild.  Just after the first of the year,  Bob and Mavis Munson were able  to get the foundation of their new  home poured. They built a large  storage barn last year on their new  property up against the red rocks at  the north end of the valley and they  plan to be in their new home by  April 1st. The people who bought  the Munson's place cast of town anticipate  an-ticipate opening a Bed and Breakfast  there some time in the spring.  Sharol Bernardo, who was appointed  ap-pointed to represent Escalante on  the Garfield Travel Council last  fall, was elected to serve as vice-chairperson  vice-chairperson for the council in their  Jan. 3 meeting. She was asked to  attend the Color Country meeting  in Kanab and will be representing  Garfield County in travel shows in  Phoenix, Ariz. Feb 2-6 and in Salt  Lake City Feb. 22-26. Mark  Austin, Boulder was also asked to  serve on the council starting in  January. We are glad to have such  fine representation from this part of  the county.  The next Chamber of Commerce  meeting is Monday, Jan. 23, 6  p.m. at the Cowboy Blues for  dinner. Those interested in forming  a gun club should plan to be there.  The club will have a two-fold  purpose: first to maintain the local  firing range and secondly to assist  in presenting the Mountain Man  Rendcvous. Contact Harriet Priska  at 826-4810 for more information.", "articleTitle": "Escalante News"}, {"id": 3447388, "paper": "Garfield County News", "type": "unclassified", "date": "1995-01-12T00:00:00Z", "year": "1995", "month": "January", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/b9/28/b9289a234a616c288061a1055757c0897d121de7.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/bc/36/bc36893baeb3c5857815fc285eda9f985acf0408.pdf", "page": 3, "parent": 3447408, "version": 1739884025478119424, "ocr": "Thursday. Jan 12. 1995 HARFIELD COTTNTTNEWS 3-A", "articleTitle": "Escalante News"}, {"id": 3447389, "paper": "Garfield County News", "type": "death", "date": "1995-01-12T00:00:00Z", "year": "1995", "month": "January", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/59/ef/59ef331e404b545e73538fe8e3fedb69bcb721f0.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/ed/90/ed90b64179d2b3b3594d9acef939867c8985a2ab.pdf", "page": 3, "parent": 3447408, "version": 1739883761435148288, "ocr": "p,.,.,- \" 1  (o)!liiTriy)AIIIII  Truie Belle W. Allen  TROPIC, UT Funeral services  ser-vices were held Saturday, January 7,  1995 at the Tropic LDS Ward  Chapel for for Truie Belle Wool-stenhuhne  Wool-stenhuhne Allen who passed away  at the age of 90 on Wednesday, Jan.  4, 1995.  She was born in Francis, Utah  on July 31, 1904, the daughter of  William Henry Wollstenhulme and  Rachel O'Driscoll. She grew up  with her two brothers and seven sisters  sis-ters in the Tetonia, Idaho area,  where her family moved when she  was two years old.  Truie joined the LDS Church on  August 5, 1942 and was married in  the Salt Lake City LDS Temple to  Ellis Huff Allen five weeks later on  Sept. 14, 1942.  Truie was trained as a nurse  early in life and cared for many who  were ill or aged. She also spent  many years as a cook in various  restaurants and was known for her  excellent pics and cookies. She  loved her children and took pride in  their accomplishments. She was an  active member of her church and  held many church positions through  the years. She enjoyed doing crochet  cro-chet and embroidery work, as well  as other sewing activities. When  she found time she liked to do genealogical  ge-nealogical work and was successful  in finding information on many of  her ancestors. She took pride in  teaching her family the value of  work and set a good example for  them to follow.  She is preceded in death by her  husband and all of her brothers and  sisters. She is survived by her two  sons, Ellis Lynn Allen of Panguitch  Pangui-tch and John W. Allen of St. George.  Ge-orge. She has 12 grandchildren.  We all loved her and she will be  greatly missed by her family and  friends.  Officiating at the Tropic funeral  service was Bishop Lonnie Pollock  with prelude and postlude music  provided by the Tropic Ward. Son,  Lynn Allen offered the family  prayer prior to the opening of the  service. A musical selection \"Love  At Home,\" directed by Krista Allen  and accompanied by Lisa Allen was  sung.  Kory Talbot gave the invocation  follwed by speakers Sherridan Talbot  Tal-bot and Shannon Hughes. Another  musical selection. \"Families Can  Bee Together Forever\" was performed  per-formed by the grandchildren accompanied  accom-panied by Lisa Allen.  A son, Bishop John Allen also  spoke followed by remarks from  Bishop Lonnie Pollock. A musical  selection, \"Beyond the Sunset\" was  sung by Krista Allen, accompanied  by Lisa Allen. The benediction  was given by Dane Hughes.  Pallbearers included Keric Allen,  Herbert Baugh, Dane Hughes, Beryl  Young, Kory Talbot, Taison Allen,  Michael Allen and Kadin Allen.  Compassionate services were rendered  ren-dered by the Tropic LDS Ward Relief  Re-lief Society.  Interment was in the Tropic  City Cemetery with John Allen  also performing the dedication of  the grave under the direction of  Metcalf Mortuaries of St George.", "articleTitle": "Obituaries"}, {"id": 3447390, "paper": "Garfield County News", "type": "page", "date": "1995-01-12T00:00:00Z", "year": "1995", "month": "January", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/0e/77/0e778bcced3b6406e0770386d65cb0e26500ee5c.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/b7/c6/b7c66d3dd740829e233faaef5c1d9cebfd089683.pdf", "page": 4, "parent": 3447408, "version": 1739888343949246469, "ocr": "p,.,.,- \" 1  (o)!liiTriy)AIIIII  Truie Belle W. Allen  TROPIC, UT Funeral services  ser-vices were held Saturday, January 7,  1995 at the Tropic LDS Ward  Chapel for for Truie Belle Wool-stenhuhne  Wool-stenhuhne Allen who passed away  at the age of 90 on Wednesday, Jan.  4, 1995.  She was born in Francis, Utah  on July 31, 1904, the daughter of  William Henry Wollstenhulme and  Rachel O'Driscoll. She grew up  with her two brothers and seven sisters  sis-ters in the Tetonia, Idaho area,  where her family moved when she  was two years old.  Truie joined the LDS Church on  August 5, 1942 and was married in  the Salt Lake City LDS Temple to  Ellis Huff Allen five weeks later on  Sept. 14, 1942.  Truie was trained as a nurse  early in life and cared for many who  were ill or aged. She also spent  many years as a cook in various  restaurants and was known for her  excellent pics and cookies. She  loved her children and took pride in  their accomplishments. She was an  active member of her church and  held many church positions through  the years. She enjoyed doing crochet  cro-chet and embroidery work, as well  as other sewing activities. When  she found time she liked to do genealogical  ge-nealogical work and was successful  in finding information on many of  her ancestors. She took pride in  teaching her family the value of  work and set a good example for  them to follow.  She is preceded in death by her  husband and all of her brothers and  sisters. She is survived by her two  sons, Ellis Lynn Allen of Panguitch  Pangui-tch and John W. Allen of St. George.  Ge-orge. She has 12 grandchildren.  We all loved her and she will be  greatly missed by her family and  friends.  Officiating at the Tropic funeral  service was Bishop Lonnie Pollock  with prelude and postlude music  provided by the Tropic Ward. Son,  Lynn Allen offered the family  prayer prior to the opening of the  service. A musical selection \"Love  At Home,\" directed by Krista Allen  and accompanied by Lisa Allen was  sung.  Kory Talbot gave the invocation  follwed by speakers Sherridan Talbot  Tal-bot and Shannon Hughes. Another  musical selection. \"Families Can  Bee Together Forever\" was performed  per-formed by the grandchildren accompanied  accom-panied by Lisa Allen.  A son, Bishop John Allen also  spoke followed by remarks from  Bishop Lonnie Pollock. A musical  selection, \"Beyond the Sunset\" was  sung by Krista Allen, accompanied  by Lisa Allen. The benediction  was given by Dane Hughes.  Pallbearers included Keric Allen,  Herbert Baugh, Dane Hughes, Beryl  Young, Kory Talbot, Taison Allen,  Michael Allen and Kadin Allen.  Compassionate services were rendered  ren-dered by the Tropic LDS Ward Relief  Re-lief Society.  Interment was in the Tropic  City Cemetery with John Allen  also performing the dedication of  the grave under the direction of  Metcalf Mortuaries of St George.", "articleTitle": "Obituaries"}, {"id": 3447391, "paper": "Garfield County News", "type": "unclassified", "date": "1995-01-12T00:00:00Z", "year": "1995", "month": "January", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/fd/b3/fdb3b5417758f0c01fc7c446cc32e3dc00c7f8be.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/b2/69/b26935b8c90bbcd88d588adb13a59509626fc3ad.pdf", "page": 4, "parent": 3447408, "version": 1739893788415885316, "ocr": "4;A GAEFIELP COUNTY NKWR Thursday .JJ", "articleTitle": "Obituaries"}, {"id": 3447392, "paper": "Garfield County News", "type": "unclassified", "date": "1995-01-12T00:00:00Z", "year": "1995", "month": "January", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/68/ae/68ae718922755f499ea2e1e68c4320962c08d8c8.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/62/9e/629ee79aa719f596a0097e3b6fe250a00f12ee07.pdf", "page": 4, "parent": 3447408, "version": 1739891416823234568, "ocr": "I Sarfield G r o & I  Bounty Hews OJUi la", "articleTitle": "Obituaries"}, {"id": 3447393, "paper": "Garfield County News", "type": "advertisement", "date": "1995-01-12T00:00:00Z", "year": "1995", "month": "January", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/24/07/24078869e08f16bae0bd35393fe35714e7dd5b1a.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/a5/5a/a55aa0a18f58720aa079409bbda76546118ba5b4.pdf", "page": 4, "parent": 3447408, "version": 1739893575007600640, "ocr": "Do You Need  Wedding Invitations?  679-8730  I Advertising Pays I  CardOfnhanks  'We are so touched by  your generous donations  expressing your love to  us and. warming our  Christmas,  you know who you are  even if we don't. od  BCess each and every one  of you.  Howard and Sandra  MiCCer  r ,  ffloi.i.hirrTTi5FTrrm  J at Garfield Memorial Hospital  ' jl \" Garfield Memorial Hospital Congratulates  0 rVn7 \"\" i i Kline and Cami Esplin of Mt. Carmel  111 .k I I On The Birth Of Their Son Riley Roland Esplin  ijj Born Jan. 3, 1995 At 125 p.m. 6 lb. 13 oz., 20 12 inches  Local Merchants Offer Gifts &  xk Best Wishes To The 1st Garfield  Memorial Hospital Baby of 1995!  Tod's Travel Center $10 Gift Certificate  First Security Bank of Escalante $50 Savings Bond  Garfield County News 1 Year Subscription  Kaibab Industries $10 Gift Certificate  Welcome Market $15 Gift Certificate  Zion's First National Bank of Panguitch $25 Savings Account  Leland's Chevron \"C\" Store Free Bucket Of Chester Chicken  Panguitch Drug $10 Off Any Baby Related Item  Cowboy's Smokehouse Complete Dinner For Parents  Garfield Memorial Hospital Case Of Diapers  Country Corner Cafe $10 Gift Certificate  \"V Round-up Two Hamburgers, 2 lg. Drinks for Parents  ftltff Little Inclian Curio Baby Moccasins  Napa Auto Parts . Five Quarts NAPA Oil and One Silver Line Filter  I 'V - Thomas Auto Repair State Vehicle Inspection  Garkane Power Hooded Towel and Washcloth  V-' Pv Hub 0f The WeSt 0ne New Release Rental  AMf I A I Garfield Memorial  evk ) Hospital and Clinics  X J ) y- J (1 I fnf 1 224 N. 400 East Panguitch. Utah 676-8811  A . j Intermountain Health Care Facilities  ;  \" ttutauttcemettt!  SIGNIFICANCE...wheredoyouflnd :  yours? Do you strive to please? ;  Is your significance based on your ;  performance? Other's opinions? ;  Who are you? What are you doing? ;  If these questions plague your mind, ;  I join speakers Pam Kifer and Sue Sivley ;  on Tuesday, January 17 at 7 p.m. in ;  the Juniper Room at the Holiday Inn in ;  Cedar City. For Further Information,  j call 477-8843.  \" ' ----------- .... . .---.-----.-  f PliENATAL CLASS 1  January 18, 1995 - 7 p.m.  ... Runs 6 Weeks ...  : rj PANGUITCH CLINIC O !  (ZlA For Information Call: yM .  wV jan Frandsen - 676-2792 J", "articleTitle": "Obituaries"}, {"id": 3447394, "paper": "Garfield County News", "type": "article", "date": "1995-01-12T00:00:00Z", "year": "1995", "month": "January", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/23/29/23297549e499f3874894223a9699019caf577a43.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/d2/68/d268ad0f015fd9e3c849615b0258d755ea15fbf8.pdf", "page": 4, "parent": 3447408, "version": 1739894923504648194, "ocr": "NOTICE TO WATER  USERS  The State Engineer received the  following Application(s) to Appropriate  Ap-propriate Valer in Garfield County  (Locations SLB&M).  . Persons objecting to an application  applica-tion must file a Protest stating the  reasons for the protest. To have a  hearing before the State Engineer,  persons must request a hearing in  the Protest. Protest must be filed  in duplicate with the State Engineer,  En-gineer, 1636 West North Temple.  Salt Lake City, Utah 84116, (801-538-7240)  on or before FEBRUARY  FEB-RUARY 18, 1995. (PROTESTS  MUST BE LEGIBLE WITH A  RETURN ADDRESS). These are  informal proceedings as per Rule  R655-6-2 of the Division of Water  Rights.  (LEGEND: Point(s) of  Diversion POD; Place of Use  POU- Nature of Use USE)  97-1980 (A65868): USA  Bureau of Land Management  QUANTITY: 3.0ac-ft. SOURCE:  Unnamed Intermittent Stream.  POD: (1) N 650 W 500 from SE  Cor, Sec 19, T36S, R12E., Source:  Unnamed intermittent stream.  (Approx. 15 mi. SW of Hite)  STORAGE: Ted Jones. Capacity  1.0 ac-ft., height of dam 8 ft., inundating  inun-dating 0.53 acs. in SE14SE14 Sec  19, T36S, R12E. USE: Stock-watering:  Stock-watering: 850 head of livestock;  Wildlife: 190 deer, 8 bighorn  sheep, small mammals and  birdsPOU: SE14SE14 Sec 19,  T36S, R12E.  Robert L. Morgan, P.E.  STATE ENGINEER  Published in the Garfield  County News on JANUARY 5, 12,  & 19, 1995.  NOTICE TO  MANUFACTURERS  SUPPLIERS  Garfield County, Utah will  accept separate and sealed bids for a  LANDFILL SCALE until 11:00  a.m., Tuesday, February 7, 1995.  They will then be publicly opened  and read aloud.  Contract documents and  specifications may be obtained from  the Garfield County Engineer 55  South Main, Pamguitch, Utah  84759, phone (801) 676-8826, ext.  119, fax (801) 676-8239. Fax bids  will be accepted. Garfield County  is a tax-exempt local government  and reserves the right to reject any  or all bids.  Published in the Garfield  County News January 12, 19, and  26 and February 2, 1995.  PUBLIC NOTICE  In compliance with the recent  federal AHERA regulation,  Garfield County School District is  continually having their school  buildings inspected for asbestos.  Asbestos is a cancer causing substance  sub-stance which can lead to mesothelioma,  mesothe-lioma, asbestosis, lung cancer, and  some gastrointestinal cancers. The  schoofdistrict is required to notify  building occupants andor their legal  le-gal guardians of these inspections  and other activities regarding asbestos.  i  A management plan has been  developed and has Been submitted  to the state governor or his designee.  de-signee. The management plan specifies  spec-ifies what actions must be taken by  the district to protect human  health and the environment. The  inspection results and management  plans are available for public review  re-view at the district administration  office and at each school for which  the inspection has occurred.  Reinspections for asbestos must  occur no less than every three years  with periodic surveillance on asbestos  as-bestos containing materials that  still remain in the building, to occur  oc-cur no less than every six months.  Published in the Garfield  County News January 12, 1995.  NOTICE TO  MANUFACTURERS  SUPPLIERS  Garfield County, Utah, will  accept separate and sealed bids for a  DUMP TRUCK and a SNOW  PLOW until 11:00 a.m., Tuesday,  February 7, 1995, at the  Commission Chambers of the  Garfield County Courthouse in  Panguitch, Utah. They will then  be publicly opened and read aloud.  Contract documents and  specifications may be obtained from  the Garfield County Engineer - 55  South Main - Panguitch, UT  84759; phone (801) 676-8826, ext.  119; fax (801) 676-8239. Fax bids  will be accepted. Garfield County  is a tax-exempt local government  and reserves the right to reject any  or all bids.  Published in the Garfield  County News January 12, 19, 26  and February 2, 1995.  PUBLIC NOTICE  . Panguitch City will be accept-mgapplications  accept-mgapplications for the position of  CfTY COUNCIL MEMBER at the  city office located at 25 South 200  East until 5:00 p.m. on Monday,  January 23, 1995. Applicants must  be a registered voter living in Panguitch  Pan-guitch City. This appointment  will be until midnight December  31, 1995. e  Published in the Garfield  County News on January 12, 1995.", "articleTitle": "Public Notice"}, {"id": 3447395, "paper": "Garfield County News", "type": "unclassified", "date": "1995-01-12T00:00:00Z", "year": "1995", "month": "January", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/00/64/0064be873ae3424c8e535efb81cd94a878901cc5.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/0b/5a/0b5a694bf068dbb889939021c2a6814592b9c9fc.pdf", "page": 4, "parent": 3447408, "version": 1739887415904960515, "ocr": "PANGUITCH CITY  POLICE  DEPARTMENT  Activities Report  From 1194 To 123194  Total Hours Worked 4032  Total Miles Traveled 12,632.7  Moving Citations 227  Warnings 450  Arrests - Felony 12  Misdemeanor 102  Complaints 402  D.U.I. 13  Public Intoxication 30  Suspicious Incident 322  Paper Service 18  Vehicle Accident 62  Follow Up Investigation 483  Citizen Assists 694  Agency Assists 379  Animal Complaints 124  Medical Assists 123  Juveniles - Handled  andor Referred 353", "articleTitle": "Public Notice"}, {"id": 3447396, "paper": "Garfield County News", "type": "article", "date": "1995-01-12T00:00:00Z", "year": "1995", "month": "January", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/8f/08/8f08979a0f7c2404f92652c89004b31528c99ce2.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/00/8a/008a1434153a5f4013563ab765d119f4d7e35b45.pdf", "page": 4, "parent": 3447408, "version": 1739888246995812354, "ocr": "t ' \" '.  i  I :  x  I ' i  ;  I \"  . : I  Last Saturday, the Valley Buffalos found out  just how tough the Panguitch Bobcats could be  on the boards, as Panguitch went out in the  The Panguitch Bobcats and  Escalante Moquis both posted a  couple of victories over the  weekend, setting up a huge battle in  Panguitch on Friday night.  Panguitch, 7-0, with victories over  Bryce Valley 76-46 and Valley 60-41  60-41 takes a two-game lead over the  field with Valley and Escalante tied  in second place at 5-2. Escalante  defeated Wayne 61-51 and Milford  63-42 as they kept pace. That sets  up the Friday night game in  Panguitch as a must win for the  Moquis as they try to slow down  the Bobcats drive towards the  Region regular season title.  In other games, Bryce Valley  lost a tough one to Piute 79-59 to  go along with their Panguitch loss.  Mustang coach Tom Hcywood's  health problems arc mostly on the  minds of the team and the fans. We  all wish him a ranid rccovcrv. The  lead and could have made it worse. Though  not a particularly good shooting night for  either team, the Bobcats pulled ahead 60-41.  PHS Bobcats-EHS Moquis Set For  Huge Showdown Friday in Panguitch  most important game to all is for  Tom to get better. That matters  most to all of us.  The Panguitch girls lost badly  to Valley with Alesha Richards and  Amber Miller scoring 10 points  each.  Panguitch solidified their hold  on number one with relatively easy  wins. Bryce Valley gave the Bobcats  Bob-cats a game for a half 28-21, but  BV only managed three points in  the third period, one of five trey's  by sharp-shooting Tyson Brinker-hoff,  Brinker-hoff, to fall out of contention.  Panguitch's inside game of Jared  Black, Jeremy Hcnrie, Jeremy  LcFcvre and Aaron Howard was just  too much for the opposition on  both nights. Against BV, Black  scored 13, Hcnrie 12 and Kenny  Tebbs 10. But team rebounding  and team defense were the big keys  in both games. Tyson ended up  with 17 and Waylon Brinkerhoff 14  for the Mustangs. On Saturday,  Valley found out how tough the  Bobcats could be on the boards, as  Panguitch went out in the lead and  could have made it worse. Not  particularly a good shooting night  for either Valley or Panguitch, the  Bobcats stuck it \"in the paint\".  Black scored 15, Howard 13, Henrie  12, and LcFcvre 9. LeFevre and  Howard did an outstanding job on  Valley star Tony Baird.  Escalante's Heath Spencer  continued to prove why he is one of  the finest in 1-A as he scored nearly  half of the Moquis points (29)  against Milford and had 20 in the  battle with Wayne. Garrett Cottam  and Ben Venuti scored a dozen each  against Milford to help Spencer.  Against Wayne, the Barnson  brothers gunned down 26 as Jamie  and Dusty each had 13. Venuti hit  for 11 in that one as well. The  Moquis are playing some  outstanding \"never quit\" basketball  and will be traveling to Panguitch  with a bus full of enthusiasm. It  may not be as big as the Dallas-49ers  Dallas-49ers game this weekend, but it  will matter in Region 15 standings.  Bryce Valley lost at Piute, but  not before Waylon Brinkerhoff got  his usual 20 ponts, Clint  Brinkerhoff notched 10 and Tyson  hit 9. The Mustangs do some  things real well and are likely to tip  some team over that does not  expect it.  Panguitch plays at Enterprise on  Saturday night to wind up their  toughest weekend of the season.  That game can be heard on KMXU  FM.", "articleTitle": "PHS Bobacts-EHS Moquis Set for Huge Showdown Friday in Panguitch"}, {"id": 3447397, "paper": "Garfield County News", "type": "article", "date": "1995-01-12T00:00:00Z", "year": "1995", "month": "January", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/c8/02/c802fe361640b39bb87a3eae861e39b8a71104e2.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/a3/e4/a3e4720b4c7eb7865de90fa6147d670cc2b95876.pdf", "page": 4, "parent": 3447408, "version": 1739892875666128898, "ocr": "PHS Wrestlers  Place In Meet  The Panguitch High wrestlers  competed in Piute and Enterprise  last weekend with some great  results. At the invitational at  Enterprise, the Bobcats sent six  wrestlers to the final championship  round with Colin Marshall, Stoney  Burningham, Brandon Hathcock,  Lewis Roundy, Tyler and Chip  Sanders all going for the gold.  Burningham, Marshall and Chip  were all winners. Marshall, just a  freshman, was named Outstanding  Wrestler in the tournament.  Panguitch placed fourth in the  overall standings.", "articleTitle": "PHS Wrestlers Place in Meet"}, {"id": 3447398, "paper": "Garfield County News", "type": "page", "date": "1995-01-12T00:00:00Z", "year": "1995", "month": "January", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/a5/ea/a5eac4c481f7b844057fdde87a51f0d4938b4bf5.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/f5/5e/f55e789c4938e4f3d773774220f28c02808825ea.pdf", "page": 5, "parent": 3447408, "version": 1739895019256414212, "ocr": "PHS Wrestlers  Place In Meet  The Panguitch High wrestlers  competed in Piute and Enterprise  last weekend with some great  results. At the invitational at  Enterprise, the Bobcats sent six  wrestlers to the final championship  round with Colin Marshall, Stoney  Burningham, Brandon Hathcock,  Lewis Roundy, Tyler and Chip  Sanders all going for the gold.  Burningham, Marshall and Chip  were all winners. Marshall, just a  freshman, was named Outstanding  Wrestler in the tournament.  Panguitch placed fourth in the  overall standings.", "articleTitle": "PHS Wrestlers Place in Meet"}, {"id": 3447399, "paper": "Garfield County News", "type": "article", "date": "1995-01-12T00:00:00Z", "year": "1995", "month": "January", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/c2/d8/c2d842b757f52206eb9e5b364b027f5e8fff2a42.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/2e/ee/2eee578ecc4da0918b6316190abd9750e6bd033c.pdf", "page": 5, "parent": 3447408, "version": 1739887652322148352, "ocr": "By Ronnie Brinkerhoff  679-8734  Gail and Bonnie Miles brought  their mother, Ella Adair home to  visit for a few days. She is doing  better and will visit with son Larry  now for a time. She would love to  hear from you. If her address or  phone is needed, please contact  Minnie Nielson.  A correction on a recent column.  I received a call from Lark Reynolds  of Cannonville who firmly but  kindly reminded me that his  mother's last name was Littlefield,  not Smith.  Dennis and Brenda Shakespear of  Page, Ariz, along with their three  sons, Beau, Cole and Kade were  visitors at the Clare Ramsay and  Vance Pollock homes.  Berdell and Carma Barton had all  their children home for Christmas  dinner. Jared and Mindy Barton,  Scott and Marie Barton, Brent and  Shanna Barton, Mike and Connie  Heaps and Tom and Laraine Marshall  Mar-shall and their families were all  there.  LaFaun Pollock spent her holiday  holi-day in Hatch at the home of her  daughter and son-in-law Lorna and  Merlin BamhursL LaFaun said she  and all her children (except Linda)  were there. Attending were Gordon  and Sharon Pollock, Tropic; Kyle  and Marie Bamson, Delta; Greg and  Lesa Pollock, Tropic and Rob and  Lorie Veater, Panguitch and all  their families.  RaVae Pollock is at the home of  her daughter and son-in-law, Lela  Rae and Steve King in Richfield.  RaVae plans to spend one month  with each of her children, enjoying  the cold winter months surrounded  by the warmth of family.  Talked to Shirley Haycock who  said she and Garn enjoyed a houseful  house-ful of holiday guests. Daughter  Kay and son-in-law Lee Duell, their  daughter Tracy and her husband  Kevin Spencer; Lucky and Sandra  Cox, son Bruce and his daughter  Brittany; son Kerry of Panguitch  and daughter Deb and her daughter  Carlcy and sons Dustin and Eric of  Moab. Son Richard is a Utah  Highway Patrolman working out of  Moab and was unable to be home.  Richard was on Channel 2 News;  he was the officer who investigated  the accident that took the lives of  four Moab teems. Shirley reports  that Garn's health is good as long  as he stays in out of the cold.  Had a nice visit with Fay Pollock  Pol-lock who reported that her husband  DeVar had successful eye surgery in  St. George. Shelley Pollock and  daughter Rachel of Orem were visitors  visi-tors at the Pollock home. Fay said  her grandson, Joe Williams, son of  Don and Kristine Williams of  Beaver, has returned from his LDS  mission to Chile. The family traveled  trav-eled to Salt Lake City to welcome  him home. All the family attended  Joe's mission report as well. Fay  said it was the happiest of reunions,  one of the best experiences of her  life.  Have you noticed that long-legged,  long-legged, big-eyed bird which stands  on DeVar Pollock's lawn? Take a  look, it is Charley Francisco's invention  in-vention and his gift to the Pollocks.  Pol-locks. Glenna Pollock reports she and  Adrian had visitors recently. Son  and daughter-in-law Royce and  Debbie Pollock and family from  Panguitch; June and Hazel Sanders  and son Tyrell of Fredonia, Ariz.  Adrian and Glenna feasted on  Christmas dinner at son Royce's  home.  Jack and Gaya Greenhalgh enjoyed  en-joyed a visit from their son, John  and daughter-in-law Malika and two  children.  Weldon and Alene LeFevre vis-i.ed  vis-i.ed his mother Amplus LeFevre  oer the holidays. The LeFevres  also visited Sara and Malcn Littlc-fidd,  Littlc-fidd, Glenna Pollock, Ora Brinker-hoT  Brinker-hoT and Jack and Gaya Greenhalgh.  Louise Shakespear had her two  gratdsons, Kalahan and Kaden, son  of Darrell and Kaylccn Shakespear  of Lis Vegas, Ncv. here for a few  days.  Ra;mond Brinkerhoff is recovering  recover-ing fron a fall down the back steps  of his lome. Raymond stated he  had heard what a great job the  EMTs dc in our area, but it wasn't  his intentnn to Find out first hand.  Coach Tom Heywood is a patient  pa-tient at Dkie Medical Center following  fol-lowing sugery to remove his  spleen. He is awaiting results of  test after a uagnosis of Hodgkins  Disease. Tht Bryce Valley Mustangs  Mus-tangs seemed to have the heart  missing withou Coach Heywood at  the helm. The oys wish him well  and hope that he will be home  soon. In the mantime, assistant  coaches Lou Dealing and Alfred  Foster are filliig in for him.  Cassie Bybee, Vho is Coach  Heywood's only siter visited over  the holidays. Her hsband Kevin,  son of Clive and Thclma Bybee was  home as well for the holidays.  True Ott and daughters Franci  and Ashley visited with Stan and  Louise Ott recently.  June and Obie Shakespear enjoyed  en-joyed visits from daughter Esther,  son-in-law Bryce Lloyd and their  eight children from Salt Lake City;  daughter Nelda and husband Rod  Brannon and three girls from Cedar  City; Joan and her husband Warren  Plait and three children of New Castle  Cas-tle and Pat and Kelly Shakespear of  Tropic and their children. All were  in attendance for Christmas dinner,  about 32 family members.  Giovanna Sudwccks reported  they had daughter Katherine and  son-in-law Rick Rhodes and sons  Jeremiah, Justin and Eric of  Parowan; daughter Lynette and son-in-law  Kenneth Sawyer and two  daughters, Kendra and Robyn of  Panguitch and granddaughter Cori's  friend Sherlyn Chynoweth home for  the holiday.  Kenneth Alvey drove up from  Las Vegas, Ncv. to visit parents  Royal and Rella Alvey.  Kerry and JoNeal Alvey are in  Hurricane visiting her folks, Russell  Rus-sell and Beverly Wright and  JoNeal's brother, Dennis Wright  and family.  Mondell and Florence Syrett  traveled to the games in San Juan  and Monticello. Florence is also in  the process of having her kitchen  remodeled.  Alfred Foster traveled to the  games as well.  Gayle and Marie Pollock and  children of Longwood, Colo, were  visitors at the Jack Pollock home.  Pete and Keela Mangum traveled  to Phoenix, Ariz, where they met  up with Pete's sister Laura and husband  hus-band Kent Coltam and other friends.  The group traveled to Tucson, Ariz,  where they attended the Brigham  Young University vs Oklahoma  game at the Copper Bowl and witnessed  wit-nessed BYU emerge the victors.  Keela, who said she knew nothing  about football, says she is now an  avid fan. From the 19th row she  cheered like a pro; it was either that  or freeze.  Audrey Hales of Redmond stayed  a few days with Laccy Mangum.  Cami Mangum enjoyed a visit  from her mother Colccn and her  brother Rick F.nglc. Cami, her sis- .  tcr Stacey and husband Gordon Taylor  Tay-lor were pleased by a visit from  Gordon's brothers, sister, mother  and father, all of Alberta, Canada.  Shawn and Crystal Mortenson  have enjoyed a visit from Shawn's  nephew A J. Mortenson of Beaver,  (son Cache's cousin). The two  boys had a great time. The  Mortensons traveled to Cedar to  spend New Years Eve with Shawn's  family, the Lyle and Nancy  Mortensons.  Lynn Richards is home visiting  the Nyle Richards.  Floyd and Alaska Richards,  along with sons, Greg and Tom and  families traveled to Orderville the  day after Christmas for the baptism  of Tanner Crofts, son of Rick and  Nikole Crofts. Tanner was baptized  on his eighth birthday.  Kenna Roberts, sister of Dave  Roberts is here visiting Dave, his  wife Steph and live-wire nephew,  Col ton.  Sheree Garrett has been in Cedar  City visiting with sons Shannon,  Chip and Lane. Lane is on furlough  fur-lough from the Air Force.  Tawn Mangum drove his dad's  18-wheeler to Barstow, Calif, to  bring back a load of \"stuff\" for  Pete. Kevin Patterson traveled with  him.  Greg and Lesa Pollock have had  her parents visiting, DeVon and  Vickie Owens from Panguitch.  Wally and Lynette Orton and  son Steven Orton have been visitors  visi-tors at the Marion Littlefield home.  Sherrell, Karen and Michon Ott  traveled to St. George Christmas  Day and spent three days there keeping  keep-ing a close eye on Karen's mother,  Thelma Cottam, who had suffered a  stroke Christmas Eve. She is reportedly  re-portedly improving.  Verlyn Munson is getting  around much better, also, using a  cane only as needed. Ve wish both  Lynn and Thelma total health.  Tyce and Paula Palmer and children  chil-dren were here visiting over the holidays  hol-idays with the Bart Palmers.  Folks in Tropic were saddened to  learn of the death of Truie Allen.  She was a dear, sweet lady and a  wonderful neighbor. Condolences  go to her sons Lynn and John and  their familes.Margaret Mecham and  Marjorie Mecham had Bill and  Nancy Hubner of West Valley visiting  visit-ing over the New Year's holiday.  Machelle Pollock and son  Kayden spent a night with Grandma  and Grandpa Glen and Barbara Leach  where Barabara held one of her fun  grandkid parties.", "articleTitle": "Tropic News"}, {"id": 3447400, "paper": "Garfield County News", "type": "article", "date": "1995-01-12T00:00:00Z", "year": "1995", "month": "January", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/3c/ec/3cec0ebd4fe6539117d94874ec47c5461b048288.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/ba/ce/bace92e08710f6cee892f40bfb0ec47b9f23f422.pdf", "page": 5, "parent": 3447408, "version": 1739883940207919109, "ocr": "Looking Back At 1994  - The Year In Review  From Page One  raft about 100 yards from from  where the family was camped on  the west shore of the lake.  The death in late August of  William Kroff, 86, of Tooele at  Lower Bowns Reservoir was  determined by autopsy to be  lightning-caused rather than by  natural causes as originally  believed. The body of Kroff had  been discovered at his campsite by  other campers and transported to a  mortuary in Richfield where burns  were discovered and an autopsy  subsequently conducted. He had  been a seasonal fisherman in the  area for many years.  September  Garfield County Sheriff Than  Cooper played a major role in the  arrest at a campground near Panguitch  Pan-guitch Lake of two suspects on first  degree felony charges related to a  Cedar City armed robbery. Acting  on a tip, Cooper checked out the  campground and notified Cedar Cily  law authorities. After locating the  campsite of the two, nearby campsites  camp-sites were quietly evacuated and the  two men, surrounded by officers,  subsequently surrendered. Jacob  Skorniak, 28, of Nebraska was an  escapee from a Colorado correctional  correc-tional facility and James Lee Scott,  24, of Missouri was wanted for  parole violations in Missouri.  A lenghty investigation of  North Star Expeditions, Inc. began  when representatives of the Utah  Attorney General's Office in Salt  Lake City entered North Star's  office on Sept. 7 to copy their  records and halt the company's  program for a day while they  examined and questioned youth  involved in the wilderness program.  At that point, the attorney general's  office said its activities constituted  a \"routine normal inspection\" and  denied that there was any connection  con-nection between their investigation  and the death of 16-ycar-old Aaron  Bacon on Mar. 30. Company  representatives denied any wrongdoing  wrong-doing and said they felt they were  being unfairly singled out by the  unannounced activities and had  nothing to hide.  Garficd County School District  Superintendent Phil Blais  announced the official adoption by  the school board of the district's  new \"Safe Schools Policy.\"  Handbooks were distributed to  parents and students and posters  were in place outlining the policy.  A 51-year-old Grand Junction,  Colo, man died at the scene Sept.  23 from injuries suffered when his  motorcycle failed to negotiate a  curve above Calf Creek Campground  Camp-ground 16 miles north east of  Escalante on Utah Highway 12.  William Tackctt's southbound  motorcycle traveled along the guard  rail before plunging over the rail  and landing some 150 feet down the  cliff side.  New school buildings will be  built in both Tropic and Escalante  after a Sept. 15 board decision. A  new high school is set for Bryce  Valley High School adjoining the  recently-opened auditoriumgym in  Tropic and a new auditorium and  two additional classrooms for  Escalante High School.  October  The Utah State Office of  Licensing sent two letters to North  Star Expeditions outlining alleged  violations and suspending the  cmpany's licenses under conditions  for potential license renewal for the  company. Bill Henry, Escalante,  speaking for the company, claimed  there was no foundation to the  charges noting that he and his  partner Lance Jaggar helped the  agency define its standards at the  time they were developed.  Contractors from Interstate Rock  announced that construction on a  9.59-mile section of John's Valley  Road was nearing completion.  They had been working since May  on the section that extends from the  existing Forest Service boundary to  Widtsoe Junction.  In what Utah's \"PILT Lady,\"  Garfield County Commissioner  Louise Liston called a \"royal  battlegrouynd of controversy,\"and  in an unprecedented victory for rural  Utah and the west, the House of  Representatives passed a 120-percent  120-percent increase in the Payments-in-Lieu  of Taxes (PILT) program.  First authorized in 1976, PILT  funding nationally has remained at a  static level of S105 million. The  new liegislation would, over a five-yea  five-yea period, raise the authorized  amount to about S250 million.  Major changes underway at  Bryce Canyon airport will equip the  facility to handle the rapidly  expanding use of the airport  according to airport manager Greg  Pollock. The county recognized the  need and responded by contracting  for additional parking for planes,  plane tie downs, and separation of  the commercial parking from  general aviation parking. They also  added two new approaches from the  runway to the new plane parking  areas. A new access road has been  added that directs traffic away from  the planes and directly into the  newly paved parking areas. Also  added were two new mobile gas  tanks.  John Henry Mecham of Tropic  shot and killed a marauding cougar  that had killed more than a dozen  domestic cats and a valuable  Dalmatian puppy, even coming  onto his porch to grab its prey.  Owners at North Star Expedi-ions  Expedi-ions removed themselves and seven  of their employees from all  responsibilities and involvement  with the youth wilderness program  and from any contact with the  youth involved in the program,  complying with stipulations in a  hand-delivered letter from the Utah  State Office of Licensing in Salt  Lake City.  The Panguitch High School  boys baseball team captured 2nd  place in State 1-A finals, capping  off a great season.  Two members of Salt Lake  City's HAZMAT (Hazardous Materials)  Ma-terials) team exploded and burned  more than 30 10-inch sticks of 22-ycar-old  dangerous gelatin dynamite  slicks found by hikers just 500  yards off the Burr Trail near  Boulder. Explosives experts theorized  theo-rized that recent heavy rains may  have dislodged the box of dynamiie  sticks from ils original burial place  of years ago, washing it downstream.  down-stream. Only 12 citizens, Garfield  County Attorney Wallace Lee, and  the county's three commissioners  attended the RS2477 hearing Oct.  11 where County Engineer Brian  Brcmncr explained the history iof  RS2477 roads in the county.  (to be continued)", "articleTitle": "Looking Back at 1994 the Year in Review"}, {"id": 3447401, "paper": "Garfield County News", "type": "unclassified", "date": "1995-01-12T00:00:00Z", "year": "1995", "month": "January", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/34/11/341141764cfaf8fa2098aabb70ef35e1f96933a1.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/c5/f8/c5f8932569195fc81c0f4c66ad69f494a94414d6.pdf", "page": 5, "parent": 3447408, "version": 1739892467686178817, "ocr": "Thursday. Jan. 12. 1995 GARFIELD COUNTY NEWS S-A", "articleTitle": "Looking Back at 1994 the Year in Review"}, {"id": 3447402, "paper": "Garfield County News", "type": "article", "date": "1995-01-12T00:00:00Z", "year": "1995", "month": "January", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/bd/16/bd163c9a00706785882b0e48f8f96ed19cfd7836.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/71/a5/71a563637546a4bbf496fa8fd702a3035a333845.pdf", "page": 5, "parent": 3447408, "version": 1739891813625364482, "ocr": "-'-  -,yi  , .... - .  ' : : u y  v - ' V- i ' v  r \"'..; ---, .v ..-;.yV.- a.h  ; v . N  Four-year-old Adam Fitzgerald, son Pam Fitzgerald of Las  Vegas, Nev. and grandson of Sue Rogers of Panguitch, wore  out the adults at this afternoon tubing outing in Red Canyon.", "articleTitle": "Local News"}, {"id": 3447403, "paper": "Garfield County News", "type": "advertisement", "date": "1995-01-12T00:00:00Z", "year": "1995", "month": "January", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/fb/13/fb1339e60bbac689732c02e337769ae95ba8e984.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/e5/f6/e5f6dad4fe3f7779033ec93a32778dc87897d549.pdf", "page": 5, "parent": 3447408, "version": 1739885612803031040, "ocr": "YES, SLEEK AND comfortable  I CAN BE STRONG 1995 I  I CHEVY BLAZER  3 One look al Hit- new iM.-ro-st.vled Blazer leils ou the world of compact sport utilities  : will never he the same. Designed from the inside out to provide a roomy and useful  ; interior. Blazer seeks a perfected balance of car and Iruck-likc attributes. Quality i  T built w ith the robust hardiness of a Chevy Truck, Blazer for 1995 features the exclusive j  i Dr iver Control System, designed to help you feel secure, hatcver the driving conditions :  or situation.  . This is Chevy Blazer. Sleek and comfortable, with all the strengths ofa Chevy truck. 3  1  - \" . ' t-K !  ( . ojCs  $ Blazer IS 4-Door 4x4 '  I  i SPECIAL LEASE RATE OF C A f PER MONTH  I \" FOR 24 MONTHS J4.UU  1 24 MONTH I.KASE  Down I'uvjiu-nt 1500, Sec. Dep 375, plus First Mo. Payment,  T;i, Lie, iind Fees.  i aad9E classic c?rj I  ; dimsiiK i r  j MOTORS CHEVHULtm  i Jeep Richfield 896-4441 CZCC'li  ' , r \" I Toll Free 800-825-9674 VilV ' ;  ' ' 3 L-1 r I 120 South Main Rixhfield f  i i.m,,i..i.IiV i -.i-i-u im-n - in n-iirni iio-ii-nri -i nn-n iiirii-iir  W wy i dwiiiiwih W fWWWB1  jjj J0\"00 jTa aVJ'aVaViT  V  I NOTICE OF TAX INCREASE f  The Upper Sevier River Water Con-  servancy District is proposing to set a  property tax levy which will generate  $15,000 in property tax revenue.  The Upper Sevier Water Conservancy  5 District is proposing a total budget of :  1 $30,000.  3  3-  In previous years, the district has not S  : levied property taxes. '$  Ji.  (a) The proposed $15,000 in pro-  posed property tax rate revenue will  J come from a proposed tax rate of  I .0001000. i  6 ft  I A home valued at $75,000 in the  Upper Sevier River Water Conservan- :  cy District which based on last year's  property tax rate and budget paid $0  in property taxes would pay $5.10 in  I 1995.  8 k  & ft  & All concerned citizens are invited to a k  pi  public hearing on the tax increase to  be held on Friday, January 20, 1995 S  at 12:00 noon at the Garfield County  $ Courthouse Commission Chambers.  y Ss", "articleTitle": "Local News"}, {"id": 3447404, "paper": "Garfield County News", "type": "unclassified", "date": "1995-01-12T00:00:00Z", "year": "1995", "month": "January", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/ad/84/ad8458ccc85679f8ef1c6045f4a62254fbf54688.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/d7/6f/d76fd6ed9b5a45b9e1d5dc453fe96578399c8e05.pdf", "page": 5, "parent": 3447408, "version": 1739895152558735365, "ocr": "\"But the God of all grace,  Who hath called us unto His  enternal glory by Christ Jesus  after that ye have suffered a  while, make yoiu perfect,  stablish, strengthen, settle  you. I Peter 5:10", "articleTitle": "Local News"}, {"id": 3447405, "paper": "Garfield County News", "type": "page", "date": "1995-01-12T00:00:00Z", "year": "1995", "month": "January", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/94/a5/94a5e5d5a8b1839e9b68bb3f6f0253a3fda39ca5.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/6e/f4/6ef422add68a1874b12d4a1080bf9d311e985813.pdf", "page": 6, "parent": 3447408, "version": 1739887006490558465, "ocr": "\"But the God of all grace,  Who hath called us unto His  enternal glory by Christ Jesus  after that ye have suffered a  while, make yoiu perfect,  stablish, strengthen, settle  you. I Peter 5:10", "articleTitle": "Local News"}, {"id": 3447406, "paper": "Garfield County News", "type": "unclassified", "date": "1995-01-12T00:00:00Z", "year": "1995", "month": "January", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/05/45/0545ea6d22517737bad4d672d378d49a33cee90f.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/4b/b4/4bb4128cec0fc1706ac7dbee73382a6384f95adc.pdf", "page": 6, "parent": 3447408, "version": 1739890927808282626, "ocr": "6-A (tARFIELD COUNTY NEWS Thursday. Jan. 12. 1995 ,,,.,,, TIITZZTT .., -", "articleTitle": "Local News"}, {"id": 3447407, "paper": "Garfield County News", "type": "advertisement", "date": "1995-01-12T00:00:00Z", "year": "1995", "month": "January", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/19/c4/19c443afe639758076383cf9d4e060e832742c53.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/7e/09/7e09e301ac0caa555473a86211d7f34316e1a084.pdf", "page": 6, "parent": 3447408, "version": 1739885131440586754, "ocr": "Y jii 5f;39? r;l\" A  Pfek I (gji & IPs  INaES)1. o-j, 1 come CMarkelill'Be Siving JPlvoayvoo ; VgSJ A  A -.-Vr'?1 $2$ jift Certificates CjoodToxvard Slny vT Y  A jj JWerchandise Of our Choice. INo'-'ur- A  Y - ro oA Snler Bach Timeyiou Sire On. -T \"\"\"\"- A  A CJ Y  A Tortlla Chips 2 Ji Trop,c.a\".a twister 0  Z! ( ButtPr P A Grade cJ 0  - i our er Popcorn ) w Turkey Hidden Valley X  A PePPeridse Farm Xd&L 7Qtf lb &VX Dressing X  X Stuffing ; J fl Ranch-Diion Ranch-WBacon 0  X ci 7Q IS' &$ soz. $1.29 A  A 14 02.9 1.7 Boneless, Skinless 1?Mx tSfel X  A Western Family Fryer Breasts Slli Jf Kleenex Y  Y Lt. Amber Walnuts Iff co iq rh -SSi Ultra Facial A  A eoz. V&.CV skippy Lynn Wilson Tyson Chicken m' ma' Y  X H Chunks N Gravy Chili Brick Nuggets or Patties mW Kleenex 0  X pjazza 22o, 65 C l40, $1.79 $1.89 lb. Wm Asst. Facial A  A Pizza 111$ Lynn Wilson Hormel 175 ct. 89C 6  X Combo or Pepperoni  I Beef Tamale LlTTle izziers Kleenex l?115 6  A 23 oz' $U39 8 P, 2.69 each 12 0, 89C Soft Tissue A  A qar6e 0 Ka John Morrell isoct. 89C fl 0  Y u sfllr ,K eoioc Mi&R GoIden Smoked Vi -w5 j A  0 HomiPAeQS JiXo Extra Lean Hams Nestle llJ X  A 3?0z. 254.99 CEKj e$1.39lb. Asst. Candy Bars V  0 ,n1V Haif-siiced $1.49 lb 389C Western Family Y  X cool whip ' ; f I jj Ha\"s\" ' lu Oranse Juice y  Y TOPPinfi rTfvYr.-l Be,ty Crocker cotf A  A 7Qf I I.Ui.titIJ Pop Secret 12 oz. O? Y  X so?. 4 9 ir's S Butter Popcorn 0  Y , Parkay Small Choice S 9npr 1 t1 fiQ A  A f-, :; Margarine Navel Oranges Cea a J- 3Ph 3I.O V  p 0 ,eo,289t si,99C fjy A  X fcclcin) ) Liquid Dish Soap Y  Western Family fOSi 1 .;-. ;iW 22oz 79C Y  0 Complete Allergy pS\"- saia r v - 2 irW A  A Medicine : \" Lare Slicina X  0 24 c$2.59 j Tomatoes \" 4 Y  $ Flex TctbrbaGgeeen 59C Ib. we Cleaner 9  Y shampoo Tablets 29C lb. g .60, $1.99 22 52.89 X  Y ,5oz.$2.09 24a$49 1 X  Y Condltfoner Mz ( Jb-Jtfi a, v  X .so, $2.09 p Vr:& -- X  A AbsoZuteZy SlXSv J k ThanfcYbufb Y  X I No Dealers Ngfs, Uc Inprecitc Cvciy Penny ll shopping 1 A  Y li,,,,, Heqse I - VXeu Spend flt VJcIscmo Ksrfsct &,,,SiSJ A  Vii' To Make 4 ' 1 ir Jvl \"Nr -r r . F. , '.JlVj A  AfW wercome Marked 10 South Main - Panguitch, Utah 84759 ifS n OH 0 10) tf\"1 Y  Y 1 TV? vour - cr unrc I F\"5 1 C :Wed Jan. if VfizJ A  l Your j Store Hours 1 j 0 n 12.13.14 V  Xli!i! 8:00 g.m.-9:00 p.m. uUULi ULl LJ U V 16:i7:jf 6", "articleTitle": "Local News"}]}