{"numFound": 50, "start": 0, "numFoundExact": true, "docs": [{"id": 3473574, "paper": "Garfield County News", "type": "page", "date": "2001-09-13T00:00:00Z", "year": "2001", "month": "September", "day": "13", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/09/74/0974e277586e4d5a6b52225376f6f979058abdcd.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/a6/68/a668a0a32cad3a80387551b2a8d99189814e4cde.pdf", "page": 1, "parent": 3473624, "version": 1739892929964539904}, {"id": 3473575, "paper": "Garfield County News", "type": "masthead", "date": "2001-09-13T00:00:00Z", "year": "2001", "month": "September", "day": "13", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/17/00/170092e221485750eb248e771d0665f254529394.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/2a/9c/2a9c9674b4b73338c58c00de5852ab8c2c5d9581.pdf", "page": 1, "parent": 3473624, "version": 1739885432283332608, "ocr": "h met mm  Volume 80 Number 31 Tropic, Utah Thursday, Sept. 13, 2001 Price 750"}, {"id": 3473576, "paper": "Garfield County News", "type": "article", "date": "2001-09-13T00:00:00Z", "year": "2001", "month": "September", "day": "13", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/00/95/0095d468713e719aae6e4226e812b486747be45d.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/75/93/7593d1f046423cf0b51f0cc3013bc607a924ea6b.pdf", "page": 1, "parent": 3473624, "version": 1739884487208075268, "ocr": "Annual Garfield Memorial  Hospital Fundraiser  Dinner Set For Sept 21  PANGUITCH Garfield  County's social event of the year,  the Annual Garfield Memorial  Health Care Foundation Dinner, has  been set for Friday night, Sept. 21  at 6:30 p.m. in the Panguitch LDS  Stake Center.  This annual fund raiser event,  many months in the planning,  features door prizes to draw the  citizenry, an outstanding evening  meal, awesome entertainment, and a  silent auction.  Funds raised from this year's  premier event, will assist Garfield  Memorial Hospital with purchasing  a hydraulic fift for the Long Term  Care Facility and a new defibrillator  for the hospital emergency room.  Each year this event seems to  take on greater dimension with so  many individuals and groups  rallying to make it a successful  evening.  This year enormous effort has  gone into making the \"door prizes,\"  which seem to be what draws  attendance, into a particularly  attracting part of the annual dinner.  In fact, the door prizes have turned  out to be so alluring, some have  said the dinner should be changed  to a dinner and auction to double  the funds raised.  Topping the prizes this year are  two items which have attracted  much interest. The first is \"An  Overnight Shopping Spree in Cedar  City,\" a $200 value with one  night's lodging provided at the new  Stratford Court (formerly the  Quality Inn) recently purchased by  Doug KnelJ and son, Stephen Knell  who plan to make the Stratford and  Best Western El Rey into the  premier Shakespearean hotel com-,  com-, plex with bellmen, valet parking  and all the big city amenities.  This packet also contains a goft  certificate for breakfast at Denny's  Restaurant, $25 gift certificate for  Christensen's, $25 gift certificate at  Lin's Market, $20 lunch at Winger's,  Wing-er's, $20 gift certificate at Ap-  plebee's for dinner and $15 tickets  to the Westates - Fiddler's Six  Theater.  The second exciting door prize  is a full year free television cable  service and free installation, a $300-$325  $300-$325 value from Mallard Cable-vision.  Cable-vision. Other outstanding door prizes  pri-zes are two certificates for a King  Spa Room at Best Western Ruby's  Inn each night easily a $143 value.  Every community has generously  gener-ously contributed door prizes thjs  year. Also featured are four rounds  of golf with carts valued at $20  each at Cherokee Springs Resort  south of Hatch on US89, two  dinners at the Flying M Restaurant,  value $30, 10 gallons premium gas  from both Leland's Texaco and  Chevron, a $20 value . now,  possibly greater by week's end,  breakfast, lunch and dinner  certificates for one person from  Grandma Tina's, two complete  dinners from Foy's Country Comer  Cafe, an $18 value, $25 gift  certificate from Bryce Canyon  Lodge, and dinner for two at Bryce  Canyon Lodge.  Numerous smaller donated  items, T-shirts, crocheted dollies,  coupons and gift certificates were  also donated from Arby's, Subway,  C-Stop Pizza & Deli, Hogi Yogi,  Huckleberry's Gallery & Gifts,  Thomas Auto Repair, Bryce Valley  Inn, Grandstaircase Inn, Serenidad  Gallery.  One night's lodging at Red  Brick Inn Bed & Breakfast, valued  at $72.15, one night at Bryce Way  Motel $55, two gift certificates for  one-half-hour therapeutic body  massage trealments by Kim .  Brinkerhoff Massage located at  Rumours, two handcarved Shado-wood  Shado-wood Art plaques each $50 value,  lube, oil & filter from Bryce  Canyon American Car Care Center,  Dodge Quartz Watch from Classic  Motors in Richfield a $30 value,  $50 cash prize from Erich and  Sharlene Bretthauer of Bryce  Woodlands Estates, a V-Tech Caller  ID cordless phone, a Toshiba caller  (See DINNER oh page 2-A)  DINNER  From Front Page  ID cordless phone, and two caller  ID boxes from South Central  Communications; and two steak  dinners at Bryce Pioneer Village.  Lynn's NAPA contributed five  quarts of oil and a filter, Bryce  Canyon Trading Post a $30 girft  certificate and $49 mandells, Hoo  Doos Restaurant, dinner for two  $30, Bryce Canyon Pines, two  dinners for $25, several $5 gift  coupons from Henrie's Drive-In, a  handcrafted picture frame from  Buffalo Java, value $29, a remote-controlled  remote-controlled car from Radio Shack,  valued at $40, a $10 gift certificate  from the Old West Cowboy Store,  $15 Pressed Petals Candle from. Red  Canyon Indian Store, dinner for  two, Big Rock Candy Mountain,  $40, and a first aid kit from Garfield  Memorial Hospital.  Other door prizes include a Field  & Stream 4 lb. sleeping bag valued  at $35, an Igloo 5 gallon beverage  cooler, $25, a $25 gift certificate  toward your monthly power bill, all  from Garkane Energy, one night's", "articleTitle": "Annual Garfield Memorial Hospital Fundraiser Dinner Set for Sept. 21"}, {"id": 3473577, "paper": "Garfield County News", "type": "article", "date": "2001-09-13T00:00:00Z", "year": "2001", "month": "September", "day": "13", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/04/15/04157495231b9aac769d0cb99c4df1c41d1f67ae.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/31/55/315599571d37ab3cb95f012fc2dabe5c82bae145.pdf", "page": 1, "parent": 3473624, "version": 1739889690026180608, "ocr": "J...-,;-.:.:. !.: f '- i: 1 1 Si$  X f'A M ,:V: 1. f I : P-,-''\"' !  V. , w iLl!!H! f,, Jt -J , ,\"aJ,, , . lJimmatM  riniitiiiniil ; lit P 1 1 i 1 1 k: Wk$Mkk&k mMimmiSik;mkm. siSiiiiiiMiiiiiisii' gMgisn  m& iiw  ' i ! Wkki. ' wk '; . J? ' i ! !:;:;: 1 1 g kkMkkWkkWMkW4kk W ' iL.:H?iilPlii:?tli :1 1  kmvkkkkkmkMr..: ?' j I . --''f p?4  sttiaftwy u t in.:. .-ms viP  wmLkmmmmkki i ' t ,W1 ' t, i r psmi fj\"  -nnir r0!Si . mQ:  k-:k y -r--&  '-'.'rk;kykkk '; ' ' ' ;f & : ':k ' ' '' '''\"\"'&s,  kmkT:4k-:;kkry , 'i-'.-' 'Jrr . \"  ' km\" : K... k f : ,1 - i i $ff-  . . . .., i; 1 m-mmmMSkk. Sk4 mMm, kmm:k:km  Grateful Panguitch volunteer fire fighters Gary Leach and  Justin Hatch show new equipment, a Hurst Jaws of Life  SpreaderCutter and a new hydraulic pump which increases  their capability to serve the public. The extrication device will  permit firefighters to extricate victims from even the largest  vehicles at accident scenes. Fire fighters underwent special  training in its use. Generous donations at fund raising events  yielded the $17,000 to pay for the equipment.", "articleTitle": "Local News"}, {"id": 3473578, "paper": "Garfield County News", "type": "article", "date": "2001-09-13T00:00:00Z", "year": "2001", "month": "September", "day": "13", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/8b/c4/8bc4138d07c37fa1b98dbd352c2facc2d46a2071.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/9b/6d/9b6d23219001fad7c2cab312c64293fe9e781799.pdf", "page": 1, "parent": 3473624, "version": 1739893000613396480, "ocr": "Robert Orton Called To LDS  Second Quorum Of Seventies  PANGUITCH Elder Robert  F. Orton, 64, a Panguitch native,  has been called by the LDS Church  to serve in the Second Quorum of  the Seventy.  Orton and wife, Joy Dahlberg  Orton returned from service in Romania  Ro-mania over a year a half ago where  he had been mission president. Elder  El-der Orton served as only the second  president that the Romania Bucharest  Bucha-rest Mission had ever experienced.  During his tenure, the mission  work expanded from four to 1 5 cities  cit-ies and when the Romanian translation  transla-tion of the Book of Mormon was  introduced to the people, the first  two meeting houses were under  construction and the Republic of  Moldova was opened for missionary  work.  The Ortons returned and he resumed  re-sumed his legal practice and has  now set that aside to devote full  time once again to the work of the  Lord.  Elder Orton is the eldest of four  children born in Reno, Nev., to H.  Frank and Gwen Riggs Orton. He  was reared Panguitch in what . he  explained as an \"idyllic boyhood on  the ranch,\" where he learned to  work hard, breaking horses and driving  driv-ing cattle on the range.  Orton said that it was during his  boyhood that he observed firsthand  the effect that a single spiritual experience  ex-perience can have on a person's life.  He recalled when he and his mother  begged his father to attend church  on Sundays and prayed that he '  would have a change of heart.  When Elder Orton turned 12, his  next youngest sibling was born and  their father attended LDS Sacrament  meeting for the blessing of that  baby.  Orton said that after that experience,  experi-ence, he vowed to never again let  another man do what he ought to  do, that is performing ordinances  for his children. Within a month of  1 \" I.... ,  ; I  \"\"\"'. .  ' -  i, t L  Elder Robert Orton  that experience, the senior Orton  became a member of the bishopric  and within a couple of years, a  member of the stake presidency.  He is now 91 recounts Orton and  has remained a faithful member.  Elder Robert Orton served his  initial mission for the LDS Church  in France where he gained valuable  leadership experience as a district  and branch president. Upon returning  return-ing home he forsook earlier aspirations  aspira-tions to become a medical doctor  for a new found interest in political  science. This path took him to  Washington, D.C. where he worked  for the staff of U.S. Senator Wallace  Wal-lace F. Bennett from Utah.  It was in Washington, D. C.  that he met and courted his bride-to-be,  Joy Dahlberg, who was a University  Uni-versity of Utah student working in  . a summer internship as a commercial  commer-cial artist with the National Aeronautics  Aero-nautics and Space Administration.  They married June 13, 1963 in the  Salt Lake LDS Temple. Orton received  re-ceived his bachelor of arts in 1961  from Brigham Young University  (See ORTON on page 2-A)  ORTON  From Front Page  and his juris doctor from the University  Uni-versity of Utah in 1964.  They are the parents of six children:  chil-dren: Lori Anne, 37, (Mohamed  Khodadad); Robert Kent, 36,  (Kristina); Elizabeth, 32 (Mathew  Elggren); Emily, 30, (Matthew Jacob  Ja-cob Hamblin); Rebecca, 27, (Derek  Anderson); Allison, 24, (Gregory  Dunstan).", "articleTitle": "Robert Orton Called to LDS Second Quorum of Seventies"}, {"id": 3473579, "paper": "Garfield County News", "type": "article", "date": "2001-09-13T00:00:00Z", "year": "2001", "month": "September", "day": "13", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/b1/de/b1dee7e485ab7b874ae982b0bf139f5703de17aa.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/65/59/655996c67d4da1cbc9353ad71a206f12bda898d5.pdf", "page": 1, "parent": 3473624, "version": 1739886020122378243, "ocr": "Varney-Griffin  Prescribed Fire  Ignited Monday  CEDAR' CITY Monday,  September 10, 2001, the Bureau of  Land Management (BLM) ignited a  prescribed fire north of the Griffin  Ranch homestead located approximately  approx-imately five miles northwest of  Wide Hollow Reservoir near Esca-lante.  Esca-lante. The fire was ignited by hand.  By this action the BLM hopes  to increase the critical deer winter  range and elk habitat by the  reduction of big sagebrush, pinyon,  and juniper, and lessen the soil  erosion in that area.  This past spring, land was  cleared of continuous vegetation,  thereby creating fuel breaks. These  breaks are located along Forest  Service and BLM boundaries.  From these fuel breaks the ignition  operation will began to widen and  strengthen the holding lines. This  will allow firefighters to have more  control of the prescribed fire.  There is a minimum of 25  personnel on hand to ignite, observe  ob-serve fire behavior, and do fire suppression  sup-pression if it becomes neces sary.  Three engines will be on location  (See VARNEY FIRE on Page 2A)  VARNEY FIRE  From Front Page  and other support crews and resources  re-sources on standby. The project area  will be patrolled until no smoke is  present.  After the prescribed burn is  completed the area will be seeded  sometime between December,  2001, and February, 2002, in order  to take advantage of winter and  spring precipitation. The seed  mixture would contain a minimum  of 80 percent native plant species.  Any questions concerning the  prescribed fire should be addressed  to Anne Stanworth at (435) 586-2401.", "articleTitle": "Varney-Griffin Prescribed Fire Ignited Monday"}, {"id": 3473580, "paper": "Garfield County News", "type": "article", "date": "2001-09-13T00:00:00Z", "year": "2001", "month": "September", "day": "13", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/33/73/3373e3dd4f6cc04943a5fd40ac13369bc191649f.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/c7/2f/c72f577f8433e70b8df789a616f5069e52021e88.pdf", "page": 1, "parent": 3473624, "version": 1739892316808675329, "ocr": "Illegal Killing of Cougars, Bobcats  At Mt. Button Under Investigation  CEDAR CITY - The illegal  killing of seven cougars and 15  bcocats in the Mount Dutton area  northeast of Panguitch is being  investigated by the Division of  Wildlife Resources, and conservation  conserva-tion officers are asking for the  public's help in determining who is  responsible.  \"To date, officers have seized 65  illegal snares while conducting the  investigation,\" says John Schijf,  Southern Region lieutenant for the  Division of Wildlife Resources.  \"The illegally taken cougars and  bobcats were found dead in the  snares. In addition to the cougars  and bobcats, officers have  documented the killing of two foxes  and one hunting hound which were  also caught in the illegal snares.\"  The investigating officers utilized  util-ized a group of 14 sportsmen to  locate and remove 21 of the illegal  snares, and six of the illegally taken  bobcats, during July.  The snares, constructed of high  strength, small diameter cable, are  capable of capturing and killing an  animal for years after they are set.  The illegal snares recovered during  the investigation appear to have  been set and intentionally abandoned  aban-doned to capture and kill cougars.  Snares are not a legal method  for the sport harvest of cougars in  Utah. Snares are a legal trapping  device for furbearers and coyotes in  Utah when used in accordance with  the state's furbearer harvest  regulations. Snares may only be  used when they are permanently  marked with the trapper's identification  identi-fication number, and when they are  checked every 48 hours.  \"Wildlife officers have been  investigating this case since 1998,\"  Schijf says. \"It has proven very  difficult to apprehend those responsible.  respon-sible. We hope that an appeal to  the public may provide new evi-  dence to positively identify and apprehend  ap-prehend those responsible.\"  Wildlife officers are working  closely with the Garfield County  attorney to develop evidence for  prosecution.  The investigating officers welcome  wel-come any additional information  that would help in the investigation,  investi-gation, or any information about  similar snares found in the area  during the fall.  To report wildlife violations or  information about this case, please  call the Help Stop Poaching  Hotline at 1-800-662-3338, or write  to the Help Stop Poaching Email  address: GWARDEN state.ut.us.  Those who report information  are not required to provide their  name.", "articleTitle": "Illegal Killing of Cougars, Bobcats at Mt. Dutton under Investigation"}, {"id": 3473581, "paper": "Garfield County News", "type": "article", "date": "2001-09-13T00:00:00Z", "year": "2001", "month": "September", "day": "13", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/da/4f/da4f52c1c0ee198b0f7ae163d507e8a11b5c0cbf.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/5f/57/5f5756d1b216831050b779a810d8d617a472d29e.pdf", "page": 1, "parent": 3473624, "version": 1739886798264336384, "ocr": "BLM Will  Complete  Sandy Creek  Prescribed  Burn  The Sandy Creek Area, six  miles northwest of Panquitch, could  be ignited as a prescribed fire before  the end of September by the Bureau  of Land Management (BLM). The  project is intended to create a  diverse ecological condition by  increasing the diversity in the  vegetation from a dominate 85  percent sagebrush area to a mix of  grass, forbs and shrubs.  This approach is designed to  improve biological diversity,  watershed stability and rangeland  health. It consists of five units with  1,100 acres to be burned by hand  and helicopter ignition. However,  weather conditions will be the  determining factor whether or not  BLM ignites the prescribed burn.  During the past few years small  portions of this project have bcen  fired. This fall will be a  continuation of those burns. In  (See SANDY FIRE on page 3-A)  SANDY FIRE  From Front Page  order to keep the prescribed tire  under control there will be a  minimum of 35 personnel on hand  to ignite the fire, observe fire  behavior, and be prepared to handle  fire suppression if it becomes  necessary. Three engines will be  on location and other support crew  and resources on standby. The  project will be patrolled until no  smoke is present.  Smoke may affect the area near  Highway 89, which is three to four  miles to the east of the project area.  This would only happen under  stable wind and lift conditions.", "articleTitle": "BLM Will Complete Sandy Creek Prescribed Burn"}, {"id": 3473582, "paper": "Garfield County News", "type": "article", "date": "2001-09-13T00:00:00Z", "year": "2001", "month": "September", "day": "13", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/16/d9/16d9061b975f3b93fb6f74f94f1de9b327a8dd14.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/86/1c/861c1d3342cf32c713608d6c3227b43306cbdae4.pdf", "page": 1, "parent": 3473624, "version": 1739891718244794370, "ocr": "Hwy 12 Corridor Meetings  Set In Area Communities  PANGUITCH The Steering  Committee for the Highway 12  Scenic Byway Corridor Management  Manage-ment Plan sent out update letters  this week which also announced  important town meetings scheduled  throughout next week.  The letters went out to those  who had attended earlier meetings,  but at press time no news release  had been received at the News nor  had notices of the public meetings  been posted in local communities.  The update letter states that a  second series of town meetings  regarding the Highway 12 Corridor  Management Plan (CMP) have  been scheduled. The Steering Committee  Com-mittee and Planning Team will be  reviewing the Draft CMP and  describing the next steps to be  taken in submitting an application  for All American Road Status.  Meeting Schedule  The meetings are scheduled as  follows with all beginning at 7  p.m.:  Monday, Sept. 17: Panguitch  City Council Chambers  24 South 200 East, Panguitch  Tuesday, Sept. 18: Tropic  Bryce Valley High Auditorium  721 W. Bryce Way, Tropic  Wednesday, Sept. 19: Esca-lante  Esca-lante Community Center  89 North 100 West, Escalante  Thursday, Sept. 20: Boulder  Community Center  351 North 100 East, Boulder  Monday, Sept. 24: Bicknell  Wayne High School Auditorium  265 North 400 West, Bicknell  Bruce Fullmer is identified in  the update letter as chairman of the  steering committee and is apparently  appar-ently the person at P.O. Box 200,  Panguitch, UT 84759 with a phone  listing of (435) 676-1 102 to contact  anyone has questions.  Update Letter - Sept. 2001  Utah's Scenic Highway 12 is  considered one of the t \"crown  jewels\" of the state's designated  scenic byways. Local elected officials,  offi-cials, economic development professionals,  pro-fessionals, travel councils and land  management agencies have accepted  the challenge to gain national \"All  American Road\" designation , for  Highway 12.  In order to accomplish this goal,  a Corridor Management Plan  (CMP) must be prepared, according  to the letter. The steering  committee and planning team are  working hard to complete the CMP  by mid-November 2001. Here are  some important details regarding  the preparation of the CMP and  how persons may become involved.  Draft CMP Goals  GOAL 1 - Protect and improve  the quality of life and economic  vitality of local communities along  Hwy. 12 by balancing the development  devel-opment of tourism with that of  other existing and future economic  sectors.  GOAL 2 - Protect and enhance  the integrity of the intrinsic qualities  quali-ties along the Hwy. 12 corridor.  GOAL 3 - Balance the impacts  of increased tourism with the impacts  im-pacts to local communities and the  intrinsic qualities along the highway.  high-way. GOAL 4 - Hwy. 12 will provide  a safe driving experience for the  diversity of motorists utilizing it.  GOAL 5 - Provide a quality experience  ex-perience to the visiting public traveling  trav-eling along Hwy. 12.  i", "articleTitle": "Hwy 12 Corridor Meetings Set in Area Communities"}, {"id": 3473583, "paper": "Garfield County News", "type": "unclassified", "date": "2001-09-13T00:00:00Z", "year": "2001", "month": "September", "day": "13", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/4e/75/4e753e15135c87557e7bf33abf86243b37d49428.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/ff/ff/ffffe534fc93c43b556db59b67e483d481782cd0.pdf", "page": 1, "parent": 3473624, "version": 1739895352152031233, "ocr": "Weather  Date High Low Precip.  Sept. 5 88 44  Sept. 6 87 47  Sept. 7 76 32  Sept. 8 68 39  Sept. 9 81 27  Sept. 10 85 32  Sept. 11 83 . 38  Weather is reported by Boyd  Smiih, Dixie National Forest  weather observer, Powell District,  Dis-trict, and is an official part of the  United States Weather Service  statistics.", "articleTitle": "Hwy 12 Corridor Meetings Set in Area Communities"}, {"id": 3473584, "paper": "Garfield County News", "type": "page", "date": "2001-09-13T00:00:00Z", "year": "2001", "month": "September", "day": "13", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/6b/17/6b1795d4aa22cf44c99ea7f87a1d2f0f875d9313.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/9a/a8/9aa8ee6ac29ddb1b84f7725cd9b7fd3cb0d6ef7e.pdf", "page": 2, "parent": 3473624, "version": 1739892675969024000, "ocr": "Weather  Date High Low Precip.  Sept. 5 88 44  Sept. 6 87 47  Sept. 7 76 32  Sept. 8 68 39  Sept. 9 81 27  Sept. 10 85 32  Sept. 11 83 . 38  Weather is reported by Boyd  Smiih, Dixie National Forest  weather observer, Powell District,  Dis-trict, and is an official part of the  United States Weather Service  statistics.", "articleTitle": "Hwy 12 Corridor Meetings Set in Area Communities"}, {"id": 3473585, "paper": "Garfield County News", "type": "unclassified", "date": "2001-09-13T00:00:00Z", "year": "2001", "month": "September", "day": "13", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/c7/30/c730af938f7ce95eaa89c79119c032bf896965bc.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/54/a3/54a3cc7d29c8e99400ef55eda3c8b7b644c324dc.pdf", "page": 2, "parent": 3473624, "version": 1739888284992012289, "ocr": "2-A GARFIELD COUNTY NEWS Thursday. Sept. 13. 2001", "articleTitle": "Hwy 12 Corridor Meetings Set in Area Communities"}, {"id": 3473586, "paper": "Garfield County News", "type": "wedding", "date": "2001-09-13T00:00:00Z", "year": "2001", "month": "September", "day": "13", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/52/ff/52ffdba2b4aeee2414a53fc5543535e63367e56f.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/f1/cc/f1cc324a764b44f60ba110f2a0c5398b0a5f3f39.pdf", "page": 2, "parent": 3473624, "version": 1739884086359490561, "ocr": "r ,  : '.- :x . : x  Jennifer Lindsey and  Joshua Hughes  Lindsey  Hughes  PANGUITCHRICHFIELD  Jennifer Nicole Lindsey of Richfield  will become the bride of Joshua  Bill Hughes of Panguitch on Friday,  Fri-day, Sept. 14 in Richfield.  The couple will be honored at a  reception that same evening from 7-9  7-9 p.m., at the Richfield LDS 7th  Ward Cultural Hall at 400 West  200 North in Richfield.  Everyone is invited to attend  The bride-to-be is a daughter of  Larry and Julie Ashurst of Richfield  and Mark and Doris Lindsey of  Truman, Minn. Grandparents are  Alvin and Carolyn Hardman of  Koosharem, Udell and Gloria At-wood  At-wood of Richfield and William Le-Duc  Le-Duc of Wisconsin.  The prospective bridegroom is a  son of John and Shirley Hughes of  Panguitch. His grandfather is William  Wil-liam Hughes of Salina.  The couple will reside in Richfield.", "articleTitle": "Lindsey/Hughes"}, {"id": 3473587, "paper": "Garfield County News", "type": "unclassified", "date": "2001-09-13T00:00:00Z", "year": "2001", "month": "September", "day": "13", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/93/df/93df6718d24fc2280fdb572b2ffd3161e2b3deaf.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/9b/f1/9bf180829d16fc75913756f65238204f469fe8e6.pdf", "page": 2, "parent": 3473624, "version": 1739892060943548417, "ocr": "ProductionManagementSubscriptionsMailing  120 North Main Street P.O. Box 127  Tropic, Utah 84776-0127  435-679-8730 Fax: 435-679-8847  E-mail: garfnewscolor-country.net  Copyright, Garfield County News, 2001. All rights  reserved. Reproduction, reuse or transmittal of all matter  herein is prohibited without prior written permission by the  publisher or editor.  Garfield County News (ISSN: 1064-7309) is published  each Thursday in Tropic, Utah 84776 for $26 a year in  ; Garfield County and $34 out of Garfield County by the  Garfield County News, 120 North Main, Tropic, Utah 84776.  Periodical postage paid at Tropic, Utah 84776. POSTMASTER:  Send address changes to Garfield County News, P.O. Box  127, Tropic, Utah 84776. Email: garfnewscolor-country.net  Single Copy75C  Katie Thomas, Publisher Nancy Twitchell, Editor  Rebecca Bales, ComputerLayout  Deadline for wedding, anniversary, missionary announcements  announce-ments regular news, and community columns: 5 p.m. Thursdays;  Thurs-days; classified ads and legal publications: 5 p.m., Friday.  Copy submitted after deadline may not be used until the  following week's publication. Deadline for display advertising:  adverti-sing: 12 Noon on Monday.", "articleTitle": "Lindsey/Hughes"}, {"id": 3473588, "paper": "Garfield County News", "type": "article", "date": "2001-09-13T00:00:00Z", "year": "2001", "month": "September", "day": "13", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/31/79/3179eb46175af6f8eef7dac40483fe6c744e482e.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/01/1d/011de2498aead0ce7365b90e69a7c33b923f9a86.pdf", "page": 2, "parent": 3473624, "version": 1739888083695828992, "ocr": "Letters To The Editor  What is your opinion? This newspaper welcomes opinion from its readers  ' concerning any subject pertinent to southern Utah. While there is no restriction  restric-tion in length, we request good judgment and letters which are to the point.  Anything of a libelous nature or defamation of character will not be considered  consid-ered for publication. Letters must be signed with writer's name, address and  telephone number. Names will be published along with letter. Views  expressed in these letters do not necessarily reflect the opinion of the editor  or publisher or express the viewpoint of this newspaper.", "articleTitle": "Letters to the Editor"}, {"id": 3473589, "paper": "Garfield County News", "type": "article", "date": "2001-09-13T00:00:00Z", "year": "2001", "month": "September", "day": "13", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/3f/80/3f808450f6bbf3259c8faa17677d3b39b87faf50.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/9b/ff/9bffc3ed1f68e656cb9c02081ed3ac982f44fe2b.pdf", "page": 2, "parent": 3473624, "version": 1739892797195943937, "ocr": "Are You Really Paying?  Re: We Do Pay Our Water Bills  by Shirley Chidester, published  Aug. 23, 2001.  In this micro community, a  source for vital issues is not  necessarily the media or public  records, but it is often word of  mouth.  If the city administration is  paying their water and sewer bills,  how they are paying? in  pennies, nickels, dimes, quarters,  one, two, five, ten, fifty or hundred  dollar bills, travelers checks, bank  draft, personal check or payroll  deduction was not the question  as long as is not in Italian Lira or  Mexican Peso.  The talk of the town is that the  city council passed a waiver of the  water and sewer bills for the city  administration. If true, who proposed  pro-posed it? Who voted for it and who  voted against it?  Then, the city council got the  smell of the resentment of the residents,  resi-dents, so they reversed the waiver.  If true, who was the first to cave  in? Who voted for it and who voted  against it?  Then, the city council played a  game to give everybody a raise of  flat $40 or so to cover the water and  sewer charges. Is this rumor true?  Harshad P. Desai,  Panguitch", "articleTitle": "Are You Really Paying?"}, {"id": 3473590, "paper": "Garfield County News", "type": "article", "date": "2001-09-13T00:00:00Z", "year": "2001", "month": "September", "day": "13", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/f5/73/f573b07fda425bb0b6f67813415d9b547c53c1a3.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/d1/c0/d1c006944de929db25fba3c8549368f88058e234.pdf", "page": 2, "parent": 3473624, "version": 1739894905301368836, "ocr": "I:nri:vilh Havs  By Wynona Henderson  679-8560  Gary Johnson's good friend  Elwood Eddy of Manti was here for  Virginia Johnson's funeral. We  will all miss Virginia B. and her  friendly smile and sense of humor.  We extend our love and sympathy  to the Johnson family.  Visitors at Delano and LaRona  Callahan's home were his sister  Mona Rae and husband, Clarence  Twitchell of Antimony. They  came to check on their mother,  Golda Mclnelly.  Robert and Gwen Mclnelly took  Ramona Copfer to Beaver to the  dentist.  Klin and Nancy Chynoweth  were in St. George for the wedding  (SEE HENRIEVILLE on page 3A)  HENRIEVILLE  From Page 2A  of Dallas Clark to Emilee Liston  on Friday.  Robert and Gwen Mclnelly  celebrated their 48th anniversary by  taking a drive up through Johns  Valley and a trip to Cedar City.  An outdoor picnic was held for  the Henrieville Relief Society  Home Enrichment program. Lyl-lian  Lyl-lian LeFevre prepared hamburgers  with all the trimmings and the rest  was pot luck. An enjoyable time  was had by all who attended.  Several releases in positions-were  positions-were made on Sunday at the Henrieville  Hen-rieville LDS Ward. After 18 years,  Collette Mathews was released as  ward choir director, Nathan Piatt as  assistant director and Krista Piatt  and Denise Clark as pianists. Nathan  Na-than Piatt was sustained as the new  choir director with Collette Mathews  Math-ews as accompanist. Mary Lou  Neilson was released as compassionate  compas-sionate services leader and LaRona  CalhhaiisustainwrUTe  Rhoda Shafcr went with Duane  and Donna Metcalf of West Valley  City to Diamond Springs, Calif.,  to visit her sister-in-law, Elaine  Henderson. She later went to  Washington, Utah with Teora Willis  Wil-lis and stayed with her brother,  Boyd Henderson. Teora went on to  the St. George LDS Temple, then  brought Rhoda home on Saturday.  She reports that Boyd is doing better.  bet-ter. (See HENRIEVILLE on page 6A)  HENRIEVILLE  From Page 3A  Rae Smith enjoyed visits from  George and Barbara Paris of  Parowan, then Don and Dorothy  Burkhardt of Peoria, Ariz, came and,  they went to Parowan to visit.  Margo Smith came from Escalante  and they spent a couple of days in  Parowan visiting George and Barbara  Bar-bara Paris.  Guy and Beverly Thompson had  a busy summer. Bev was in Las  Vegas last week to help tend  grandkids while one grandchild had  surgery. They will be going back  to Las Vegas this week for the wedding  wed-ding of their nephew, Greg Reece,  son of Tom and Ann Reece. Their  daughter, Cecile Thompson, has  recovered from her recent illness and  has gone back to Las Vegas to  school and work.  Jerry and Bonnie Mecham of  Green River came to visit their  families here, Lula Moore and  Ralph Chynowcth and others and  delivered some delicious Green  River watermelons.  Lula Moore has her great-grandkids,  great-grandkids, Cheyanne and Rowdy  Miller of Panguitch staying for a  few days.  Frankie and Gayle Moore have  been replacing their water lines.  The Scout Pack meeting was  held with Dan and Sarah Rose in  charge. Mike Barker earned all 20  of his activity pins and moved on  into the 11-year-old scoul group.  He also earned his Faith in God  award. Billy Roberts earned his  bobcat, he is new to scouts. Alex  Johnson received his wolf.  Gary and Sandy Johnson received  re-ceived word of a new grandson born  to Jed and Becca Albrecht. He has a  brother to welcome him home.  Sandy went to be with them for a  few days.  Chris and Krissette Roberts  have had Chris' children Billy, Kari  and Sara here from Portland. Ore.  for a month. The girls returned  home but Billy will be slaying.  Wyhona Henderson and Kathryn  Pollock started the pre-school this  week with a total of 10 students.  Lizzie Piatt, Jarom Johnson, Dayna", "articleTitle": "Henrieville News"}, {"id": 3473591, "paper": "Garfield County News", "type": "advertisement", "date": "2001-09-13T00:00:00Z", "year": "2001", "month": "September", "day": "13", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/60/51/6051542db2afd14422746767307ccc0780338749.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/f2/48/f24820c375022cbeda6c200ccc94ce17fa63b086.pdf", "page": 2, "parent": 3473624, "version": 1739885338105479170, "ocr": "Presents The-1-  MBUUtt B  Fri. & Sat. Sept. 21 & 22  7 p.m.-11 p.m in Tropic  Mention This Ad For 15 Off on Your Dinner  i i i i i i i i i i i i i i i i i i i i i i i i i i i i i  CA Snoved In Quilt Shop  - gpiNspl -  : All Fabric 40 Off  K A A11 Books Pictures, & Notions 50 Off -  I Pictures 30 Off :  - . Handmade Quilts On Sale Z  ltW Spread The Word Bring A Friend  Sale hours: Friday 10 a.m. - 7 p.m.  'KK? Saturday 10 a.m. - 4 p.m.  -435-676-8666435-676-2525 -  Claudia Crump 190 N. Main Panguitch  i I I i i i i i i i i i i i i i i i i i i i i i i i i i i  raif8iiii)g SBass i  Southwest Utah AHEC is currently looking  for individuals in Garfield and Kane County J  who are interested in. becoming a  LPN (Licensed Practical Nurse) or J  RN (Registered Nurse). .  ' Depending on the levels of interest,  ' an outreach program is being considered 1  for both Panguitch and Kanab.  If you are interested in seeing a class J  : : i established in your community,  :: please contact Southwest Utah AHEC  . at 435-865-8573.  V  DEE'S  Fruit Track j  : Coming To Panguitch  Friday, Sept. 14  i f ?mkskppks  RdspkniesSraa'terries  : ?lm$MlM'w$ i  Smt Corn lomtoes  j Cantaloupe fffllermclon :  i Grapes & Pears  j (jMier Mis &Vegetalfejj  ' NEW WESTERN !  Parking Lot J  j NEW BEGINNING!  j Baptist Church j  ! 585 East 50 North Panguitch j  j Sunday !  J Bible Study - 9:45 a.m. j  : Worship -11 a.m. J  I Wednesday j  j Bible StudyPrayer - 7 p.m. I  I David Payne -Pastor :  ! For Info., Call 435-676-2254  j Everyone Welcome j  Proclaiming God's  Precious Gift  rZT First Baptist Church  of Escalante  826-4915  Sunday School 10 a.m.  Worship Service 11 a.m.  Sunday Evening 6 p.m.  J .Wednesday Evening 7 p.m.  J Pastor:  Daniel Parish  M Gospel Noii-Demminational  Christian Fellowship  f Thursay Eves at 7  Praise & Bible Studvi  Sundays, 9:30 a.ra  Praise & Worship  Services J  V 406 E. 3005. (Hwy 39) -Kanab J  FOR SALE  1999 Mistubishi  RS Coupe  Automatic 38000 Miles  Excellent Condition  CALL  435-676-8259  or  435-676-2558  rr w un nun  Ooffrinton DOS TtMrWskn Srfr  ONLY $9 A MONTH  32 CHANNELS 24 HOURS  R&R SATELLITE  435-676-2377 or 676-8276  Panguitch  CORNERSTONE  BIBLE CHURCH  CA Bible-Teaching CiurcTx  Where Everyone is Welcomes  Sundays at 4:30 p.m.  30 West Center Panguitch  (On Center Street  Across From Welcome Market)  t", "articleTitle": "Henrieville News"}, {"id": 3473592, "paper": "Garfield County News", "type": "article", "date": "2001-09-13T00:00:00Z", "year": "2001", "month": "September", "day": "13", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/f8/fe/f8feffc2aa511d74c366d318223d9395b72e3513.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/9e/39/9e39653c123d236b0fb118379ea2f729a48582c3.pdf", "page": 2, "parent": 3473624, "version": 1739892702785306627, "ocr": "Cqnnonvillc Hows  By Marva Fletcher  679-8521  Stacy and Angie Ott and children  chil-dren spent the weekend here visiting  their parents Bob and Mira Loy Ott.  They have moved from their home  in California to Washington, Utah.  Al and Sandy Stone have a new  grandson, Derek Jay Stone, son of  Jay and Carolyn Stone of Las Vegas,  Ve-gas, Nev. The little fellow weighed  8 pounds 1 1 ounces, a healthy start.  Jeff and Aria Porter and children,  Elyse, Royce, Kayla and Dayne  Porter, also Jay and Mara Porter and  children, Julia and Camille, attended  Cannonville LDS Sunday School  meetings. They were staying at the  campgrounds.  Jacob Hammer, who is attending  attend-ing Utah State University in Logan,  Lo-gan, spent the holiday weekend here  with this parents, AC and Rita  Hammer.  Erica Racker came from St.  George and visited her parents,  Alma and Anita Fletcher. She  brought her two sons and her sister,  Pauline Hansen's three sons with  her and they all spent an enjoyable  day at the fish hatchery in Hatch.  In Cannonville LDS Sacrament  meeting, High Council member  Bob Ott presented Stephen Clark's  name to be advanced to the office of  a high priest.  Visiting at Howard and Dorothy  Leavitt's home were their son,  Howard Leavitt, Jr. and his wife,  Annette of Kaysville; a grandson  Cody Leavitt and his wife of Las  Vegas; Monte and Launa West and  son of Salt Lake City and Kelly '  Lee and family of Panguitch. They  enjoyed visiting and helping Howard  How-ard to harvest his garden. Howard  and Dorothy went to Cedar City on  business on Tuesday.  Chris and Billie Heaton of  Enqch spent Thursday night with  his mother Evelyn Heaton. Merle  Allen came from Fredonia and visited  vis-ited with her sister Evelyn, then  went to Panguitch and visited Lark  and Bea Reynolds at the hospital  and were met by another sister,  Nola Davis and her daughter,  Jovana. Lark was able to leave the  hospital, so his daughter-in-law,  Jewell Reynolds, brought them  home and she and daughter, Michelle  Mi-chelle spent two nights here with  them. Other family members vis-  ited them also. Lark is improving  and the pneumonia has cleared from  his lungs.'  Glenna Fletcher went back 40  years when she and Larry attended  her 40th-year class reunion held at  Hurricane Elementary School.  They enjoyed memories of songs  played by a classmate's family  (Joan Griffen), they rode in the  Peach Days Parade, a school days  program was held with a dance and  social hour, and they elected a  ' committee to plan the next reunion  in three years, when the class of '61  will be 61 years. Twenty-nine  classmates and their spouses were  present and enjoyed visiting and a  delightful lunch was served.  Vaughn Twitchell was able to  come home from the hospital after  being in critical condition with spinal  spi-nal meningitis. All were amazed  when he gave the priesthood lesson  in the meeting Sunday morning.  His wife Mae said he is steadily  improving. All of their family,  members were here Saturday. Ron  and Leah came from South Jordan;  Craig and Lee Twitchell, Karl and  Lori Munford, and Doug and  Tammy Twitchell all came from  Cedar City and Arjean and Cherlyn.  We are all happy that both Vaughn  Twitchell and Lark Reynolds, who  were so critically ill, are now back  home and getting better.  Steven and Louise Willis spent  the Labor Day weekend with his  mother, Bonnie Willis and brought  her some wood for her fireplace.  Since we have had so much record-breaking  record-breaking heat this summer, it is  hard to convince ourselves that fall  is here and winter may be another  and opposite extreme, so it's time  to prepare.  The William Patterson Willis  family reunion was held here at the  park on Saturday, Sept. 1. Didn't  find out who came, but judging by  the number of cars and people at the  park, they seemed to be very well  represented.  David Clayton, Jr. had surgery  and is now recovered and back in  school.  Rosie Fletcher came and picked  her mother up and they went to  visit John Fletcher in Henderson,  Nev. They returned in time to  spend Labor Day canning peaches '  and pears.  lodging at Boulder Mountain  Lodge, a $72 value, two dinners at  Panguitch\" Lake Resort, $30,  several handmade clocks by Cal  Davies, $30 value and many many  more still coming in.  The hospital dietary staff, as in  years past, take this event very  seriously and after planning the  perfect menu, work for days beforehand  before-hand chopping, slicing, dicing,  baking and preparing to show off  their collective curlinary talents.  Special entertainment will be  provided by the Cooper family with  an ongoing silent auction for a quilt  and a limited edition print provided  by Ruby's Inn. Also that evening,  The lucky winner of the quilt that  has been on display at Zions Bank .  will be announced.  The sponsoring entity, the Hospital  Hos-pital Foundation, is a fund raising  arm of the medical delivery system,  working year round on various yard  sales, bake sales, quilts sales,  books and various projects to raise  funds for important projects relevant  rele-vant to health care delivery.", "articleTitle": "Cannonville News"}, {"id": 3473593, "paper": "Garfield County News", "type": "article", "date": "2001-09-13T00:00:00Z", "year": "2001", "month": "September", "day": "13", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/66/16/66165ea620fbd852c73f1f6b6a36d859066d63dd.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/a3/7a/a37a32e6ff26305b90d5c3aec8fcfdb4ab9c6ca5.pdf", "page": 2, "parent": 3473624, "version": 1739892870348800002, "ocr": "Antimony z::i  By Betty Wiley  624-3215  Jack and Bill Rowan and then-wives  then-wives and mother came for their  annual visit to Antimony, their old  home town. On Sunday evening,  Lana Moon and her husband, along  with approximately 19 others, .  pitched their tents all over the lawn.  Dennis Twitchell and son, Salt  Lake City, came for the Labor Day  holiday.  The former Cindy Riddle Wil-key  Wil-key and her husband and baby and  Kenneth and Kathy Riddle and family  fam-ily were here Sunday for the birthday  birth-day of their sister, Janene Riddle  Savage.  Mona Lundgreen Black had the  Eli Lundgreen Reunion for 160-175  of her relatives.  Eugene and Valerie King hosted  the 95th birthday party for her father  fa-ther Lionel Smith. While they  were here, all of the children got  busy and tore down the big old barn  which had stood there for years.  Thanks to Sheriff Marty Gleave,  the Garfield County Ambulance  crew and EMT's for their help on  Friday to get Van Wiley off the  East Mountain after he was thrown  off a colt and seriously injured. He  was taken to Garfield Memorial  Hospital in Panguitch, then came  home, but is now at Sevier Valley  Hospital in Richfield. His wife,  Betty, and Bill and Marcia and Bill  Wiley brought him here and Roma  Wiley Henrie is here to help out.", "articleTitle": "Antimony News"}, {"id": 3473594, "paper": "Garfield County News", "type": "article", "date": "2001-09-13T00:00:00Z", "year": "2001", "month": "September", "day": "13", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/8c/ab/8cabc8a2ef6925451562415e81d072370e113c8a.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/43/c4/43c477579b549a1922bc955debf64627e6fb4a7b.pdf", "page": 2, "parent": 3473624, "version": 1739887375445655552, "ocr": "CNA Class  Set For Kanab  BRYCE VALLEY A Certified  Certi-fied Nurse's Aid (CNA) course in  Kanab, through cooperation with  Kane County Hospital, Southwest  Utah Area Health Education Center  and the Kane School District ATE  Program, is scheduled to begin  Monday, Sept. 24 and finish in  midJanuary.  The four-month class will be  taught by Registered Nurse Sheree  Rechsteiner and will be held every  Monday evening from 4 until 8  p.m. in the home economics room  at Kanab High School.  Cost for an adult will be $210  which covers registration fees and  tuition, 'plus students will have to  buy additional textbooks. High  school students who take the course  will have their tuition and registration  registra-tion fees covered through Applied  Technology Education funds from  their district, but will still need to  buy their own textbooks.  Registration will be held the  first night of class, or anyone interested  inter-ested should call Sheree Rechsteiner  Rechste-iner at 467-3342.", "articleTitle": "CNA Class Set for Kanab"}, {"id": 3473595, "paper": "Garfield County News", "type": "wedding", "date": "2001-09-13T00:00:00Z", "year": "2001", "month": "September", "day": "13", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/5d/e9/5de961d7fb12a143f86481ad9b74f941b54ec25e.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/e5/73/e5734bc4f456efcf188b79a4ff786d7a0bdda033.pdf", "page": 2, "parent": 3473624, "version": 1739885536853622785, "ocr": "' J  f ft  f  I . w  x- zc ,  TZf  Marcy Munford and Gerry Liles  MunfordlLiles  ESCALANTE Marcy Munford,  Mun-ford, Kannarraville, will become the  bride of Gerry Stanley Liles, Escalante,  Esca-lante, on Saturday, Sept. 15 in the  St. George LDS Temple.  A reception in their honor with  dancing will be held that same evening  eve-ning from 6 until 8 p.m. at the  Tom Pugh residence, 750 North  Main street in Kanarravile.  An Open House will also be  held from 6 until 8 p.m. on Saturday,  Satur-day, Sept. 22 at the Escalante LDS  Stake Center at 80 East Center  street in Escalante.  The bride-to-be is a daughter of  Clyde and Diana Munford of Kanar-raville.  Kanar-raville. The prospective bridegroom is a  son of Jeris and Bonnie Liles of Escalante.  Es-calante. The couple will make their  home in Cedar City.", "articleTitle": "Munford/Liles"}, {"id": 3473596, "paper": "Garfield County News", "type": "page", "date": "2001-09-13T00:00:00Z", "year": "2001", "month": "September", "day": "13", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/c4/8d/c48dcdd46507aa46dfe522233b2dc6b18806c89e.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/e0/f9/e0f906897951c99f2adad3e2c8ec1f4d93574973.pdf", "page": 3, "parent": 3473624, "version": 1739885389542326272, "ocr": "' J  f ft  f  I . w  x- zc ,  TZf  Marcy Munford and Gerry Liles  MunfordlLiles  ESCALANTE Marcy Munford,  Mun-ford, Kannarraville, will become the  bride of Gerry Stanley Liles, Escalante,  Esca-lante, on Saturday, Sept. 15 in the  St. George LDS Temple.  A reception in their honor with  dancing will be held that same evening  eve-ning from 6 until 8 p.m. at the  Tom Pugh residence, 750 North  Main street in Kanarravile.  An Open House will also be  held from 6 until 8 p.m. on Saturday,  Satur-day, Sept. 22 at the Escalante LDS  Stake Center at 80 East Center  street in Escalante.  The bride-to-be is a daughter of  Clyde and Diana Munford of Kanar-raville.  Kanar-raville. The prospective bridegroom is a  son of Jeris and Bonnie Liles of Escalante.  Es-calante. The couple will make their  home in Cedar City.", "articleTitle": "Munford/Liles"}, {"id": 3473597, "paper": "Garfield County News", "type": "article", "date": "2001-09-13T00:00:00Z", "year": "2001", "month": "September", "day": "13", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/27/a2/27a2ca69026e98b93a84234904dee53356bdd864.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/52/dc/52dc5756a51ed63357b75356719079ce87ed0791.pdf", "page": 3, "parent": 3473624, "version": 1739890993039147008, "ocr": "r MmmiXWtM. hW$m?im  ,V . v : ; :.::;::- : - ' :  v-lliliil3ll:: f jrSPSit  llllpilililll f f PSittl Silfef Sip', jif: ?ss:: p: i. I : ::i:is it. 1 .!: .M:f MWMM&M  1 , 1 f,v H IIISHJ  I ' il ? !; ;\"PS;tp;:i::::,.,,. :':s;;;;f liy  P , . s m '3  M- f ft V ' : ;\" f ::. 1, If p. :: ! P, ! ' ' IttlPIMr: I -: \"' i ' -: ;  iWm-': - . ' ; ,.:. X '' 'y- :'; ' ' . . . ' -::v:, , : v-::-. ,  Six Garfield County residents participated in  the 5K Run over the Labor Day weekend in  Parowan which was part of the Iron County  Fair. Those pictured are Shaun Marshall, Skye  Marshall, and dad Steve Marshall, all  Panguitch, April LeFevre and son Levi  LeFevre, both Tropic, and Chase Englestead,  Panguitch. Levi finished in second place overall  over-all and Chase finished in third. April LeFevre  finished first in her age division with Steve  placing second in his age division. Skye also  finished third in his age group.", "articleTitle": "Local News"}, {"id": 3473598, "paper": "Garfield County News", "type": "unclassified", "date": "2001-09-13T00:00:00Z", "year": "2001", "month": "September", "day": "13", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/98/3b/983b028d05a0cdcc8227480f1633d48328ad92a9.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/53/e3/53e3972d08edde507a2e7ac7d03c6b6de1c104c5.pdf", "page": 3, "parent": 3473624, "version": 1739889084928622594, "ocr": "Thursday. Sept. 13. 2001 GARFIELD COUNTY NEWS 3-A", "articleTitle": "Local News"}, {"id": 3473599, "paper": "Garfield County News", "type": "article", "date": "2001-09-13T00:00:00Z", "year": "2001", "month": "September", "day": "13", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/91/89/91897714efa1ab233d3d0cab1127cda3fa18cf7f.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/66/06/6606db4961c313aef80b201b9574391b3d57789e.pdf", "page": 3, "parent": 3473624, "version": 1739886052180492289, "ocr": "Panguitch t lews .  By Mamie Talbot  676-8084  The early September fall days  here in the valley are beautiful. The  view from the western foothills  catches at the throat, with a breeze  from the south and the mottled  green floor of fields and pastures  stretching north and east to the purple  pur-ple peaks and red cliffs. All this is  topped by a blue, blue sky and  white fluffy clouds. A lone antlered  antelope shares the view. It's not  surprising that folks who spend part  of the year in the warmer south can \"  hardly wait to get back here.  Janalee Wilcock, daughter of  Hal and Roma Wilcock, was married  mar-ried to Dave Hahn on Aug. 1 1 at  the Wilcock residence in Cedar  City. Grandmother Norma Talbot  and many other relatives were present.  pres-ent. Recent visitors at Norma Talbot's  Tal-bot's were Ellis and Louise Tait,  Charley and Jolene Mohar and their  children and Cynthia Shiner and  two children of Vernal. Also  Norma Jean and Kay B undy and Hal  and Roma Wilcock dropped in for a  short stay.  Glen and Connie Whiting received  re-ceived their call to serve an LDS  mission in Little Rock, Ark. Connie  Con-nie is a daughter of George and  Thora Proctor. They will leave in  early September.  In the Panguitch LDS 1st Ward,  Nathan Shaun Houston was ordained  or-dained an elder by Bishop Evan  Boshell,  Janette L. Orton, wife of Keith  Orton of Panguitch, was buried in  the Panguitch Cemetery. She is  survived by her husband Keith, a  son, Stephen K. Orton, and a  daughter, Leslie Bishop, of California.  Califor-nia. Her daughter Lori is buried in  Panguitch. They have four grandchildren  grand-children and two greatgrandchildren.  great-grandchildren. Leon LeFevre, son of Leon and  Pearl Houston LeFevre, and brother  of Ike LeFevre, died in Globe, Ariz.  Ike, his son Jerry, and two sisters,  Margaret Woolsey of Layton and  Bonnie Lamoreaux of St. George,  and some of their children went to  Globe for the funeral.  LaVera Henrie Tobler Hannig,  sister of Ercil, Gerald, Orald and  Nile,' all deceased, died in Nevada.  Amy Stephenson and John and  Caroline Henrie took their mother  Mary Henrie to Nevada for the services.  serv-ices. Joshua Hunter Holman, son of  Kelly and JoAnn Holman, was  blessed by his father in the Panguitch  Pan-guitch LDS 4th Ward.  Arthur Daly and his wife were  here for Louise Henderson Adams'  funeral services. They were able to  visit with many old friends.  Jean and Fae Ann, sisters of the  late Jim Cooper and Gwen Cooper  Davis Edwards, were here visiting  and eniovine beine home again.  Maria Gilbert and her mother  purchased the former Bryce Canyon  Cafe building.  The Spencer Gunn family sodded  sod-ded the yard west of their Panguitch  home.  Mike Connell and family have  been here visiting with his mother,  Edna Clarke.  Beth Cherrington Evans was  here doing work on her home.  Harry J. and Rolayne Gardner of  Idaho Falls, Ida. were at the home  of his mother, Hilda Gardner.  Lige Moore is spending the  summer in Panguitch visiting family  fam-ily and recuperating from an injury.  Jerran Ancira has been here visiting  vis-iting with his parents, Tex and  Charlene and brother Konrad.  Jim and Jill Mullcncaux and  family have moved to Cedar City  where he is working.  Wayne Houston and his grandson  grand-son were here. He is a son of the  late Tommy Ray and Emma Houston.  Hous-ton. The former Suzette Simkins and  children spent time here visiting  family and friends.  Ann Farnsworth had her sister  Lynne here as a visitor.  Louise Crosby visited her  mother Ida, and Barney Shannon  and sister and brother-in-law Gloria  and Laine Sevy.  George and Geraldine Robinson  of Ogden were here visiting with  her mother Mary Henrie and caring  for her sister Mary Ann Church,  who had surgery. Mary Ann's  grandchildren Angela and Andy,  children of Gary, were here also,  Fred, Janet, Meisha, Michelle, Tori  and Logan Houston came to help  son Derek gather information from  Tropic Reservoir for his master's  degree work at Brigham Young  University and to visit.  The Don and Alia Orton reunion  was held at Red Point.  Caroline Rose, Allison Sherrat  and Janell Jensen and families visited  vis-ited with their mother Opal Miller,  and began organizing a Frank and  Roene Syrett Houston reunion for  next year.  Keith and Roma Henrie came  from Arizona for a family reunion.  They also attended the mission report  re-port of Dale and Elaine Baldwin.  They were in the same area. Ted and  Christine Owens of Dallas and their  daughters Pamela and Amber were  here for the Owens reunion as well.  Lula DeLong, widow of Clark  DeLong and former resident of Panguitch,  Pan-guitch, celebrated her 80th birthday  at the Senior Citizens Center in  Moab. Lu and Clark operated Pan-guitch's  Pan-guitch's first dairy.  Jerry and Deanna LeFevre prepared  pre-pared a birthday dinner and invited  his sisters, LaRayne Lindsay and  RayLynne Johnson and their families,  fami-lies, to help celebrate his father  Ike's 84th birthday. All the family  except three grandchildren surprised  him with the cookout.  Maxine Crosby went with her  daughter, Jaynell and husband Phillip  Phil-lip Bailey, to attend the wedding of  a grandson Tyler, son of Norman  and Sherril Crosby in the St.  George LDS Temple.  Erin Houston and his fiancee  Robyn were here to get acquainted  with all his family. An October  wedding is being planned.  Delia Mae Miller, widow of the  late John Miller, her sons and their  wives, Clair and Marilyn and Steven  Ste-ven and Alisha, and her daughter  Karen and family were here staying  at the White Bridge Campground  for a few days.  Frank and Cecile Orton have  been here most of the summer.  Their son Ron came to help his  father with some projects.  Blaine Tebbs is teaching a class  for anyone interested in gathering  genealogy. The LDS Family History  His-tory Center invites more people to  make use of its extensive resources.  Betty LeFevre attended the LeFevre  Le-Fevre reunion and spent time with  her sister Grace and Rex Sandberg.  Bruce and Jolene Hatch have  been in their Panguitch home for  part of the summer.  J. Ned Richards, his son Frank  Richards and Kay Richards were  home.  The Senior Citizens bus took a  group to the Vernal LDS Temple,  Dinosaur Museum and Quarry and  the Castle Dale Pageant.  Kathleen Church, a dean at the  university in Tempe, Ariz., spent  several days at home visiting with  family and friends.  Max and Loa Sevy went to San  -Diego to be present at the baptism  of their son-in-law.  The lawns and gardens in town  have suffered from lack of irrigation  water iliis pat week. A pipe in the  irrigation system ruptured. The  garden produce is being harvested  now.  In the Panguitch LDS 1st Ward,  conference was held. The ward  campout was held at Red Point  also.  Bob and Juanita Smith spent  several days in Ogden visiting with  their four children and families.  They also visited with Bob's sister  LaRue Jensen in Payson. She is in  a care center there.  In the Panguitch LDS 3rd Ward  the youth speaker was Brittany  Frandsen. Adult speakers were  Cindy Stewart, Debbie Pollock,  Sherrie Burningham and Sandy  Packer. The ward choir sang a special  spe-cial number.  A combined LDS Young Men  and Young Womens activity was  held at Red Canyon.  Folks were delighted with Art  Cooper's lovely home and furniture.  furni-ture. Art's son has been here from  Texas and helped him plant trees.  Speakers in the Panguitch LDS  2nd Ward were Val Church, who  spoke about tolerance and civility  and Calvin Poll, who discussed  strengthening the youth and whose  job it is to do so. Kristin Huber  played a beautiful rendition of  \"Sweet Hour of Prayer\" on the piano.  pi-ano. Panguitch native Marva Smith  Hanson, age 95, died last week in  Santaquin. She was the daughter of  early Norton folks, Asa and Evalina  Norton Smith.  Steve Talbot of Escondido,  Calif., and his son Eric and daughter  daugh-ter Amanda Talbot, stayed overnight  over-night with Mamie Talbot. They  were on their way to Brigham  Young University in Provo where  (See PANGUITCH on page 5-A)  PANGUITCH  From Page 3-A  the young people will settle in for  school. Their brother Justin flew  up later. Steve then stopped at  ' mom's on his way back to Califor-  nia. Panguitch makes a good \"way  station\" for loved ones.  The Keith Tacys have moved  out of their home this week so that  the new owners can move in.  Nancy Houston is the new librarian  li-brarian at the elementary school.  The youth speakers in the Panguitch  Pan-guitch LDS 4th Ward were Landon  Fullmer and Shaun Marshall.  Stake speakers were Kirt Robinson  and Kay Hatch. Lynn Alien, who  has served under four bishops, was  released. Curtis Barney was called  as the ward clerk.  Members of the American Legion  Le-gion and Auxiliary held their annual  cookout at the Tebbs Ranch. Fifty  to 60 people enjoyed mutton,  chicken and com-on-the-cob.  Guests were George and Wanda  North, who are the District 7 leaders.  lead-ers. Special guests were Dr. Don  Lappe and associates and a big  mountain goat which Bill Kay  spotted on the hill to the North  (just above the creek). Bill had a  good pair of binoculars and everyone  every-one got to view it using these although  al-though it was easy to identify it  with the unaided eye. Several people  peo-ple called Norm McKee and he said  it probably moved in from the Beaver  Bea-ver Mountain area. He scanned the  area the next say but did not see it.  If anyone does see it again, Norm  would like to be notified as soon as  possible.  Frank Henrie has a broken leg  from a fall. Bob McCullough got  some broken ribs when he was on a  trail ride.  DUP members from Camps  Cornelia and Loyhova want to  thank Gary Owens and the people  who helped him move the coal out  of the DUP Museum basement. It  has been a concern for some time.  The next big project is to find  someone to remove the old furnace  from the basement.  The Troy Norrises had friends  and relatives from near and far here  for the blessing of little Taylia Nor-ris.  Nor-ris. She was blessed by her father  with the help of many priesthood  holders, including her grandfather  Norris. Mom Ann Marie's parents  are serving an LDS mission so  were not here for the joyful occasion.  occa-sion. Luke Tebbs, son of Bishop  Mike and Margaret Tebbs was ordained  or-dained a priest. Margaret's parents,  Ken and Mary Jones of Salt Lake  City, were here. All the family  members attended the funeral for 3-week-old  Cherish Hope Syrett,  daughter of Bryce and Cherish  Tebbs Syrett, in Tropic. Our hearts  go out to the family.  Marvin and Maurine Worthen  Scowgard have bought the Lamar  and Clara Worthen home next to  Art and Beverly Crosby and have  been here this summer. Maurine  says it's great to be home again.  Ray and Julie Ross Richards and  three little boys have moved to Salt  Lake City, where Ray works.  Daughters of Utah Pioneers '  camps Loyhova and Cornelia met  together on Sept. 4 at the city library  li-brary for their first meeting of the  year. They will have all their meetings  meet-ings together this year and will  meet from October on through May  at the Senior Citizens Center on the  first Tuesday of each month at 4  p.m. New members and visitors  are welcome. Captain Grace Sand-berg  Sand-berg of Loyhova Camp gave a fine  history of the early county and people  peo-ple stretching from Antimony to  Bryce Valley. That area is now  called Johns Valley and includes the  former town of Widtsoe. Johns  Valley gets its name because of the  many men named John who settled  there, owned land and were very  active in the area. Marie Liston  gave the lesson \"History of Iron  County.\" Hostesses were the Loyhova  Loy-hova Camp officers.  Verda Oldham, Loyhova Camp  secretary, is in Salt Lake City to be  with her sister, Cecil Dawn Porter,  whose husband Que Porter is in the  hospital. The Porters will be glad  to get back home to Escalante.  Raymond Roundy has had major  surgery in a Salt Lake City hospital.  hospi-tal. We wish him a full recovery.  Cory and Cami Talbot and two  little boys, Zachary and Noah, formerly  for-merly of Provo, stayed overnight  with Grandma Mamie Talbot on  their way to Phoenix where they  will live now. Cory will join a  law firm in Phoenix. He is the son  of Lyle and Kathy Talbot of Sandy.  Maxine Crosby had family at  their Panguitch Lake cabin last  week.  The Earl and Beulah Allen family  fam-ily reunion was held in August.  Over 100 Aliens ate their dinner  here in town then went to Kon's  Ranch for activities.  Panguitch LDS Stake Conference  Confer-ence will be held on Sept. 16 at 10  a.m. in the Panguitch Stake Center.  And From Earl Roe  676-2376  Jay and Dudley Proctor had family  fam-ily members visiting recently.  Arlyn Proctor and his wife, Ann  along with their daughter, Christine  and her three children came from  Syracuse and Centerville to visit  with family and friends and to attend  at-tend the wedding of Kenneth Tebbs.  Kenneth Jones stayed with Mike  and Margaret for several days. Dudley  Dud-ley also sent some interesting information  in-formation on Jay's family, (Myron  Proctor family). The six living  members are now 80 years of age or  older. Kenneth is the youngest (80  this month) then in order of age:  Merle, Jay, George, Thomas (Tom,  living with his daughter, Shana  Rae, in Caliente, Nev.), and Aleta  Furlong (95) in Logan.  Received a nice letter and another  an-other book of the entire Burma  Shave story from Louise Goulding  Crosby and learned that she also  sent me the one I lost. She slightly  chastised her sister, Gloria Sevy for  not reporting the Owen and Rebecca  Orton reunion held at our Senior  Citizen Center on July 21st. There  were around 70 people jn attendance  and a special part of the program  was honoring their mother Ida  (Goulding ) Shannon. Ida's \"baby  brother\" (Louise's words), Morris  Orton, was also honored. Both Ida  and Morris are in their 90' s and the  only survivors of a family of seven  children. Everyone enjoyed the  reunion and agreed that they were  fun.  Nin and Lois Miller called to  give me the low down on the  George William and Anna Harmon  Cherrington reunion which was  held last weekend at the Jess Cherrington  Cher-rington family home (second house  east of the Blue Pine Motel) which  is now owned by Beth (Cherrington)  (Cher-rington) Evans. George and Anna  had seven children, Phil, Alf, Jess,  Louella, Alice, Ken and Myra. I  remember all of these except  Louella and Alice, but the families  I knew best were those of Alf, Jess,  and Myra because they had children  of or near my age. Although only  23 family members were able to  attend, most of the seven families  were represented by children, grandchildren,  grand-children, great grandchildren or  great, great grandchildren. Those  attending were George (Alfs son)  and Kay (Riggs) Cherrington, Nin  and Lois (Sedgewick) Miller  (Alice's daughter), Beth (Cherrington)  (Cherring-ton) Evans (Jess's daughter), Riley  Miller and Lucille (Miller) Bridges  (Myra's son and daughter), Lynn  and Janette Sedgewick (Alice's  son). Those comprising the grandchildren  grand-children and their children were Ned  Evans and his family, Brent and  Cherry Owens and their grandchildren  grandchil-dren and Randy Cram and his family.  fam-ily. (I hope I haven't missed anyone!).  any-one!). On a historical note, Alf and  Jess built the original Beaver Dam  Lodge in Ipson Canyon shortly  before the war .(1937-1938?). Alf  also built the home that Wallace  and Billie Miller purchased.  On their way to Cedar City to  pick up their new foreign exchange  student from Brazil, Joe and Margaret  Marga-ret Decker were able to attend the  Joseph Victor and Vera Decker family  fam-ily reunion which was held in  Parowan. Joseph and Vera are Joe's  grandparents. There were over 75  family members present and as at  most family reunions, everyone had  an enjoyable time. Joe and Margaret  Marga-ret now have two exchange students  living with them for this school  year.  Debra McKee's mother, Emo-gerie  Emo-gerie O'Donal, says she enjoys reading  read-ing the Panguitch News and liked  to see the Burma Shave rhymes  again. She read the column where I  mentioned \"Dog Days\" and sent me  this article clipped out of an Arkansas  Arkan-sas newspaper entitled \"Dog Days\"  by Benson Fox.  Harold and Winona Sevy held a  family barbecue at their home last  Saturday evening so thaj members  of their family could meet a young  lady from Recife, Brazil who spent  a couple of days with them. Ben  Sevy, Ken Sevy's son and Harold's  grandson, is serving a mission in  Recife and met Kika and her family.  When he learned she was coming to  Utah to attend Brigham Young  University, Ben told her to be sure  and visit his grandparents in Panguitch  Pan-guitch if she could. There were 30  family members present from as far  away as St. George and Albuquerque.  Albuquer-que. This seems appropriate for this  week's ending:  \" proposed to Ida, Ida refused.  Ida won my Ida, If Ida used\"  Burma Shave  \"No lady likes, to dance or  dine, accompanied by, a porcupine.  porcu-pine. \"  Burma Shave", "articleTitle": "Panguitch News"}, {"id": 3473600, "paper": "Garfield County News", "type": "advertisement", "date": "2001-09-13T00:00:00Z", "year": "2001", "month": "September", "day": "13", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/97/c1/97c1103735a62354bbede86df03d46d0eced1df5.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/b5/0c/b50c215ad02ce4454b42ac79288a7e086762f24b.pdf", "page": 3, "parent": 3473624, "version": 1739893688546361346, "ocr": "A WRITE-IN CANDIDATE  j (November 6, 2001)  I I Four-Year City Councilwoman  4- ' Escalante, Utah  \"If elected, 1 promise to listen to your concerns and '  DO MlfBESTto represent you in council decisions\"  fa$dd THmwUat wfitial  fmwm IcoGM Wmmi  Sept. 21 0 6:30 p.m.  Roast Baffi Ham J-\"Compl?t2  J-\"Compl?t2 Salad Bar Trirnmings Dsssrt  D Door Prizes D i3f  fonnmmions:43s-m-i!iismssTiomiJiO!i$i5mri!tson  I emmm? I  D01 WUS m QUA TEFULiy ACCEPT  YOUR CCIIWIUIIIG SUrrORTHAS Mil GfflTLlt AKXCimO  in minutes!  Irritated? Frustrated Used regularly,  with that objectionable - . your friends will notice  \"break-up\" you get O the change, and you'll  with cellular? T soon wonder how you  V I f coped without the  Relief is on the way! Ji flexibility, convenience  - and availability you get  With Digital PCS quality ? I ' ' with a customized  from South Central, t : Calling Plan from South  you'll notice the V ; Central - designed with  difference right away. , , your savings in mind.  I an iron fcK3- c7u(FI  The only side-effects are savings!  Keeping Garfield County on the go! Save big with Every first First outgoing  six-second ' incoming minute minute free to  y:-: --zSmK call rounding is always free any SCC phone  ijrrz- vi fcfl ( -ka (rsm  l . Bnri8o03 xy j:2f vjnr  ' Tools i mr mm  tS Calculator I ; :  COMMUNICATIONS  VJ ( ) J Part of the South Central family.  \"Southern Utah's clear choice to cellular\"  O I  v.- sm,, - , m ji. (jfaufifc", "articleTitle": "Panguitch News"}, {"id": 3473601, "paper": "Garfield County News", "type": "page", "date": "2001-09-13T00:00:00Z", "year": "2001", "month": "September", "day": "13", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/84/c6/84c67dfb5b01465d64000a6a1b386968427b0dd3.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/aa/bd/aabd2949e1140342f2f1b791adfc6f3386168ecb.pdf", "page": 4, "parent": 3473624, "version": 1739893336748064769, "ocr": "A WRITE-IN CANDIDATE  j (November 6, 2001)  I I Four-Year City Councilwoman  4- ' Escalante, Utah  \"If elected, 1 promise to listen to your concerns and '  DO MlfBESTto represent you in council decisions\"  fa$dd THmwUat wfitial  fmwm IcoGM Wmmi  Sept. 21 0 6:30 p.m.  Roast Baffi Ham J-\"Compl?t2  J-\"Compl?t2 Salad Bar Trirnmings Dsssrt  D Door Prizes D i3f  fonnmmions:43s-m-i!iismssTiomiJiO!i$i5mri!tson  I emmm? I  D01 WUS m QUA TEFULiy ACCEPT  YOUR CCIIWIUIIIG SUrrORTHAS Mil GfflTLlt AKXCimO  in minutes!  Irritated? Frustrated Used regularly,  with that objectionable - . your friends will notice  \"break-up\" you get O the change, and you'll  with cellular? T soon wonder how you  V I f coped without the  Relief is on the way! Ji flexibility, convenience  - and availability you get  With Digital PCS quality ? I ' ' with a customized  from South Central, t : Calling Plan from South  you'll notice the V ; Central - designed with  difference right away. , , your savings in mind.  I an iron fcK3- c7u(FI  The only side-effects are savings!  Keeping Garfield County on the go! Save big with Every first First outgoing  six-second ' incoming minute minute free to  y:-: --zSmK call rounding is always free any SCC phone  ijrrz- vi fcfl ( -ka (rsm  l . Bnri8o03 xy j:2f vjnr  ' Tools i mr mm  tS Calculator I ; :  COMMUNICATIONS  VJ ( ) J Part of the South Central family.  \"Southern Utah's clear choice to cellular\"  O I  v.- sm,, - , m ji. (jfaufifc", "articleTitle": "Panguitch News"}, {"id": 3473602, "paper": "Garfield County News", "type": "unclassified", "date": "2001-09-13T00:00:00Z", "year": "2001", "month": "September", "day": "13", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/a0/a1/a0a1144dbb6f728bb4bebace495a320658d89345.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/16/06/16066c9ff285192625913bc14f64844971e35937.pdf", "page": 4, "parent": 3473624, "version": 1739889389703528449, "ocr": "4-A GARFIELD COUNTY NEWS Thursday. Sept. 13. 2001 I ' \"' . 1", "articleTitle": "Panguitch News"}, {"id": 3473603, "paper": "Garfield County News", "type": "article", "date": "2001-09-13T00:00:00Z", "year": "2001", "month": "September", "day": "13", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/2c/da/2cda5d3d0669bdd8b54ead01aea5f87cd4c604df.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/41/46/4146f28c8fb13f0d19e28483eb8fd80233497abc.pdf", "page": 4, "parent": 3473624, "version": 1739887266773336064, "ocr": "9  PUBLIC NOTICE  The National Primary Drinking  Water Regulations require that we  inl'orm you that the Skoots Creek  Water Association has failed to  collect one bacterial water sample  for the month of June. Routine  testing is used to ensure that the  public is provided with safe drinking  drink-ing water. Water quality may  change without any visible indication  indica-tion due to unanticipated environmental  environ-mental factors.  For this reason, we are required  to sample on a monthly basis while  out system is in operation. The  reason that this oversight occurred  is due to confusion on who was to  take the sample. We have reviewed  why this error has occurred and have .  changed our procedures to ensure  that this will not happen again.  Dean Phillips  Skoots Creek Water Users Ass.  Panguitch Lake, Utah 84759  Published in the Garfield  County News on Sept. 13, 2001.  NOTICE TO WATER  USERS  The State Engineer received the  following Application) to Change  Water in Garfield County  (Locations in SLBhM).  Persons objecting to an  application must file a CLEARLY  READABLE protest stating  FILING NUMBER, REASONS  FOR OBJECTION,  PROTESTANTS' NAME AND  RETURN ADDRESS, and any  request for a hearing. Protest must  be filed with the State Engineer,  Box 146300, Salt Lake City, Uf  84114-6300 (801-538-7240) on or  before OCTOBER 10, 2001. These  are informal proceedings as per  Rule R655-6-2 of the Division of  Water Rights.  (LEGEND: Point(s) of  Diversion POD; Place of Use  POU; Nature of Use USE)  6l-365(a25929): Bryce Canyon  Resorts LLC propose(s) to change  the POD & USE of water Is  evidenced by 61-365 & 61-382.  HERETOFORE: QUANTITY:  0.107 cfs. SOURCE: Underground  Water Well. POD: (1) S 1?48 E  177 from NI4 Cor, 6 in. well 240  ft. deep (2) N 874 W 2405, 6 in.  well 3D0 ft. deep (3) N 1435 W  1 120 from El4 Cor, Sec 7, T36S,  R3W., 12 in. well 18 ft. deep.  USE: Stockwatering: 18 head of  livestock; Domestic: 1 family:  Commercial: 30 unit motel & 26  unit trailer camp,eafe, service  station & laundromat. POU:  NW14NEI4 Sec 7, T36S, R3W.  HEREAFTER: QUANTITY:  0.107 cfs. SOURCE: Underground  (wells). POD: (1) S 1348 E 177  from Nl4 Cor, 6 in. well 240 ft.  deep (2) N 1435 W 1 120. 6 in. well  300 ft. deep (3) N 874 W 2404  from El4 Cor, Sec 7, T36S,  R3W. 12 in. well 18 ft. deep (4) N  706 W 633 from SE Cor, 8 in.  well 125 ft. deep (5) N 1733 E 143  from Sl4 Cor, 12 in. well 136 ft.  deep (6) S 783 E 989 from Wl4  Cor, 14 in. well 200 ft. to 500 ft.  deep (7) S 970 E 3685 from NW  Cor. Sec 2, T36SJ R4W., 18 in.  well 200 ft. to 500 ft. deep. (17.5  miles SE of Panguitch) USE:  Domestic: 1 familv; Commercial:  128 unit motel,. cafe, 26 unit trailer  court,. POU: Same as Heretofore.  Robert L. Morgan, P.E.  STATE ENGINEER  Published in Garfield County  News on SEPTEMBER 13 & 20,  2001.  DOCUMENT NO. 00110  ADVERTISEMENT  FOR BIDS  Boulder Farmstead Water Company  P.O. Box 1328  Boulder. UT 84716  Separate sealed BIDS for the  construction of the Boulder  Farmstead Water Company Culinary  Culi-nary Water Improvements lrr  Boulder Town, which includes the  following approximate quantities of  work: 300,000 gallon steel or  concrete tank, 4,225 l.f. of 10\" and  8\" PVC water line, and related  work, will be received by Boulder  Farmstead Water Company at the  ollice of Jones & DeMille Engineering.  Engin-eering. 1440 South Pipe Lane,  Richfield. UT 84701 until 2:00  p.m.. September 26. 1001 and then  - at said office publicly opened and  read aloud.  The BIDDING DOCUMENTS  may be examined at Jones &  DeMille Engineering and the  following locations:  1 . Intermountain Contractor.  1743 Alexander St. SLC. & 323 fc.  1200 S. ()rem.UT  2. Mountamlands Plan Room,  1 128 5. State. Orem & 3560 S 582.  W.. SLC, UT  3. Assoc. Gen Contractors.  1 135 S W Temple. SLC & 158 W  1600 S. St. Geroge. UT  Copies ol the BIDDING  DOCUMENTS may be obtained at  the office of Jones & DeMille  Engineering, located at 1440 South ;  Pipe Lane Richfield. UT 84701  Phone 435-896-8266, upon payment  pay-ment of $40.00 tor each set. Any  bidder upon returning the Bidding  Documents promptly within 30  days of bid opening and in good  condition, will be refunded full ;  payment and any non-bidder upon  so returning the Bidding Documents :  will be refunded $15.00.  August 31. 2001 '  ' Connie Reid, President  Published in the Garfield  County News on Sept. 6, 13 and  20, 2001.  NOTICE TO  WATER USERS  The State Engineer received the  following Application) to Appropriate  Appro-priate Water in Garfield County  (Locations in SLB&M).  Persons objecting to an application  applica-tion must Tile a CLEARLY  READABLE protest Stating FILING  FIL-ING NUMBER; REASON? FOR  OBJECTION, PROTESTANTS'  NAME AND RETURN ADDRESS,  AD-DRESS, and any request for a hearing.  hear-ing. Protest must be filed with the  State Engineer Box 146300, Salt  Lake City, Uf 84114-6300 (801-538-7240)  on or before OCTOBER  3j 2001, These are informal proceedings  pro-ceedings as per Rule R655-6-2 of  the Division of Water Rights.  (LEGEND: Point(s) of Diversion  Diver-sion POD; Place of Use POU;  Nature of Use USE)  97-2244 (A73598): Phillip and  Alicia A. Peterson QUANTITY:  1.73 ac-ft. SOURCE: Allen's  Ranch Spring Area 1. POD: (1) N  1 125 E 150 from SW Cor. Sec 34,  T35S, R1E. (About 10 miles SW  of Escalante) USE: Irrigation: from  Apr 1 to Oct 31, total acreage  0.2500 acs, sole supply 0.2500 acs;  Stockwatering: 10 head of livestock;  live-stock; Domestic: 1 family. POU:  N12SW14 Sec 34, T35S, R1E.  Robert L. Morgan JP.E.  STATE ENGINEER  Published in Garfield County  News on SEPTEMBER 6 & 1J,  2001. '", "articleTitle": "Public Notices"}, {"id": 3473604, "paper": "Garfield County News", "type": "advertisement", "date": "2001-09-13T00:00:00Z", "year": "2001", "month": "September", "day": "13", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/56/4e/564e10994e78689f9e57a94d07e6575ea0726f54.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/99/08/9908126a4a532e50e1c225bfb943f66808506f61.pdf", "page": 4, "parent": 3473624, "version": 1739892605689266178, "ocr": "if gg feap fMSF  At Our Rifle Giveaway. SL(  The Biggest Buck Taken During f 'ilftj  The Bow Hunt, Rifle Hunt And fiMW  nilflWP inn Muzzleloader Hunt Wins A Free Q'  IWldlUU Tank Of Gas And A Chance  mMmmmmmmy  tcc UQ  Guilders  Modular Home Foundations  Basements Garages  Patios Driveways  Styrofoam Concrete Forms  435-679-8512 435-676-8539  Panguitch Escalante  Bryce Valley  ! Bury j  J DUMFTRUCK&  J BACKHOE SERVICE I  I Sand & Gravel  J P.O. Box 339 Panguitch i  Refrigeration Commercial Residential  435-676-2341 or (CeU) 435-616-2341  CT GflS PIPING  Gas Appliances Furnaces Fireplaces  Licensed Contractor  Serving Panguitch & Surrounding Area  rjwmsposiui'l  i company !  - Weekly Trash Pickups Throughout I  Garfield County :  : Residential Commercial I  I Residential Prices Z  Single Senior Household  j $7.50Month I  I Other Residential - $8.50Month  j 435-676-8375 !  I Tues: EscalanteTropic j  jWed: HatchThurs: Panguitch I  I \"Building With Pride From Form To Finish\"  i i  j . General Contracting j  I Josh Brown !  I 435-690-9009 I  I Home: 435-676-8398 J  j Licensed St Insured I  Utah Lic.4878649-5501  P.O. Box 552, Panguitch, UT 84759  Place Your Ad  Here For Only  $35 A Month!  Call The  \"435-679-8730  I Him Brinherhoff !  I Licensed Massage Therapist !  Hair & Nail Care '  4-5 N. Main St. Panguitch I  j 4-35-676-S446  UliUUUll MTMtDCA\".  HOME MED CARE  SALES OXYGEN RENTALS  SeuUp (fanfceld (jaunty  CLINT OR JOLENE POLLOCK  435-676-2712  Toll Free  1-800-662-2535  'install  Gn Bvfbee  Senior Account A5cnt  297 West Hilton Drive  St. George, UT 84770  Bus. (435) 628-8778  FAX (435) 634-1065  1-800-435-5994 J  Place Your Ad  Here For Only  $35 A Month!  Call The  inn  435-679-8730  LJ CONSTRUCTION CO 4  CONSTRUCTION HEEDS  Kenny Allen Jason Reynolds  435-676-8990 435-676-2065  jGierpo.wn7KnsjSrwn)  IRanguftcnj  Licensed and Insured  99-379276-5501  Installation  Direct TV & DISH Network  Owner, Ron Bean  tre. 400 N. Panguitch  435-676-2377  435-676-8276  I WISDOM  p PAINTING o  udc ukauh\" yr  . J Serving All Of Garfield County ;  :, Toll Free ivJ  -i. 888-332-0692  -f V 435-674-4951  :M.Sm:  TRANSMISSION :  ; Repair Replace  I I 590 N. Main  Cedar City, Utah 84720  Eg Mock  435-676-2650 After 7 p.m. 'I  I 660-872-1375 Toll Free J  j 9 a.m. 5 j.m.  SI  85 N.Main St.  Panguitch  H 435-676-8819  Mon. - Fri. 8 a.m. - 5:30 p.m.  Saturday 8 a.m. - Noon  TT;A, Carpet & Upholstery  g7'\". L Cleaning  fff Truck Mount Steam  Extraction Unit  Free Estimates  Homes & Commercial  Disaster Clean-up  435-648-2178  888-648-2170  Orrlerville  Construction, (nc  ' GENERAL CONTRACTING S  licensed Insured  Custom Homes & Remodel  12 Years Experience  Gil Manning  435-679-8782  Aaron Dybco  Plumbing  fiAompl (plumhinq  CJ SsuwkstA  Faucets  Taps, Drains  New & Remodel\"  Licensed Contractor  435-691-3045 or 435-691-3044  Tropic  U icunus  I TlW24mKT0WINlT  CAKS TRUCKS ' XV'S WS  Across From Ruby's Inn  435-834-5232  (Backhoe & Dump  j Licensed Insured  435-676-8156  fraidsen Physical tapy  &Sports Medicine  551 E. Center jrf-L  Panguitch t .  435-676-8744 f) f  David B. Frandsen  M.S., P.T., C.S.C.S. J  RGniVclding  Complete Fabrication & Repair  Trailer Repair  CMne Shop Service)  435-676-8259  930 N. Hwy. 89 Panguitch  TVs VCR s Appliances  Guaranteed Service  Reasonable Prices  435-577-2100  , SHOP  435-577-2545  HOME  In Panguitch  Tues. & Fri.  rTiioTmsnToj  J Parts'Plus i  I \"CARCARE CENTER j  COPENDaysaek;'  ! 43W576-CIII ;  I 24-Hour Towing J  I Allstate Motor Club Towing y  Place Your Ad  Here For Only  $35 A Month!  Call The  435-679-8730  ! ALWAYS PROTECT '  J YOURSELF ' !  i i  Use Licensed i  i Contractors For j  Your Projects! i  I Courtesy of Mountain Man Painting  License99i379276-5501 I  Did You Know?  The newspaper recycling rate  has climbed steadily each year  since 1988 when the  newspaper and newsprint  industries, with the help of  communities, made recycling  a priority.  Source: Facts About Newspapers 2000,  Published by Newspaper Association of  America  GREAT NEW PRICES  On Full-Color .  Business Cards  0  Call Garfield County News  1 435-679-G730  Mir - v ' .  r- ... . ' . '  C.' t ' 1 f  tvi ..... '4 - - J-h  -. . i  Finish Me!  In Tropic at the foot of Bryce Canyon National Park, a  beautiful, nearly finished very large two-story Victorian  home on 1.21 acres. Completed small apartment to  live in while you finish interior. Electric, plumbing,  exterior completed. Interior at sheet rock stage. Four  bedrooms, two and 12 baths, kitchen, dining room,  living room, family room, study, multi-purpose room.  $113,000  Call 435-679-8868", "articleTitle": "Public Notices"}, {"id": 3473605, "paper": "Garfield County News", "type": "page", "date": "2001-09-13T00:00:00Z", "year": "2001", "month": "September", "day": "13", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/6a/2d/6a2d8725fbb488c49d497686e6a603b7356c2261.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/9f/36/9f369b3887f06dbe55b394cc9cb95397d7959aa3.pdf", "page": 5, "parent": 3473624, "version": 1739892142560509953, "ocr": "if gg feap fMSF  At Our Rifle Giveaway. SL(  The Biggest Buck Taken During f 'ilftj  The Bow Hunt, Rifle Hunt And fiMW  nilflWP inn Muzzleloader Hunt Wins A Free Q'  IWldlUU Tank Of Gas And A Chance  mMmmmmmmy  tcc UQ  Guilders  Modular Home Foundations  Basements Garages  Patios Driveways  Styrofoam Concrete Forms  435-679-8512 435-676-8539  Panguitch Escalante  Bryce Valley  ! Bury j  J DUMFTRUCK&  J BACKHOE SERVICE I  I Sand & Gravel  J P.O. Box 339 Panguitch i  Refrigeration Commercial Residential  435-676-2341 or (CeU) 435-616-2341  CT GflS PIPING  Gas Appliances Furnaces Fireplaces  Licensed Contractor  Serving Panguitch & Surrounding Area  rjwmsposiui'l  i company !  - Weekly Trash Pickups Throughout I  Garfield County :  : Residential Commercial I  I Residential Prices Z  Single Senior Household  j $7.50Month I  I Other Residential - $8.50Month  j 435-676-8375 !  I Tues: EscalanteTropic j  jWed: HatchThurs: Panguitch I  I \"Building With Pride From Form To Finish\"  i i  j . General Contracting j  I Josh Brown !  I 435-690-9009 I  I Home: 435-676-8398 J  j Licensed St Insured I  Utah Lic.4878649-5501  P.O. Box 552, Panguitch, UT 84759  Place Your Ad  Here For Only  $35 A Month!  Call The  \"435-679-8730  I Him Brinherhoff !  I Licensed Massage Therapist !  Hair & Nail Care '  4-5 N. Main St. Panguitch I  j 4-35-676-S446  UliUUUll MTMtDCA\".  HOME MED CARE  SALES OXYGEN RENTALS  SeuUp (fanfceld (jaunty  CLINT OR JOLENE POLLOCK  435-676-2712  Toll Free  1-800-662-2535  'install  Gn Bvfbee  Senior Account A5cnt  297 West Hilton Drive  St. George, UT 84770  Bus. (435) 628-8778  FAX (435) 634-1065  1-800-435-5994 J  Place Your Ad  Here For Only  $35 A Month!  Call The  inn  435-679-8730  LJ CONSTRUCTION CO 4  CONSTRUCTION HEEDS  Kenny Allen Jason Reynolds  435-676-8990 435-676-2065  jGierpo.wn7KnsjSrwn)  IRanguftcnj  Licensed and Insured  99-379276-5501  Installation  Direct TV & DISH Network  Owner, Ron Bean  tre. 400 N. Panguitch  435-676-2377  435-676-8276  I WISDOM  p PAINTING o  udc ukauh\" yr  . J Serving All Of Garfield County ;  :, Toll Free ivJ  -i. 888-332-0692  -f V 435-674-4951  :M.Sm:  TRANSMISSION :  ; Repair Replace  I I 590 N. Main  Cedar City, Utah 84720  Eg Mock  435-676-2650 After 7 p.m. 'I  I 660-872-1375 Toll Free J  j 9 a.m. 5 j.m.  SI  85 N.Main St.  Panguitch  H 435-676-8819  Mon. - Fri. 8 a.m. - 5:30 p.m.  Saturday 8 a.m. - Noon  TT;A, Carpet & Upholstery  g7'\". L Cleaning  fff Truck Mount Steam  Extraction Unit  Free Estimates  Homes & Commercial  Disaster Clean-up  435-648-2178  888-648-2170  Orrlerville  Construction, (nc  ' GENERAL CONTRACTING S  licensed Insured  Custom Homes & Remodel  12 Years Experience  Gil Manning  435-679-8782  Aaron Dybco  Plumbing  fiAompl (plumhinq  CJ SsuwkstA  Faucets  Taps, Drains  New & Remodel\"  Licensed Contractor  435-691-3045 or 435-691-3044  Tropic  U icunus  I TlW24mKT0WINlT  CAKS TRUCKS ' XV'S WS  Across From Ruby's Inn  435-834-5232  (Backhoe & Dump  j Licensed Insured  435-676-8156  fraidsen Physical tapy  &Sports Medicine  551 E. Center jrf-L  Panguitch t .  435-676-8744 f) f  David B. Frandsen  M.S., P.T., C.S.C.S. J  RGniVclding  Complete Fabrication & Repair  Trailer Repair  CMne Shop Service)  435-676-8259  930 N. Hwy. 89 Panguitch  TVs VCR s Appliances  Guaranteed Service  Reasonable Prices  435-577-2100  , SHOP  435-577-2545  HOME  In Panguitch  Tues. & Fri.  rTiioTmsnToj  J Parts'Plus i  I \"CARCARE CENTER j  COPENDaysaek;'  ! 43W576-CIII ;  I 24-Hour Towing J  I Allstate Motor Club Towing y  Place Your Ad  Here For Only  $35 A Month!  Call The  435-679-8730  ! ALWAYS PROTECT '  J YOURSELF ' !  i i  Use Licensed i  i Contractors For j  Your Projects! i  I Courtesy of Mountain Man Painting  License99i379276-5501 I  Did You Know?  The newspaper recycling rate  has climbed steadily each year  since 1988 when the  newspaper and newsprint  industries, with the help of  communities, made recycling  a priority.  Source: Facts About Newspapers 2000,  Published by Newspaper Association of  America  GREAT NEW PRICES  On Full-Color .  Business Cards  0  Call Garfield County News  1 435-679-G730  Mir - v ' .  r- ... . ' . '  C.' t ' 1 f  tvi ..... '4 - - J-h  -. . i  Finish Me!  In Tropic at the foot of Bryce Canyon National Park, a  beautiful, nearly finished very large two-story Victorian  home on 1.21 acres. Completed small apartment to  live in while you finish interior. Electric, plumbing,  exterior completed. Interior at sheet rock stage. Four  bedrooms, two and 12 baths, kitchen, dining room,  living room, family room, study, multi-purpose room.  $113,000  Call 435-679-8868", "articleTitle": "Public Notices"}, {"id": 3473606, "paper": "Garfield County News", "type": "article", "date": "2001-09-13T00:00:00Z", "year": "2001", "month": "September", "day": "13", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/4a/fd/4afda987ea97d45e4400d59c586e2e64142270e2.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/0c/73/0c73478ad0f96f32ab1237b80b78b559763b45d3.pdf", "page": 5, "parent": 3473624, "version": 1739884226814148610, "ocr": "Escqlantc Hews  By Marlene Haws  826-4859  Bill and Dawn Griffin went to  St. George for a few days, but they  are back. Thought maybe they had  gone on another cruise to Alaska.  They have already been once this  summer!  Francis and Barbara Imlay went  to Blanding on the weekend to see  their new grandson. John and Jon-nie  Jon-nie Imlay are the parents of a new  baby, Ryan Francis. And, since he -was  going to get his name and a  blessing, aunts, uncles and cousins  went also. Warren and Linda Haycock,  Hay-cock, Escalante, and Scott and  Laurie Bolander, St. George, and  their families were there for the  special occasion.  Sandi Imlay, Cedar City, has  been living with her Uncle Francis  and Aunt Barbara Imlay this  summer while she worked for the  Forest Service. She went back to  Cedar City in time to capture the  Rodeo Queen title last week. She  is a daughter of Jerry and Louise  Imlay, Hinckley.  Missed the birth of one baby in  the news last week! Kent and Kay  Ellett have a new baby girl. Little  Taylor. She weighed 8 pounds 6  ounces and has lots of black hair!  Her maternal grandmother, Karen  McCoun, came down from Salt  Lake City and spent time helping  out. The Elletts now have four  girls and one boy.  J. C. Haws called from Brig-ham  Brig-ham City and said he has finally  had his eye surgery. He has worried  about it because it was his best eye.  He says it is sore but is hoping for  the best.  Carrie Griffin had surgery in  Panguitch last Thursday. With the  new methods they have now, we  hope she will be up and at it again  in no time!  Kenneth and Marie Griffin went  to Las Vegas on a little trip. They  visited friends there, but didn't say  what else. Don't know if they  came back richer or poorer, but they  did stay an extra day!  We had another hail storm last  week, on Wednesday. Pretty scary  stuff. Lightning hit a big cotton-wood  cotton-wood tree at the Dwight Haycock  farm on the north side of the creek  and the fire truck had to go dump a  load of water and some foam on it  to keep it from spreading. It still  smoldered for a long time. This is  the second time this summer that  lightning has knocked the telephone,  tele-phone, TV, etc. out at the  Haycock's house.  Blake Dee Robinson came from  Salt Lake City to visit with his  father, Blake Robinson, and his  sister and brother-in-law, Renee'  and Ben Porter.  Boyd and LaNell Cottam came  from Cedar City to help out after  LaNell's mom, Carrie Griffin, had  surgery. They also visited Boyd's  mom, Golda Cottam.  Golda came home from Nevada  in time for her sisters to come for a  visit. Then they took her with  them and went to Huntington to  visit othr relatives, so she has  been on the go!  Beth Smith had company at her  house last week. Visiting were her  brother and sister-in-law, Kent and  Laura Cottam, Washington, and her  sister Diane Marth, Las Vegas,  Nev.  Rob and Dorothy Simpson were  in Salt Lake City last week for the  funeral services of Rob's mom,  Leona Simpson, a former Escalante  resident. The burial was in Park  City and they went to Evanston,  Wyo., where Leona had been living  to help family members take care of  her personal affairs. After they got  home Dorothy's brother, Dale  Schow, came from West Jordan to  visit for a week. Dale is retired  now, so he can visit whenever he  likes.  Visiting at the home of Clorene  Vidrine were her granddaughter,  Jennifer, and husband, Nathan  Hadley, Riverdale. They spent the  long weekend and were lots of help  around the house.  Quite a few people went to  Grover for' the last play of the  season at the Hale Theatre. The  senior citizen bus went on Friday  night. Passengers were: Deon  Alvey, Velma Boulter, Marlene  Haws, Max Porter, Dan and Lois  Spencer, Cat and Martha Schow,  Julie Barney and Ron and Lu,  whose last names I didn't catch, but  they are the camp hosts at the state  park at Wide Hollow Reservoir.  They stopped at the Boulder Mesa  Restaurant on the way over for  dinner. Faye Worthen and Ruth  Barnes, Panguitch, joined the group  to watch the play.  Myron and Sanette Cottam took  their family to the play on Saturday  night. Doyle and Thelma Cottam  accompanied them. I think they  may have tried to catch a fish or  two at Posey Lake on their way  over!  MaeVonn Taylor had her sons  and their families, Jimmy and Ethel  Taylor and Jerry and Monica  Taylor, from the Salt Lake area,  here for Labor Day weekend.  Louie and Janalee Bernardo were  in St. George helping Heath  Spencer and his new bride move  into their new home.  Velma Boulter had a nice  surprise. Her grandson, Rob, and  Miriam Lund came for the weekend.  They were here when she got back  from the play in Grover on Friday.  They took her to Mesquite, Nev.,  to spend one night, then returned to  spend another night with her before  going back to American Fork.  Jon and Jillyn Sorensen and  family, Salina, came to spend the  long weekend and camped on the  mountain with Klyn and Marlene  Haws. Brent and Patrice Cottam  and family spent one evening with  them. Ryan Cottam was home  from Orem for the weekend.  Lee and Kathleen Williams went  to Duck Creek to camp with their  children from Cedar City.  Dennis and Beth Williams and  Bob and Debbie Williams joined  together for a nice family gathering.  Had an E-mail from Sarah .  Cowles, Casper, Wyo. She said  her husband, Dennis, was coming  home from a job in Price the other  day and stopped in Craig, Col. to  get a drink and ran into Robert  Haws there (who lives in Loma,  Co!.). They had a nice visit and  she commented that, \" It is a small  world and no matter where we  roam, it is always those home town  roots that matter the most.\" Robert  and Dennis were good friends when  they were attending Escalante High  School. Isn't E-mail great? It is  so much fun to keep in touch with  friends and relatives of all ages!", "articleTitle": "Escalante News"}, {"id": 3473607, "paper": "Garfield County News", "type": "advertisement", "date": "2001-09-13T00:00:00Z", "year": "2001", "month": "September", "day": "13", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/e0/03/e00335e7d870dde7ab4d92b90fdf0f74798a2acf.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/84/bf/84bfcc3d9e56ddf64699cf80a4c7226522d26d03.pdf", "page": 5, "parent": 3473624, "version": 1739891720709996545, "ocr": "Don't miss that  important meeting of  (Search the Utah  Legal Notice Database:  www.utahlegalnotlces.com  A service of the  Utah Press Association  and your local newspaper  Boulder O dean gledhill  TurAiM4-n 5 & Escalante 435-826-4378  mountain cathy bagley  Realty, Inc. Torrey 435 -425 -3200  10 ACRES WITH 3 bedroom home, barn, corrals, bunkhouse, 2 car  garage and much more. Views and comfort in Boulder.  790 E Draw Road. $352,000.  LOT IN TOWN. 1.23 ACRE LOT ON 300 West. L-shapedand  private. $39,000.  MAIN STREET LOT. One full acre on west side of town. Zoned  commercial. Good investment and perfect location for any type of  business. 580 West Main Street. Escalante. Only $40,000.  OUT OF TOWN LIVING. City water meter and irrigation water for  small hay field. Elelctricity. Pretty view. Good access. South of  town. $142,000  www.bouldermountainrealty.com  1 flMEMfllfr immi-'liy.B  Ss. TO ALL DMVZIiS...  When You See An Ambuance  fsr 111 Please Be Courteous And Pull  u7 To The Right Hand Side Of The,  i Road. Ambulance Drivers Have  n A Hard Job Already.  Let's Help Them So They Can Help Us!  Someone Who Lives  In Boulder Or Tropic  Knows Everybody,  And Would Like To Write  The Boulder Or Tropic  Columns For The  GARFIELD G0UHTY HE17G  Call 435-679-8730  Did You Know?  1 . That one out of two men and two out of three  women will contract cancer in their lifetime.  2. Cancer is the number two cause of deaths  among all Americans.  3. In the U.S., one out of every four deaths is  from cancer?  Would you like to know more about how to pay  for the extra costs associated with cancer?  Grvj Bvjbec  fH H II Qflwflfnf Sc\"10r Accovmt  I ji IS r. 3 297 West Hilton Drive  I ru) 0 St. George, UT 84770  U lUUUUJUU (435) 628-8778 7 :  1 -800-435-5994", "articleTitle": "Escalante News"}, {"id": 3473608, "paper": "Garfield County News", "type": "article", "date": "2001-09-13T00:00:00Z", "year": "2001", "month": "September", "day": "13", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/bd/9e/bd9e9143de15190c27ac0224eeef72524ab0a521.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/6b/52/6b5260db053dc2192197531e4dad10fec9b4464e.pdf", "page": 5, "parent": 3473624, "version": 1739891987749797893, "ocr": "Remembering  \"Indeed, I tremble for my  country when I reflect that God is  just, that His justice cannot sleep  forever,\"  Thomas Jefferson  ' on the Jefferson Memorial", "articleTitle": "Remembering"}, {"id": 3473609, "paper": "Garfield County News", "type": "article", "date": "2001-09-13T00:00:00Z", "year": "2001", "month": "September", "day": "13", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/91/cd/91cdae148855e97758da8f4e5cb1c1655a829070.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/18/d2/18d2578fc7732bff2d1fc9ce335b1a19e9265fda.pdf", "page": 5, "parent": 3473624, "version": 1739889447995965441, "ocr": "nam em  By Vi Blake  Dear Vi: I have several ideas for  your column:  1. Lay a string on the edge of  your dishwasher soap bucket and it  will open easily.  2. A wad of used aluminum foil  makes a good kettle scraper. 3. Put  some black pepper in the salt  shaker so you can tell where you  have salted things, like corn on the  cob. 4 If you have a spot or two on  your carpet, scrub them out with a  wet toilet brush. Most spots will  come out with just water.-  Carla Sharp  Richfield  My friend Russ Hardy, (a carpet  man) advises against scrubbing  carpets. He suggests a vinegar  solution or a non-oil, non-soap-based  carpet cleaner, such as Folex  Spot Remover. Spray it on, work it  into the pile gently with the  ' fingers, and blott with a clean white  towel, preferably left on overnight.  Folex Spot Remover is widely  available in California and Arizona,  but apparently it hasn't caught on  in Utah. I did find some at WalMart  last March and they said they would  get more in. I called just now to  ask if they had some in stock, but  finally hung up after waiting a long  time to be transferred to someone  who would know. (By the way,  wouldn't it be nice to call a  number and get a person? I get so  tired of voice messages and the  infernal waiting involved.) Anyway,  Any-way, if any of you find an outlet for  this or a similar product, please let  us know.  In the past, I have noticed that  once you have a new carpet cleaned  it needs to be cleaned much oftener.  I asked Russ about this. He said it  is because oil-or soap-based-cleaners  leave a residue in the carpet  that attracts and holds dirt.  Dear Vi: A tablespoon of  powdered dishwashing detergent and  a pot of water perked in your coffee  maker will get it really clean with  no scrubbing. Also, slip a thimble  over the percolator stem before  measuring the coffee and it won't  get clogged. Of course, the thimble  must be removed before perking.  Darlene Burg  Las Vegas, Nev.  Dear Vi: If you have a surplus  of tomatoes in your garden, make  some tomato jam. It's simple to  make and very good. We like it  better than mint jelly with lamb:  Boil 3 cups of peeled, chopped ripe  tomatoes with 2 cups sugar for 10  minutes, then add a lemon sliced  very thin and a 3 oz. package of  lemon gelatin. Boil another 10  minutes, and seal in hot sterilized  jars.  Darlene Burg  Las Vegas, Nev.  While baking cookies today, I  thought of passing on several  \"mess-savers\" and short cuts that I  use a lot:  Before measuring molasses or  honey or anything gooey, measure  the shortening or liquid oil in the  cup first, then the sticky stuff will  pour out easily.  Keep a small strainer in or  near the flour canister for dusting a  cake pan or pastry board .  An open box of baking soda  freshens a microwave oven just as  it does a refrigerator. Remove when  you use the oven.  A raw potato will remove  vegetable stains and fish odor from  your hands It will also help relieve  a stomach ache.  A slice of lemon on mineral  stains in a glass pot will usually  take them away.  Blow up your rubber gloves  and they will slip on your hands  much easier. Also, rub some  cornstarch on your hands before  putting on the gloves.  THOUGHT FOR THE DAY: A  person needs to be listened tq until  he or she can go down to the depth  of the problem and make a decision.  Readers: Thanks for sharing  your good ideas. Send yours or  questions to IT MAKES CENTS,  328 So 300 E 5, St. ' George,  Utah, 84770 or e-mail (viblakein  fowest.com) If used here I'll send  you $2 or one of my booklets.  Please state your choice. For the  current or back issues of IT  MAKES CENTS, check my web '  page: www.infowest.comcents ht  tp:www. infowest.comcents", "articleTitle": "It Makes Cents"}, {"id": 3473610, "paper": "Garfield County News", "type": "unclassified", "date": "2001-09-13T00:00:00Z", "year": "2001", "month": "September", "day": "13", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/70/0b/700b0d0085989c7ce4ceaa5897cc264c71b7826c.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/6d/b9/6db95e1b25565a55c2df095afe6d6ada798976c8.pdf", "page": 5, "parent": 3473624, "version": 1739886417610276864, "ocr": "Thursday. Sept. 13. 2001 GARFIELD COUNTY NEWS 5-A", "articleTitle": "It Makes Cents"}, {"id": 3473611, "paper": "Garfield County News", "type": "page", "date": "2001-09-13T00:00:00Z", "year": "2001", "month": "September", "day": "13", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/7e/fd/7efd423492e4cfc396516980e436e60ecee845eb.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/3b/d7/3bd7cd7c5a03dc731119bd08507aa0cde80b2bca.pdf", "page": 6, "parent": 3473624, "version": 1739890570748231682, "ocr": "Thursday. Sept. 13. 2001 GARFIELD COUNTY NEWS 5-A", "articleTitle": "It Makes Cents"}, {"id": 3473612, "paper": "Garfield County News", "type": "unclassified", "date": "2001-09-13T00:00:00Z", "year": "2001", "month": "September", "day": "13", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/e2/da/e2dafe4786fd49b639424bfb7db7510ae4bd07e0.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/52/96/5296b01a1cd318ef0b0ea5af6494867339999ca8.pdf", "page": 6, "parent": 3473624, "version": 1739890997299511298, "ocr": "fi-A GARFIELD COUNTY NEWS Thursday. Sept. 13. 2001", "articleTitle": "It Makes Cents"}, {"id": 3473613, "paper": "Garfield County News", "type": "article", "date": "2001-09-13T00:00:00Z", "year": "2001", "month": "September", "day": "13", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/23/80/2380157c859f7c5ccd9ff1ed9ae7f9aa1b1cb62d.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/8b/30/8b30270fe61bc3a96f48287e45c6bb70eb6cb9fb.pdf", "page": 6, "parent": 3473624, "version": 1739891943720091648, "ocr": "Email: lropiculgalyahoo.com  Have any of you strolled  through the streets of Tropic lately  and admired all the beautiful flower  beds that the Tropic citizens have  so elegantly arranged in their yards?  If you haven't, do it! Also, if any  of you are suffering from allergies,  it could be the ragweed which is  high in pollen now.  There were many out-of-town  people during the recent holiday  weekend, however, if you haven't  shown your face in my presence, or  let me know you were here, you  won't see your name in print! The  Labor Day weekend is famous for  people taking their last summer  vacation.  Derrick and Laura Pollock have  moved back to Tropic.  Michon Ott of Salt Lake City  spent the weekend with her parents,  Sherrell and Karen Ott.  The Ron Millett family of  Riverton have kept the road hot  between here and there. Ron Finally  admitted to me that he hopes to  build in Trqpic within the next  millennium!  Bryant and Mary Ann Shake-spear  Shake-spear and son Jake have also kept  the road hot, Bryant likes the cooler  weather here and has been  vacationing this past week with his '  parents Carl and Kay Shakespear.  Another couple that has come to  Tropic quite often for the past few  weeks are Kenny Pollock and his  fiancee Michelle Lindsay who visit  with David and Kathryn Pollock.  Also seen in town were Triessa  Hepworth of Cedar City visiting  with her parents Martin and Carla  Ramsay and Brenda Shakespear and  family of Kanab visiting with her  parents Clare and Mary Lee Ramsay.  Ram-say. The Willis reunion was held in  the Cannonville Town Park with a  representative from each family  member in attendance, along with  the good potluck food, visiting,  games, and auctions.  Bill and Elinor and Steeves of  Elko, Nev., were weekend visitors  at Gloria Hayden's. They helped  Gloria clean and repair in her house  and yard.  Christy Gardner and children of  New Castle spent a day with Dixie  Shakespear. Dixie also enjoyed a  visit from her brother, Heber Hall  and nephew, Richard Hansen, of  course, on different days of the  week!  The Tropic Ward LDS Relief  Society Enrichment meeting was  well attended and many stayed to  help with service projects that will  benefit foreign children.  An optimist proclaims that we  live in the best of all possible in  this world while the pessimist ears  this is true!  I just got lost in thought. ..it  was unfamiliar territory!", "articleTitle": "Tropic News"}, {"id": 3473614, "paper": "Garfield County News", "type": "advertisement", "date": "2001-09-13T00:00:00Z", "year": "2001", "month": "September", "day": "13", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/74/b3/74b3e5919b08f1c720db6dc79243e69019573561.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/e3/e7/e3e761e7132583a6263a91fc8eec447de844c70f.pdf", "page": 6, "parent": 3473624, "version": 1739885381595168768, "ocr": "IHJSINESS  SLOW?  IT S TIME TO  ADVERTISE!  - i i  Free Snow Tube Tickets if you purchase online! ' '  !: i sennit' (ifcEB  I - '  ! MP ' - , '  I , i(iaivi(  i j FREE Guest Lift Ticket IT\" ' jyl-ilMKl  i If you purchase before September 14th iyrL'O'  1 ticket per Season Pass Type. Family Passes with '-f ' -iy? rWt iEff  I Additional Child Family Passes count as one Season v-\" w&ittii-J\"r a  l Pass Type. Guest ticket valid opening day Through i - -\",v. .y.t!Ml VHH.y  f December 10, 2001. '\"-- , ' jtS  II Season Pass Holder Benefits ,& ZZJs. 4,t$mWitt  Great value with our long season, early November Through ' ..r7'.'- Ttltft  fi April 10\" member discount at base lodge Eateries, retail --\"''' JHi'  si shops, rental shops, & demo center. Free overnight, ' ' w Ijflfn-tiiL rtj  I I slopeside ski & snowboard storage. . ' f,I.T\"r-tt,liB'JI!,iH  RESORT  !'.. : : 1  I . T , . Family Pass must include at least one parent. A parent is  i- UraerlOday! legal guardian of children, living in the same household.  Y, (435) 677-2035 ext. 106 www.brianhead.com ?Hhilnnn-, noSt e !\" kindnK1en throu0h 12r,9!2de during  r the 2001-02 school year. Child Pass not available to someone  . over 18, working full-time or in college.  v J  ft  - ..  :  iii : 1  HP HfiHSl  tWVJ ACCGPTIUG  APPLICATIONS  All Positions Available  Throughout The Season  Gall 4834843841  Or Pick Up Applications At Cask  W .V. - \" i  V r. ' '' ' jT  ILy Bless Garfield Memorial  Hospital And New Babies! ,  V Materials Supplied For Baby 'ty X  j Quilts. You Quilt & Donate To r  I Hospital To Sell As Hospital iJ  Foundation Fundraiser fl\" i  H Panguitch-Hatch-Antimony 1  Call Marjorie Davies  A 676-8329 J  ;A a Bryce Valley and Circleville I  w'f Escalante-Boulder J  r 'fi Call Nancy Twitchell k J  C V 679-8504  IIMIi ' \" -", "articleTitle": "Tropic News"}, {"id": 3473615, "paper": "Garfield County News", "type": "article", "date": "2001-09-13T00:00:00Z", "year": "2001", "month": "September", "day": "13", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/11/63/1163c0ed5a3477c84725c40f11bd8bb2e31e9e48.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/61/69/6169309ff8b4544aca3bd0cce0afaecbd977c8b2.pdf", "page": 6, "parent": 3473624, "version": 1739891415017586689, "ocr": "Workers Compensation Fund  Scholarship To Brandon Henrie  PANGUITCH Garfield  County resident Brandon Henrie,  22, of Panguitch was one of 79  ' people to receive a Legacy of  Learning scholarship from the  Workers Compensation Fund  (WCF) on Aug. 20. The.  scholarship is provided to students  who have lost a family member in  a work-related accident covered by  WCF.  \"Families suffering tragic losses  sometimes find it difficult to  continue on and achieve educational  goals,\" according to Melvin C.  Green, WCF's chairman. \"The.  Legacy of Learning program is  helping to improve the lives of  those families by providing a  means for thdm to further their  education.\"  Each Legacy of Learning  scholarship can be used for tuition,  books and fees. Henrie received a  personal scholarship of $1500 and  also qualified last year for  assistance. Selection criteria for  this program includes grade point  average, standard test scores, general  character, community involvement  and financial need.  Brandon Henrie is a son of the  late Dennis Lee Henrie and  Christine Tebbs Henrie Davis of  Panguitch. He was a 1997 graduate  of Panguitch High School and  served an LDS mission in South  Africa.  He is presently attending  Southern Utah University in Cedar  City, majoring in business, finance  and law and minoring in computer  information systems. Last year he  was at the top of his class in  personal finance.  He has served as a volunteer at  the Happy Factory in Cedar City,  building toys for underprivileged  Brandon Henrie  youth.  He is a grandson of Earl and  Lola Henrie of Panguitch.  Since 1990, WCF has awarded  nearly 550 Legacy of Learning  scholarships to spouses, sons and  daughters of employees who died in  accidents that occurred at job sites  insured by WCF. WCF is  committed to helping families of  workers who have lost their lives in  industrial accidents. \"Through  these scholarship programs, we  hope to better serve our community  and customers,\" said Melvin C.  Green.  Recipients may apply for  scholarships each year they remain  in college, and WCF places no  limits on the number of family  members who can received Legacy  of Learning scholarships. The list  of 2001 recipients includes 17  families with more than one person  receiving aid provided by WCF.", "articleTitle": "Workers Compensation Fund Scholarship to Brandon Henrie"}, {"id": 3473616, "paper": "Garfield County News", "type": "article", "date": "2001-09-13T00:00:00Z", "year": "2001", "month": "September", "day": "13", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/f9/65/f9655442fa1e26875562497ccba19191bd0ef5ad.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/12/36/1236ac35a38b7db14d0214eec0e1da1823d20867.pdf", "page": 6, "parent": 3473624, "version": 1739889327815524352, "ocr": "Hatch f lows  By Mayall Sawyer  735-4207  LaMar Barney and Janetl Young  went fishing on Otter Creek where  they caught their limit.  Kurt and Phyllis Sawyer and  boys of Mesquite, Nev., and May  Sawyer of Hatch attended a baby  shower for Tracy Matheson, at the  home of Julie Matheson of '  Parowan. They went up to Castle  Valley afterward for a mutton fry  hosted by Kerry and Elaine Sawyer.  The Sawyer family came on to  Hatch and helped on the farm.  The Evans Reunion was held on  Memorial weekend.  Those attending were May E.  Swapp, Penny Evans and Fae  Evans of Salt Lake City, McGavin  and Mira of Sandy, Mr. and Mrs.  Boyd Evans and girls of Salt Lake  City, Ed and Gai Moore of St.  George, Garold and Hope Robinson  of Hurricane. Bruce and Bonnie  Dalton of Panguitch, Gib and  Shannon Clark of Kanab, Mr. and  Mrs. Gary Evans and Mr. and Mrs.  Kurk Evans of Nevada and Carol  Dalton of Las Vegas, Nev. Every  one had a good time. The reunion  was sponsored by Bruce Dalton and  Shannon Clark. It was held at Red  Point and there were 150 people  present.  Paula Wilcox and children and a  friend were here . for the long  weekend. They are from Payson.  LaRue Holt of St. George was a  visitor with Trudy Fagg over the  weekend. Other visitors were Gary  and Nelda Fagg and children of Las  Vegas, Nev.  Carl and LaPreal Wilson of St.  George were here visiting with  family.  Hugh and Jackie Wilson of  Alpine were here for the long  weekend.  Mr. and Mrs. Kent Wilson of  Parowan, were here. They visited  with family and friends.  Darol and Beth Allred and May  Sawyer visited in St. George. They  picked up Ada Nordell and went to  the St. George LDS Temple. They  all had a birthday dinner for Ada and  May.  Cassie Mack went to Cedar City  on Thursday.  The LaVal Sawyers held a  family reunion over the long  weekend. Mr. and Mrs. Michael  Sawyer and Mr. and Mrs. Lance  Sawyer were both in attendance.  Mr. and Mrs. Ferrell Barney of  Las Vegas were here with their  family. They visited with family  and friends.  Renae Lenhart and family were  visitors over the weekend.  Mr. and Mrs. McCallister were  here working on their home.  Kurt and Phyllis Sawyer and  boys of Mesquite were here for the  long weekend visiting May Sawyer.  Grant and Evelyn Black came from  Cedar and they all enjoyed a  cookout.", "articleTitle": "Hatch News"}, {"id": 3473617, "paper": "Garfield County News", "type": "page", "date": "2001-09-13T00:00:00Z", "year": "2001", "month": "September", "day": "13", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/c2/64/c26481a7369320fdb447b7a26786d65438800682.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/49/b9/49b9ea80eded1b55fc3ee8d4907a0e6b8ea0b721.pdf", "page": 7, "parent": 3473624, "version": 1739890824996454401, "ocr": "Hatch f lows  By Mayall Sawyer  735-4207  LaMar Barney and Janetl Young  went fishing on Otter Creek where  they caught their limit.  Kurt and Phyllis Sawyer and  boys of Mesquite, Nev., and May  Sawyer of Hatch attended a baby  shower for Tracy Matheson, at the  home of Julie Matheson of '  Parowan. They went up to Castle  Valley afterward for a mutton fry  hosted by Kerry and Elaine Sawyer.  The Sawyer family came on to  Hatch and helped on the farm.  The Evans Reunion was held on  Memorial weekend.  Those attending were May E.  Swapp, Penny Evans and Fae  Evans of Salt Lake City, McGavin  and Mira of Sandy, Mr. and Mrs.  Boyd Evans and girls of Salt Lake  City, Ed and Gai Moore of St.  George, Garold and Hope Robinson  of Hurricane. Bruce and Bonnie  Dalton of Panguitch, Gib and  Shannon Clark of Kanab, Mr. and  Mrs. Gary Evans and Mr. and Mrs.  Kurk Evans of Nevada and Carol  Dalton of Las Vegas, Nev. Every  one had a good time. The reunion  was sponsored by Bruce Dalton and  Shannon Clark. It was held at Red  Point and there were 150 people  present.  Paula Wilcox and children and a  friend were here . for the long  weekend. They are from Payson.  LaRue Holt of St. George was a  visitor with Trudy Fagg over the  weekend. Other visitors were Gary  and Nelda Fagg and children of Las  Vegas, Nev.  Carl and LaPreal Wilson of St.  George were here visiting with  family.  Hugh and Jackie Wilson of  Alpine were here for the long  weekend.  Mr. and Mrs. Kent Wilson of  Parowan, were here. They visited  with family and friends.  Darol and Beth Allred and May  Sawyer visited in St. George. They  picked up Ada Nordell and went to  the St. George LDS Temple. They  all had a birthday dinner for Ada and  May.  Cassie Mack went to Cedar City  on Thursday.  The LaVal Sawyers held a  family reunion over the long  weekend. Mr. and Mrs. Michael  Sawyer and Mr. and Mrs. Lance  Sawyer were both in attendance.  Mr. and Mrs. Ferrell Barney of  Las Vegas were here with their  family. They visited with family  and friends.  Renae Lenhart and family were  visitors over the weekend.  Mr. and Mrs. McCallister were  here working on their home.  Kurt and Phyllis Sawyer and  boys of Mesquite were here for the  long weekend visiting May Sawyer.  Grant and Evelyn Black came from  Cedar and they all enjoyed a  cookout.", "articleTitle": "Hatch News"}, {"id": 3473618, "paper": "Garfield County News", "type": "unclassified", "date": "2001-09-13T00:00:00Z", "year": "2001", "month": "September", "day": "13", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/75/f9/75f90df88d76bab53a3d6f3f3128cf5aede9c221.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/f9/74/f974e2e716edcfdba30f3b376e823e76827d9b75.pdf", "page": 7, "parent": 3473624, "version": 1739895118870085634, "ocr": "Thursday. Sept. 13. 2001 GARFIELD COUNTY NEWS 7-A", "articleTitle": "Hatch News"}, {"id": 3473619, "paper": "Garfield County News", "type": "advertisement", "date": "2001-09-13T00:00:00Z", "year": "2001", "month": "September", "day": "13", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/37/f5/37f592db8743bd475a663a3021b6a85f5b14d898.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/08/61/08612995a01691f449d0142e6a25cd3ed06955cc.pdf", "page": 7, "parent": 3473624, "version": 1739888824457101312, "ocr": "FOR FAST ACTION,  PLACE YOUR CLASSIFIED  CLASSI-FIED AD IN THE GARFIELD  GAR-FIELD COUNTY NEWS -  Up To 20 Words, Only $4: 20  Cents A Word Thereafter. Send  Your Ad & Your Check To  P.O. Box 127, Tropic, Utah,  84776, Or Call 435-679-8730  by 5 p.m. Mondays.  OR  \"SMALL BUSINESSES\",  PLACE YOUR CLASSIFIED  CLASSI-FIED AD IN NOT 1, NOT  2, BUT 49 NEWSPAPERS  NEWSPA-PERS IN UTAH. One  Placement, One Payment Puts  You Into The \"Utah Classified  Advertising Network\". Reach  Over 500,000 Utahns For  Only $125 For The First  Twenty Five Words And $3 For  Each Additional Word. Your Ad  Will Also Appear On The Internet.  In-ternet. Call The Garfield  County News At 435-679-8730  For Further Information.  ADOPTION  ABORTION? WHY? CONSIDER  ADOPTION. Warm, Secure, Loving  Lov-ing Home Available For Newborn  Baby. Please Call Attorney At 1-800-606-4411.  A-845. (ucan)  ADOPTION: HAPPILY MARRIED  MAR-RIED Childless Couple Wishes To  Adopt A Newborn. We'll Provide A  Lifetime Of Love And Security.  Please Call Nancy Ron Toll Free:  1-866-708-1894. (ucan)  BUILDINGS  CHEAP STEEL ROOFING Siding,  Sid-ing, Heavy Duty, 26 Gauge Galvanized,  Galva-nized, 3' Coverage, 8' $8.40 Each.  10' $10.50, 12' $12.60, 14' $14.20,  16' $16.80, 20' $21.00, 24' $23.50.  Limited Supply. Metalmart 181  South 1200 East, Lehi 1-800-947-0249.  (ucan)  STEEL BUILDINGS: DEALER-SHIPS  DEALER-SHIPS Overstocked! Will Deliver  Now! 25x25, 30x30, 45x80,  50x120. Must Sell Huge Discounts!  Dis-counts! Call Now 1-800-462-7930  Ext. 56. (ucan)  BUSINESS  OPPORTUNITY  A M&M MARS NESTLE. Established  Es-tablished Vending Route. Will Sell  By 92401. Under $9,000 Minimum  Mini-mum Investment Required. Excellent  Excel-lent Monthly Profit Potential. Finance  Fi-nance Available Good Credit. 1-800-637-7444.  (ucan)  GOVERNMENT POSTAL JOBS.  Up To $47,578 Or More. Now  Hiring. Full Benefits, Training And  Retirement. For Application And  Information: 1-800-337-9730 Dept  P-388. - (ucan)  THEME PARTY IN A BOX. De-livered  De-livered To Your Door! All Occasions  Occa-sions - All Ages. Free Catalog.  We're Expanding Work From  Home. 1-377-900-8502.  www.themepartyusa.com (ucan)  IMMEDIATE OPENINGS. SU-PERVISORS  SU-PERVISORS And Assistants. Full  Time And Opart Time. $$$$$ Free  Information. 1-800-662-3562.  www.provenfreedom.com (ucan)  GROSSED $90,000 LAST Year!  With This Professional Carpet  Cleaning Business. Other Interests  Force Sale Of Complete System  And Van For Only $9,850. Call  Brett, 1-801-818-2795 208-251-8993.  (ucan)  FINANCIAL  THE BANKRUPTCY FIRM.  Winward And Toscano LLC. Stop:  Foreclosures, Garnishments, Repossessions.  Re-possessions. Free Information - $0  Down. Personal Service. Salt Lake  City 1-801-359-1313, Ogden 1-;801-392-8200,  Toll Free 1-866-;359-1370.  (ucan)  HELP WANTED  RADIOLOGY TECH - WOULD  Need To Perform Routine X-Ray  Examinations And Some CT Exams  Ex-ams With Limited Supervision,  Will Train In CT If Needed. Need  To Perform Daily QA On Processor.  Proces-sor. Needs To Be ARRT Certified  And A Current Utah License. This  Position Is An As Needed Position  With Some Call. Job Closes On  September 28, 2001. Apply At  Garfield Memorial Hospital Human  Resources, 200 North 400 East,  Panguitch, Utah. 435-676-8811.  An Equal Opportunity Employer.  (23, 30, 6, 13, 20, 27)  NOW HIRING: COMPANIES  Desperately Need Employees To  Assemble Products At Home. No  Selling, Any Hours. $500 Weekly  Potential. Info. 1-985-646-1700.  DEPT. UT-4690. (13)  FREE TRAINING AND EDUCA-TION!  EDUCA-TION! Job Corps Means Free Edu  cation And Training. Live On A  Job Corps Center And Get The  Skills You Need For A Good Paying  Pay-ing Job. Job Corps Staff Will Help  You Plan Your Career And Find A  Great Job When You Graduate.  GED And High School Diploma  Programs Available. Ages 16-24.  Call 1-800-733-JOBS For More  Information. (ucan)  AGE 16-24? JOB CORPS OF-FERS  OF-FERS Free Job Training And  Placement, Ged Classes And College  Col-lege Programs - Plus Free Housing!  Over 100 Careers! Call 1-800-426-5627.  (ucan)  GET HIRED! GET TRAINED! Get  Paid! Training And Hiring 250  Drivers! CDL Class A And B, Refreshers!  Re-freshers! 100 Percent Financing  Available! Call 1-800-770-1631.  Experienced Call 1-800-958- 2353.  (ucan)  MAY TRUCKING IS YOUR  ROAD To Success! Teams Solos  Run Reefers 48 States. High Miles,  Top Pay, Benefits And Equipment.  Call Today - Start Tomorrow! 1-800-251-8846.  (ucan)  DRIVERS: OTR DRIVERS  Needed. Class A CDL With Experience  Experi-ence Required, Good Work Record,  Clean MVR. Call Bill Horrocks  Today. Marten Transport, LTD 1-800-786-4135.  Or Visit Our Web  Site www.marten.com On Pay And  Benefits. (ucan)  DRIVER. ..NEW LEASE PURCHASE  PUR-CHASE Program! Don't Overpay  For CDL Training! 15 Day Course  For Only $1 20.00 Call For Details!  De-tails! Free CDL Training For  Spouse! We Offer: Excellent Pay  And Benefits, Job Stability, Consistent  Con-sistent Miles. Experienced Drivers  Welcome! 1-888-490-8343  www.swifttrans.com (Eoe-MF:  Minimum 23 Years Old) (ucan)  GET A BETTER JOB? Let Job  Corp Train You And Help You Get  A Good Paying Job. Live On Center  Cen-ter For Free. Our Career Counselors  Will Help You Plan A Successful  Future And Place You In A Career  With Long-Term Potential After  Graduation. Get Your GED. Ages  16-24. Call l-800-733-JOBS.(ucan)  RADIOLOGIC TECHNOLOGIST:  FULL Time Position, ARRT Required,  Re-quired, CT And Ultrasound Preferable.  Prefer-able. Competitive Wage And Benefit  Bene-fit Package. Beaver, Utah. Fax Resume  Re-sume To 1-435-438-7224 Or Call  1-435-438-7172. (ucan)  LIVESTOCK  HORSE AUCTION: AN-DREASEN  AN-DREASEN Diamond A Quarter  Horse Production Sale, Saturday,  September 15, 1 P.M. Box Elder  County Fair Grounds, Tremonton,  Utah. Featuring 2001 Foal Crop,  Mares, Geldings, With Color And  Breeding Galore. 1-435-286-2281.  (ucan)  MISCELLANEOUS  FOR SALE  HOT TUB SPA Self Contained.  Con-tained. All Options, With Cover.  New, Never Used, Still In Original  Wrapper. Cost $6,900 Sacrifice  $2,600. Can Deliver. 1-801-381-3551.  (ucan)  GOING OUT OF BUSINESS  SALE. Every Kind Of Eclectic Accessory  Ac-cessory And Home Furnishing  Imaginable - It All Must Go! 4674  South Holladay Boulevard 1-801-277-6327.  2900 South 300 West 1-801-486-6686.  Sofa Factory.  (ucan)  BUILD YOUR OWN Steel Fences,  Gates And Corrals. Steel Tubing,  Pipe, Low Prices. If You Need  Metal, You Need Metalmart. 181  South 1200 East, Lehi. 1-800-947-0249.  (ucan)  MOTORCYCLES  FOR SALE  NEWLY REFURBISHED  STREET Bike. Great Condition.  New Paint Job. Must See.  $1,200. Call Adam Bales At 435-679-8504.  (tfn)  1999 KAWASAKI KLX 300R Dirt  Bike. Very Good Condition.  Taken Care Of. Runs Great.  $2,700. Call Adam Bales At 435-679-8504.  \" (tfn)  NOTICES  WOLFF TANNING BEDS. Tan At  Home! Buy Direct And Save!  Commercial Home Units From  $199.00. Low Monthly Payments.  Free Color Catalog. Call Today 1-800-842-1310  (ucan)  \"PROPERTY OR HOMES  FOR SALE OR RENT  BRYCE CANYON - 240 ACRE  Horse Ranch. Pressurized Irrigation,  Irriga-tion, Stream, Oak Groves. Three  Bedroom Home, Shop, Scenic  Highway 12 Frontage, Potential  Golf Course, Campground, Etc.  ERA Brokers Consolidated, Joe  Thompson, 435-679-8512 Or 800-341-3959.  Email: joetcolor-country.net.  joetcolor-country.net. (tfn)  HENRIEVILLE NEW LISTINGS  New Three Bedroom, One Bath  Log Cabin On Half Acre. Irrigation  Irriga-tion Water, Orchard, Garden Plot.  $60,000 Or Best Offer Two Bedroom,  Bed-room, One Bath Cottage, Orchard,  Pressurized Irrigation On 12 Acre.  $76,000. Four Other Homes In  Bryce Valley. Call Joe Thompson,  ERA Brokers Consolidated, 435-679-8512  Or 435-676-8878.  Email: joetcolor-country.net.  (tfn)  TROPIC BUILDING LOT - 1 12  ACRES Immediately Adjacent To  Tropic Water Tank. Beautiful View  Overlooking Town. $19,000.  435-679-8730 Or 801-596-9357  (Evenings) (tfn)  RETIREMENT HOMES... 55  Near Sand Hollow Lake And Recreation  Rec-reation Area On Hwy. 9 Near Hurricane.  Hur-ricane. Close To Sky Mountain  Golf And Coral Canyon Golf.  $71,900 To $114,500. Call Paul  Smith, Coldwell Banker Residentail  Broker. 1-800-574-8989 Or 435-632-8168  Cell. Hurricane. (tfn)  19.5 ACRES - CEDAR CITY...  Only Minutes From Town, Power,  Telephone, Level, Great Views And  Building Sites, Partcially Fenced.  Horses OK. $40,000. Call Paul  Smith, Coldwell Banker Residentail  Broker. 1-800-574-8989 Or 435-632-8168  Cell. (tfn)  PAROWAN... RECREATIONAL  RV Lots With Full Hookups Starting  Start-ing At $8,500. Like New Cottage  Homes Starting At $32,500 With  Lot. Park Model Homes Starting  At $25,000 With Lot. For More  Information, Call Paul Smith,  Coldwell Banker Residentail Broker.  Bro-ker. 1-800-574-8989 Or 435-632-8168.  (tfn)  ESCALANTE, UTAH - L87  ACRES For Sale Overlooking The  Grand Staircase. Will Sell With Or  Without Two Shares Water. 435-826-4827.  (tfn)  BUILDER DEFAULT! CANCELED  CAN-CELED Subdivision! New High  Quality Structural Insulated Panel  Home Kits! Fast Simple Assembly.  Assem-bly. Your Foundation! 345 Bedrooms.  Bed-rooms. Flexible Layouts. Lifetime  Warranty. 1-800-847-9723  www.valubuild.com (ucan)  UTAH'S NUMBER 1 GUERDON  Home Dealer Now Has 1 8 Models,  With Options From Log Siding To  6-12 Roof Pitches. 945 North 2000  West Springville, Utah. 1-801-489-3344,  1-888-224-6637. (ucan)  VEHICLES FOR SALE  1992 CHEVY LONGBED 34  TON PICKUP. 454 Engine. New  Bedliner. Tow Package. Good  Condition. Automatic, 4x4, Air,  Pioneer CD Sound System.  $9,700. Call Adam Bales At 435-679-8504.  (tfn)  GARFIELD COUNTY NEWS  Does Not Endorse, Promote Or  Encourage The Purchase Or Sale Of  Any Product Or Service Advertised  In This Newspaper. Advertisements  Advertise-ments Are The Sole Responsibility  Of The Advertiser. Garfield County  News Hereby Disclaims All Liability  Liabil-ity For Any Damage Suffered As  The Result Of Any Advertisement  In This Newspaper. Garfield  County News Is Not Responsible  For Any Claims Or Representations  Representa-tions Made In Advertisements In  This Newspaper. The Garfield  County News Has The Sole  Authority To Edit And Locate Any  Classified Advertisement As  Deemed Appropriate And Reserves  . The Right To Refuse Any Advertising  Card Of Thanks  A special thanks to everyone  every-one who helped in any way  or called last Friday when Van  Wiley seriously injured himself  when a colt bucked his off  on the East mountain.  He and his daughter Marcia  and her two sons Chantry and  Chace were all driving cattle  when this happed and had no  way to get him to the hospital.  Word was sent by cell phone  and out of no where came  two 4-wheelers and they were  able to get him on the back  of one and start for help.'  Sheriff Marty Gleave of Piute  County recruited help from  Piute and Garfield County  Ambulance crews. I don't  even know the mens names  who had the bikes. Everyone  was so excited that we forgot  to get names, but know that  you are certainly remembered  Because of such a great  bunch of people who are so  dedicated to render sercie  anytime or anyplace, he was  rushed to Garfield Memorial  Hospital where he had great  care.  Betty Wiley and all the family  If my people, which  are called by my  name, shall humble  themselves, and pray,  and seek my face, and  turn from their  wicked ways; then will  I hear from heaven,  and will forgive their  sin, and will heal their  land.  II Chronicles 7:14  Wanted: someone who lives in  doulder or tropic, knows  everybody, and would like to  vjrite the doulder or tropic  columns for the garfield  county news, call 435-679-8730  I DVE Yy5 HUJENflSE  & SEEM 100JL F MEMTTW.  A GREEN STICKER MEANS YOUR NATURAL GAS ' Please note that THESE CHANGES AFFECT  FURNACE OR WATER HEATER IS PROPERLY ADJUSTED. 4ppj. NATURAL GAS FURNACES AND WATER  v r ItlPjJy f- ' 7 HEATERS ONLY and do not require the I  Bq(ji . tm T TltfQ I replacement of any appliances. Only a licensed  The composition of natural gas supplies entering Questar \"7 Sef pQ. contractor should make the adjustment. Once your  Gas' system is changing. Several factors are responsible 0ri' ? Drill SiIe appliance is inspected and adjusted, insist chat the  for this change, but one of the most significant is the recent Outlet M contract:or aPP'Y a Gfeen Sticker,  discovery of an enormous natural gas field near Price, SSUre '  Utah, that has given us access to abundant, lower-cost ' Questar Gas customers in Wyoming and in the Utah  gas supplies. These changes allow Questar Gas to Iclf. \" communities of Vernal' Maeser' N'aPles' Roosevelt, Moab,  acquire the fuel you depend on and deliver it to your 0rifce . Poff) Monticell' Hundngton' Castle Dale. Orangeville, Ferron,  home at the best possible price. They also mean r'U Size I Clawson, Elmo and Cleveland should have appliances that  customers furnaces and water heaters need to be 0\"kf Monjp \" ' . are alreadY ProPerlV ited for the gas supplies in those  checked and, if necessary, adjusted by a licensed 0Ofe fej0re areas. However, to ensure safe operation and maximum  contractor to ensure continued safe and efficient efficiency and performance, Questar Gas recommends that  operation using these new supplies. CUStmerS haVe their furnaces Periodically maintained  \"\"\" \" ' by a licensed contractor who can check to make sure their  By processing supplies entering our system, Questar Gas - equipment is properly adjusted.  is currently delivering gas that all appliances can use. We  plan to continue this practice for several years. However, it ' ' .  is not known exactly how long we can do so and continue  providing gas at the lowest possible price. Once this ' A Green Sticker indicates your natural gas furnace or water Listings for licensed contractors can be found under  transition period ends, any gas furnace or water heater heater has been inspected and is properly adjusted to safely \"Heating\" in the Yellow Pages.. Free contractor referrals  not properly adjusted will be unsafe to use and could bum the newer gas supplies. If your furnace or water heater are available by calling the Rocky Mountain Gas  release excess carbon monoxide into your home. doesn't have a green sticker, contact a qualified contractor Association in Salt Lake City at 832-9490 or outside  Without proper ventilation, carbon monoxide could to inspect and (if necessary) adjust your appliances to Salt Lake at 1-800-729-6791. A list of contractors is also  cause serious injury or death. operate safely and efficiently. available online at www.questargas.com.  Please check your September natural gas bill for additional information about this important topic.  TAKE COMFORT.  Gas", "articleTitle": "Hatch News"}, {"id": 3473620, "paper": "Garfield County News", "type": "article", "date": "2001-09-13T00:00:00Z", "year": "2001", "month": "September", "day": "13", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/27/76/277646a641351f906a0bf56b96b4725fb0cb7918.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/ae/77/ae77adc39a9b95c2067a388efd23c7813fef542e.pdf", "page": 7, "parent": 3473624, "version": 1739893845589491712, "ocr": "Panguitch Quad  Earns Money  For College  In early August, four young  men from Panguitch stepped up to  the plate to do their part in serving  our nation by enlisting in the Utah  Army National Guard.  By volunteering to serve for six  years, in the National Guard, the  four Panguitch High seniors earned  over $100,000 for college and living  liv-ing expenses. Each of the four  young men will receive an $8,000  cash bonus, $9,468 for Montgomery  Montgom-ery G.I. Bill, $7,200 for a G.I. Bill  Kicker. They are also eligible to  receive $3,200 for State Tuition  Assistance and $2,400 for Federal  Tuition Assistance. These amounts  do not include the monthly paycheck  pay-check they will receive for attending  their drill weekends.  PFC Cody Bremner, PV2 Michael  Mi-chael Black, PV2 Matthew Black  and PV2 Landon Fullmer will all  four report to Fort Sill, Oklahoma  for basic training on July 2, 2002.  Between now and the time they  report for training, they will finish  their senior year of high school and  will also be drilling one weekend  per month with their National  Guard Unit located in Beaver. During  Dur-ing their weekend drills, they will  be preparing for their basic training,  learning how to march, use military  weapons, learn history of the National  Na-tional Guard and will be basically  learning how to be soldiers.  It should also be noted that  each of these outstanding individuals  individu-als were advanced in rank and pay  grade for receiving their Eagle  Scout Certificates. Hats off for a  job well done gentlemen, and  thanks for doing your part.", "articleTitle": "Panguitch Quad Earns Money for College"}, {"id": 3473621, "paper": "Garfield County News", "type": "page", "date": "2001-09-13T00:00:00Z", "year": "2001", "month": "September", "day": "13", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/1e/2c/1e2c671c54d0208b3af88ecfa3d7b2577cab12a1.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/32/77/3277f0af6501a762b8c3a30bd7aa7264e9a7611f.pdf", "page": 8, "parent": 3473624, "version": 1739889857263566849, "ocr": "Panguitch Quad  Earns Money  For College  In early August, four young  men from Panguitch stepped up to  the plate to do their part in serving  our nation by enlisting in the Utah  Army National Guard.  By volunteering to serve for six  years, in the National Guard, the  four Panguitch High seniors earned  over $100,000 for college and living  liv-ing expenses. Each of the four  young men will receive an $8,000  cash bonus, $9,468 for Montgomery  Montgom-ery G.I. Bill, $7,200 for a G.I. Bill  Kicker. They are also eligible to  receive $3,200 for State Tuition  Assistance and $2,400 for Federal  Tuition Assistance. These amounts  do not include the monthly paycheck  pay-check they will receive for attending  their drill weekends.  PFC Cody Bremner, PV2 Michael  Mi-chael Black, PV2 Matthew Black  and PV2 Landon Fullmer will all  four report to Fort Sill, Oklahoma  for basic training on July 2, 2002.  Between now and the time they  report for training, they will finish  their senior year of high school and  will also be drilling one weekend  per month with their National  Guard Unit located in Beaver. During  Dur-ing their weekend drills, they will  be preparing for their basic training,  learning how to march, use military  weapons, learn history of the National  Na-tional Guard and will be basically  learning how to be soldiers.  It should also be noted that  each of these outstanding individuals  individu-als were advanced in rank and pay  grade for receiving their Eagle  Scout Certificates. Hats off for a  job well done gentlemen, and  thanks for doing your part.", "articleTitle": "Panguitch Quad Earns Money for College"}, {"id": 3473622, "paper": "Garfield County News", "type": "unclassified", "date": "2001-09-13T00:00:00Z", "year": "2001", "month": "September", "day": "13", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/88/aa/88aa51d7e2d77bc23fa5eb301adc2483793404fb.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/35/d3/35d31725a034861e1ae27a804ec748433cfafe9e.pdf", "page": 8, "parent": 3473624, "version": 1739890230555574272, "ocr": "8-A GARFIELD COUNTY NEWS Thursday. Sent. 13. 2001 I", "articleTitle": "Panguitch Quad Earns Money for College"}, {"id": 3473623, "paper": "Garfield County News", "type": "advertisement", "date": "2001-09-13T00:00:00Z", "year": "2001", "month": "September", "day": "13", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/4b/d3/4bd3c66d41127421ef0b9ce7f394311c4a7d2ebf.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/fc/b3/fcb33714826df48ecd134aa4d2df005b9465eb0e.pdf", "page": 8, "parent": 3473624, "version": 1739884892566585349, "ocr": "SSt 0fk ri 55s h fl  7lr?F VrCivl Choice Boneless ; ffj wo cC?3 a  HP JT2 New York Steak f 1  I r\"rr ! WELCOME MARKET J CnrESO I  Q J-LV 1 I Will Be Giving Away A I ,j. i l - g  3 v Shasta 1 48 Q8. Coleman Cooler i ySSfe -\"aMTa  3 jw 12 $1.99 1 And Two .Cases Off Cofce If cTmilv Bread 3  1 S) i-ZT On Saturday, Sept. 15 ( cfnQ6) \" QQtf I  H TTv f Jfj; ! No Purchase Necessary Enter Each Time You Are in. . 8Z-4I.Ui 24 OZ. H' gj  uj s\" I Kii&Q&crIA b ramjBMaBMgraEMaaBMBMaBMaBjgjaaBiBBiB m s Guaranteed Lower wUPER C4  0 I GtontJll Price? I SAUFP ) fit  1 V. Beans Green Giant Boneless Beef f  ,,n7 79 Njbiets Nee,2rK Chuck Roast lMif -  mk ,60Z-Z9 Co . ibf $1.59 lb. IfegPLl J  1 . ceisha\" 2$1 !f 9 ID Chips Aboy  I Geisha Mandarin \" ( SJff is-roz. 2$5 p  3 Pineapple Oranges . \" .( &ff r  2ooz. 99C 15 02. 89t f$?l com -n piump cheetos ir -SIg  t H fea fI ' Leffiers 2 MlS  1 H 64 oz. 2$4 II J Cache Valley 64oz.$3.69 Pk. offial FffiS &&m  p r- I I Cheese Chips PP  fiffiW Hunts Wi-dA i I 2 lb. loaf $4.99 Pk2. 10oz 2$3  p J sauce lfrj ill v 223 jjjilMju J 2  S clm?Al?r, lEXft Wll & Western Family FrOZefl f jSL- B  3 ' rlX-xx faj sliced Dinners lJ S  8 T Chocolate Milk Bacon qqt lMz0ti 8  y xT 8'no I  3 , NHVLK Guaranteed Lower Keeblcr n w  S ITt-i We.s,ern Fa\"iily rB V 2u,s$2.t\" \"VSupS \" 8  JWl Shortening SisSl V Cuaran,eea iJ4SS3 Western Family p 8  mbl 3.. $1.89 5gprl Crea;Chse Eggr)  4 13 cO --$1.09 (Big  H Soft 'n Gentle s Ax ' \" ' - j g  a TiSSUe Lae Sweet, Juicy  SUs Brawny ciorox , 2) 1 ( i titect.. rm.-i.. S  1 Keebler Towels Liquid , V J , ' SgeJute rfh I  I Honey 3r0ii2$5 BlelcL --- oc?i 'I i  Grahams 63)3 96o, 99 C spf& v 6oz. 99 C L  R rfO ft rr?vA FrP:h YOPlait 11, P  g2 ib. $29 daN w snow white Yogurt 7 S  afTB oJ-A viMt 6o, 2$i5 Cx; j  8 i (S New York SteaK 69 C b. KSn u g  S P ci 'I ttC QQ lb WP Jeno's Cream 0' Weber 8  3 13 i S5-89 lmSffQl pjnzZa Chocolate Milk  J 70Z 6$4 ,22a,ion $1.49 I  ; K f Banw X \" g  3 j Thank you for j Miracle ( frozen Dinners cream O'Weber j Absolutely j g  8 Shopping At j whjp V 8-iioz.99C -X fL Sour Cream No Dealers j g,  3 I VcIcomc Market j Vw- rarante,, superN 7 ti CQ 1 Please S  a i ! qt 2$5 X y 24 oz. $1.59 i,,,J,!fl, j S  BweJ, 10 South Main -Panguitch, Utah 84759 1 HT rppvC p to j&Sai  3 l&VC? Your Store Hours I I3.t4.i5 m 4j 8  J a.m.-9:oo p.m. 1 J U UU UU U U ..'!:':'9 U&r3", "articleTitle": "Panguitch Quad Earns Money for College"}]}