{"numFound": 38, "start": 0, "numFoundExact": true, "docs": [{"id": 3457886, "paper": "Garfield County News", "type": "page", "date": "1997-04-10T00:00:00Z", "year": "1997", "month": "April", "day": "10", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/da/33/da335cf7ca7e0ed521ec472340ac0c6af4d5bb2a.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/f2/c4/f2c4ee206d95448f79e9218eb638f76ab0868a07.pdf", "page": 1, "parent": 3457924, "version": 1739885207365877761}, {"id": 3457887, "paper": "Garfield County News", "type": "masthead", "date": "1997-04-10T00:00:00Z", "year": "1997", "month": "April", "day": "10", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/71/af/71af15012e748479c3fc3d6a621520ba02e4e4f5.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/1d/f2/1df2193df6d84e2118ea7228c86d4f3aed7ffac9.pdf", "page": 1, "parent": 3457924, "version": 1739890010240319488, "ocr": "GARFIELD COUNTY NEWS  Volume 76 Number 15 Tropic, Utah Thursday, April 10, 1997 Price 700"}, {"id": 3457888, "paper": "Garfield County News", "type": "article", "date": "1997-04-10T00:00:00Z", "year": "1997", "month": "April", "day": "10", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/d4/ef/d4ef389f79e41753b6fe798ff7fd03d986479c44.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/64/88/6488442519c030257f8753ebd1f592f5c4a2ad51.pdf", "page": 1, "parent": 3457924, "version": 1739886063187394560, "ocr": "This was Jane Eyre's and Ucanogos' first day at the Galloping Tortoise  Ranch in Cannon ville. Debby Urpani says she hasn't been able to get a  halter back on these alpacas again, but she's not worried. When the  gentle, shy animate are sheared soon, they will provide fibres for her  spinning wheel which she will spin into some of the finest yam  available  First In The County  Alpacas Take Up New  Residence At Ranch On  Hwy 12 In Cannonville  CANNONVILLE Two  enterprising women are striking  out with an environmentally-friendly  environmentally-friendly new industry for Garfield  County that could easily set a  precedent. Local folk searching  for a way around recent devastating  devas-tating blows to the traditional  local economy based upon the  harvest of timber and agricultural  pursuits related to cattle ranching  might well decide to follow suit if  their venture proves successful.  Debby Urpani who lives in  Cannonville and her mother  Maureen Urpani who lives in Las  Vegas have combined their funds  and their ambitions to begin the  raising of alpacas on their acreage  acre-age on the outskirts of Cannonville.  Cannon-ville. \"I haven't been able to get a  halter on them yet,\" Debby says,  \"but there's no hurry. They're  very shy, non-agressive animals  and will get used to halters again  as soon as they adjust a little  more.\"  At the residence on the ranch  on Utah's Scenic Highway 12,  Debby and Jeff Parker who  conducts a fly-fishing guide service  ser-vice have been operating the  Galloping Tortoise Bed &  Breakfast for the past two years.  The Galloping Tortoise has its  downstairs committed to the bed  and breakfast which they have  completely redesigned and redecorated  redec-orated to reflect the colors and  the scenery of the Bryce Canyon  area.  Debby, who was born on  Malta, was reared in Europe,  attending schools in Switzerland  and England, before she, her  sister and parents came to the  U.S. to stay. She is bi-lingual in  English and French and fluent in  German. Her language skills  (See Alpacas Take Up Residence  In Cannonville On Page 3A) .  Alpacas Take Up Residence  At Hwy 12 Cannonville Ranch  From Front Page  have led to a sideline business  translating menus, brochures,  signs, etc. for local tourist-oriented  tourist-oriented businesses. The busy  young woman is employed at  Bryce Canyon Lodge and also  works part-time for the Garfield  County News.  Her widely traveled and  equally industrious mother Maureen  Mau-reen conducts a tour business  from her home in Las Vegas and  has invested in the alpaca  business venture, visiting often in  Cannonville to help.  It was Maureen who first introduced  intro-duced the idea of raising alpacas.  She was searching the internet for  \"angora\" hoping to buy some wool  for Debby to card and spin on her  frame-style spinning wheel. The  next word she came across was  \"alpaca.\" Fascinated, she sent to  the Alpaca Owners & Breeders  Association in Estes, Colo, for  additional information and pu-,  rchased some alpaca wool in Las  Vegas for Debby to spin.  Delighted with the silky feel of  the long alpaca fibers, Debby,  too, became excited and the two  soon visited an alpaca breeder in  Prescott, Ariz. Animal lovers by  nature, they immediately fell in  love with the small gentle  alpacas. Returning home, the two  kept the phone lines buzzing  between Cannonville and Las  Vegas and they made their decision  deci-sion to buy.  Jane Eyre, 7, and Ucanogos, 3,  both pregnant female alpacas,  arrived in Cannonville just three  weeks ago. They were purchased  from Tom and Carol Frazier of  Heber City whose alpaca  breeding started seven years ago  when Jane Eyre was born. They  now have more than 20 animals.  The only other Utah breeder is in  Park City.  Jane Eyre expects her sixth  baby, called a \"cria,\" in February  and Ucanogos is expecting her  first in September. Crias  typically weigh from 15 to 19  pounds. The gestation period for  alpacas is 335 to 350 days and  they can be bred again as early as  two weeks after they deliver and  I they can produce young for up to  20 years.  Almost every alpaca in the  U.S. is individually registered and  they are probably the most carefully  care-fully pedigreed animals in the  nation. Registration is done by  . blood type and carefully monitored.  moni-tored. Usually less than four feet  high, and weighing 100 to 175  pounds, alpacas are generally less  than one-half the size of a llama.  Male alpacas begin breeding  when they are between two and  three years old. but the females  are bred as early as 14 months.  ' The AOBA in Colorado says that  due to the infancy of the industry,  breeding will be the focus for  years to come because of the  small size of the basic herd.  Many traditional farmers have  diversified their investment with  alpacas and discovered that their  investment is paying off. They  have found them inexpensive to  raise because they eat little and  are easy to shelter and fence.  They are incredibly healthy  animals and cause little environmental  environ-mental impact compared with  other animals.  Alpacas are shorn annually in  the sping with females producing  about five pounds and males often  more than eight. Fibre from a  cria on its first shearing sell at a  premium for their extra delicacy.  Currently, alpaca yarn is going for  $7 an ounce and up. Alpaca fibre  is in great demand by hand  spinners who produce yarns of  incredible beauty and softness.  Sometimes the alpaca fiber is  combined with sheep wool,  mohair or silk to create a variety  of elegant textiles. There are 22  recognized colors and various  shades of those.  Ruminants, with three stomachs,  stom-achs, alpacas prefer to graze and  browse openly. A simple three-sided  three-sided structure will provide  adequate protection, and fences  must be able to keep out  predators. Five to 10 animals can  thrive on an acre of land. They  are seen as profitable and  practical alternatives to sheep  farming, a once-profitable industry  indus-try in Garfield County.  Will alpacas one day be as  common to the area as sheep  were 50 years ago? And will  local ladies take to spinning the  way they have taken to quilting?  Local folk will likely be watching  to see what happens at the  Galloping Tortoise Ranch.", "articleTitle": "alpacas Take up New Residence at Ranch on Hwy 12 in Cannonville"}, {"id": 3457889, "paper": "Garfield County News", "type": "article", "date": "1997-04-10T00:00:00Z", "year": "1997", "month": "April", "day": "10", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/ab/72/ab72938d15ff64d08e041ed44f39adbb423cd48b.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/de/ee/deee871f751cc18696d865b1f854937a11487cd1.pdf", "page": 1, "parent": 3457924, "version": 1739884794765901825, "ocr": "Boulder's Helen Lyman, principal impetus behind the small town's  new community library cuts the ribbon at the ceremony marking the  opening of the library that skeptics said could never be accomplished.  Boulder Gets Its Own  Community Library  By Jeanne Harshman  BOULDER Skeptics who  thought it couldn't be done in a  town as small as Boulder were  surprised and residents were excited  ex-cited and proud as they attended  ribbon-cutting ceremonies for the  new Boulder Community Library.  Located at the Town Hall, the  library opened its doors for the  first time on Mar. 22.  Helen Lyman, who has been  the driving energy behind the library,  li-brary, held the scissors while library  li-brary board members Keith Full-  mer, Kay Ripplinger, Robert and  Naomi Brems, and Larry and  Barbara Van Quill stood beside  her.  Boulder Town Council members  mem-bers were also on hand and Mayor  Julee Lyman commended the  library board members who gave  their time, effort and personal  finances to accomplish the undertaking  under-taking expected to benefit the  entire community.  Town Council member Gladys  (See Boulder Gets Its Own  Library on Page 3A)  Boulder Gets Its Own Library  From Front Page  it. i .  LeFevre, mother of nine children  still at home, said, \"It is fabulous\"  fab-ulous\" and member Rhea  Thompson added his own kudos.  Also supportive of the effort were  council members Tina Kaxlfion  and Wulf Barsch who were unable  un-able to be on hand for the special  event.  The opening fulfilled a dream  for Helen Lyman. When she was  awarded the Utah Huntsman  Award as an outstanding teacher  last year, she expressed her  dream in a writeup in the Salt  Lake Tribune. Renee Brown of  Murray, an employee of the Murray  Mur-ray School District, read the a'rti  cle. She knew her school district  was removing books from its libraries  li-braries and asked if the books  could be donated to Lyman's  dream rather than discarded.  With a \"yes\" answer from district  authorities, she and her husband  Richard traveled aaround their  district and gathered the books.  Two truckloads of books, each  requiring a nine-hour round trip to  Boulder, were delivered by the  Browns.  Many thanks were expressed  to them at the opening ceremony,  for their help and concern for the  \"country cousins\" they had never  met.  Books were also forthcoming  from the LDS Humanitarian Services  Serv-ices in Salt Lake City. Helen  Lyman and Keith Fulllmer had  researched and traveled to libraries  librar-ies all over the state and felt discouraged  dis-couraged at times. However,  Lyman kept pushing to fulfill her  dream, as a teacher, of a community  com-munity library where people of all  ages can continue to increase  their knowledge.  Even the Utah State Library  Boaid was skeptical that such a  project could be accomplished in  a town as small as Boulder. But  Helen's favorite quote is \"It's like  the little bumble bee who didn't  know it could fly and is now flying\"  fly-ing\" A wide selection of topics  awaits the reader: autobiographies,  autobiogra-phies, fiction, non-fiction, science,  sci-ence, crafts, cooking, along with  several sets of encyclopedia, dictionaries,  dic-tionaries, a variety of resource  books, and magazines all carefully  care-fully categorized and catalogued.  Three donated computers,  equipped with Windows 3.1, were  obtained by Fullmer. They hope  to be on the internet by summer  when more finances are available.  Monetary donations will be  gratefully received. They can be  sent to the Boulder Library Board,  Boulder, Utah 84716.  Some donations of money as  well as tables, desks, chairs, filing  fil-ing cabinets, paper products, and  other items have helped to maket  the library functional.  Local residents have also donated  do-nated books and are looking forward  for-ward to special events such as  book reviews, guest speakers, and  artistic and cultural offerings of  many kinds.  On the walls above the books,  some donated works of art are  already displayed. The opening  was highlighted with light refreshments  refresh-ments and three tables of books,  duplicates of those in the library,  which were given away. Children  and adults left with books under  their arms.  The library will be operated by  volunteers and will be open every  Thursday from 4 to 8 p.m. and on  Saturdays from 11 to 4 p.m. It is  expected to be a great place for  young people to do their homework  home-work and an important source of  good literature.", "articleTitle": "Boulder Gets Its Own Community Library"}, {"id": 3457890, "paper": "Garfield County News", "type": "article", "date": "1997-04-10T00:00:00Z", "year": "1997", "month": "April", "day": "10", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/7b/fa/7bfaed54f645711e493f71ab899f040809b5cbde.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/1d/3b/1d3bc3d244ea179235b1b5ef5c685aef4122d6c3.pdf", "page": 1, "parent": 3457924, "version": 1739890022579961857, "ocr": "Upper Sevier Soil Conservation District supervisors  Harold Sevy, James Hatch, Leland Riggs, Allan  Henrie and Chairman, Mike Dal ton presented  The Upper Sevier Soil Conservation  Con-servation District (SCD) recognized  recog-nized the Jesse and Lileth Wilson  family, who own the Sunset Cliffs  Ranch located northeast of Hatch  Town and south of highway 12 in  Garfield County, as the district's  Conservation Farmer of the Year.  The Wilsons implemented a new  sprinkler irrigation system using  the district's Agriculture Resource  Development Loan (ARDL) program,  pro-gram, which helped prevent ero-  Conservation Farmer of the Year award to family  representatives Mr. and Mrs. Karl Wilson who  accepted for honorees Jesse and Lileth Wilson.  Upper Sevier Sou Conservation District Names  Wilsons Conservation Farmers Of The Year  sion and improved water quality  on the ranch. The project also  helped the Wilsons conserve  water with the new system. As  part of the project, the Wilsons  also rebuilt a diversion structure  and sediment control structure to  reduce soil erosion and improve  water quality on the ranch.  The Upper Sevier SCD represents  repre-sents western Garfield County and  is a locally elected board who  serve as the grass roots link between  be-tween the private land user and  several government agencies and  their soil and water conservation  programs.  Each year the Upper Sevier  SCD recognizes a land owner  within the district who has been  applying sound conservation practices  prac-tices and doing a good job managing  man-aging the land and the district's  natural resources.", "articleTitle": "Upper Sevier Soil Conservation District Names Wilsons Conservation Farmers of the Year"}, {"id": 3457891, "paper": "Garfield County News", "type": "unclassified", "date": "1997-04-10T00:00:00Z", "year": "1997", "month": "April", "day": "10", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/83/16/8316d967a2577ead97a9323dc1848b42b1f1782f.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/af/10/af107c0f7f41eb93a6218a8c5ef70c7d4e4fb28d.pdf", "page": 1, "parent": 3457924, "version": 1739893833486827523, "ocr": "Weather  Date High Low Precip  Apr. 2 33 20 .31  Apr. 3 46 19 .09  Apr. 4 49 20  Apr. 5 43 4 .26  Apr. 6 47 9  Apr. 7 51 21  Apr. 8 53 23  Weather is reported by Chris  Dalton, Dixie National Forest weather  wea-ther observer, Powell District, and  is an official part of the United  States Weather Service statistics.", "articleTitle": "Upper Sevier Soil Conservation District Names Wilsons Conservation Farmers of the Year"}, {"id": 3457892, "paper": "Garfield County News", "type": "article", "date": "1997-04-10T00:00:00Z", "year": "1997", "month": "April", "day": "10", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/99/a0/99a01d71b61b20990534797b3c681b92cd170e41.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/9a/45/9a45e9affacdc585ae6aef7625b9455c7a36f6d0.pdf", "page": 1, "parent": 3457924, "version": 1739892624660103168, "ocr": "No Release For Fisher;  Judge Sends Him Back  To Jail For 25 More Days  PANGUITCH In Sixth Judicial  Judi-cial District Court on Thursday,  Apr. 3, Judge K. L. Mclff had an  abbreviated half-day court session  in the afternoon.  Up for review was the case of  Craig Fisher, 23, formerly of  Escalante and the North Star  Expeditions program. Fisher is  currently serving a one-year term  in county for conviction of a third  degree felony relating to the  death of 16-year-old Aaron Bacon  in March 1994 while Fisher was  serving as his counselor in the  wilderness program..  Mclff had earlier announced  that he would review the sentence,  sen-tence, an act which typically  trumpets an early release in court  cases. However Mclff did not  free Fisher but noted as he returned  re-turned Fisher to jail for an  additional 25 days that he was in  a \"difficult position.\" A letter  from Bob and Sally Bacon,  parents of the dead youth, had  asked the judge not to release  Fisher.  Garfield County Attorney  Wallace Lee told the court that  he \"concurred with the request of  the Bacons not to allow an early  release for Mr. Fisher.\" Lee  stressed that although Fisher had  been a good worker and inmate  that he had served only one-third  of the sentence handed down. He  said that \"on behalf of the state  he would oppose the defendant's  early release today.\"  An emotional Fisher was escorted  es-corted back to jail with instructions  instruc-tions to prepare another book  report for the judge. His attorney,  E. Kent Winward, was unsuccessful  unsuccess-ful in convincing the judge to  release him.  In other court actions, Ronnie  Davenport, 24, of Panguitch  accused of probation violations  appeared again without counsel.  Judge Mclff noted that Davenport  had not retained counsel throughout  through-out his previous appearances in  court. With both Lee and the  state requesting Davenport be  sent to prison, Mclff innsisted that  Davenport needed an attorney and  gave him until court set for Apr.  28 to obtain one.  Jamison Culley, 26, of  Holladay, was ccharged with five  counts in an incident on Apr. 5.  Culley was charged when, after  being stopped by Utah Highway  Patrol Trooper Gaylen Moore, he  allegedly put his car in gear and  sped off without headlights and  subsequently hit a deer. Culley  was represented by Attorney  Michael Sikora.  Lee told the court that a plea  agreement had been reached in  which Culley would plead guilty  to a single count of attempting to  elude a peace officer, a third  degree felony. The defendant  could serve 0-5 years in prison  andor a fine of $9,250 or both.  Judge Mclff accepted a guilty  plea as voluntary and referred  Culley to Adult Probation and  Parole for a pre-sentence report.  The case was set for May 29.  Shon Leavitt, 23, of  Escalante, presently serving a  sentence at the Utah State Prison,  made an initial appearance before  the court on a single charge of  theft by deception, a class A  misdemeanor. Leavitt had  apparently, while incarcerated,  befriended another inmate  offering to assist him secure a slot  in a drug treatment facility for the  sum of $500. Subsequent charges  were filed. The court appointed  Floyd Holm to represent Leavitt.  Lee told the court that a plea  agreement had been reached  under which Leavitt would plead  guilty to a single count of theft by  deception, a class A misdemeanor.  misdemean-or. Lee joined in a joint recommendation  recom-mendation for a one year sentence  sen-tence to run concurrently with his  present sentence. Leavitt will also  al-so make restitution to his victim.  Judge Mclff accepted the  guilty plea, sentencing Leavitt to  one year at the state prison and a  fine of $4,625.  The final case of the day was  a bail hearing for Carl Trotter, 36,  Panguitch who was arrested Apr.  2 for assault, a class B misdemeanor  misde-meanor and disorderly conduct,  an infraction. Lee had no objection  objec-tion to the appointment of a  public defender for Trotter. Upon  advice of counsel the defendant  entered a plea of not guilty and  was released on his own recognizance.  recogni-zance. The case was set for Apr.  28.", "articleTitle": "No Release for Fisher; Judge Sends Him Back to Jail for 25 More Days"}, {"id": 3457893, "paper": "Garfield County News", "type": "article", "date": "1997-04-10T00:00:00Z", "year": "1997", "month": "April", "day": "10", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/62/a0/62a0481b0baeac7a5e08c3cae06c35bbd67219ab.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/df/e6/dfe68662dab0313f2ec50e765aad979aa3d1a3b1.pdf", "page": 1, "parent": 3457924, "version": 1739885575499939840, "ocr": "Court Delays  Make Wilderness  Re-inventory  Unlikely In 1997  PANGUITCH A recent  decision in Tenth Circuit Court  virtually assures that Interior  Secretary Bruce Babbitt's attempts  at-tempts to resume the re-inventory  for wilderness in Utah will not go  forward in 1997.  The Department of the  Interior's efforts to expedite a  lawsuit were delayed by the  court's decision, and members of  the Utah Association Of Counties'  Wilderness Task Force which  includes Garfield County Commissioner  Com-missioner Maloy Dodds were  immediately notified.  On Apr. 2, the federal government  gov-ernment was attempting to expedite  expe-dite a briefing schedule but was  unsuccessful , according to a  memo sent to UAC by Connie  Brooks of C.E. Brooks & Associates,  Assoc-iates, P.C. of Denver, Colo.  After the case finally makes  its way through additional court  deadlines, oral arguments will  likely not take place until November  No-vember or December according to  Brooks. Such delays preclude the  Bureau of Land Management's resuming  re-suming any re-inventory this year,  Dodds said.", "articleTitle": "Court Delays Make Wilderness Re-Inventory Unlikely in 1997"}, {"id": 3457894, "paper": "Garfield County News", "type": "article", "date": "1997-04-10T00:00:00Z", "year": "1997", "month": "April", "day": "10", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/39/cd/39cd2a76d7bb2ae7c068c499ac10c639dbacf0ba.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/bc/d6/bcd6a40ff701a755e5ea05e20d9c0e37bb51bee2.pdf", "page": 1, "parent": 3457924, "version": 1739884022284156928, "ocr": "TylerOwens  Panguitch  Boniu Nelson  Panguitch  Marc Henrie April Johnson  Panguitch Bryce Valley  Four Named Winners At  Sterling Scholar Finals  Four Garfield County high  school students were winners at  the 19th Annual Southwest Utah  Sterling Scholar Competition held  Apr. 3 at Southern Utah University  Univer-sity in Cedar City.  PHS senior Tyler Owen, aon  of Gary and Cindy Owens of  Panguitch, captured first place in  Applied Technology.  Marc Henrie, son of Alan and  V,'  Jeannie Henrie of Panguitch, was  named runnner-up in Agricultural  science and Bonnie Nelson,  daughter of Gordon and Mirian  Nelson of Hatch, was named  runner-up in Visual Arts.  Bryce Valley High School's  April Johnson, daughter of Moyle  and Tracey Johnson of Tropic,  was named runnerup in General  Scholarship.", "articleTitle": "Four Named Winners at Sterling Scholar Finals"}, {"id": 3457895, "paper": "Garfield County News", "type": "page", "date": "1997-04-10T00:00:00Z", "year": "1997", "month": "April", "day": "10", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/10/75/10752f80acffb82247d4326d38c385f2f8f5f9c3.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/3b/9a/3b9a2e4ff52ee86df60c49197fd3d15e3339e76a.pdf", "page": 2, "parent": 3457924, "version": 1739890545718722565, "ocr": "TylerOwens  Panguitch  Boniu Nelson  Panguitch  Marc Henrie April Johnson  Panguitch Bryce Valley  Four Named Winners At  Sterling Scholar Finals  Four Garfield County high  school students were winners at  the 19th Annual Southwest Utah  Sterling Scholar Competition held  Apr. 3 at Southern Utah University  Univer-sity in Cedar City.  PHS senior Tyler Owen, aon  of Gary and Cindy Owens of  Panguitch, captured first place in  Applied Technology.  Marc Henrie, son of Alan and  V,'  Jeannie Henrie of Panguitch, was  named runnner-up in Agricultural  science and Bonnie Nelson,  daughter of Gordon and Mirian  Nelson of Hatch, was named  runner-up in Visual Arts.  Bryce Valley High School's  April Johnson, daughter of Moyle  and Tracey Johnson of Tropic,  was named runnerup in General  Scholarship.", "articleTitle": "Four Named Winners at Sterling Scholar Finals"}, {"id": 3457896, "paper": "Garfield County News", "type": "unclassified", "date": "1997-04-10T00:00:00Z", "year": "1997", "month": "April", "day": "10", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/9d/b8/9db8d30f37b4aa458d01b461eddf515f6c5bdd06.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/71/a8/71a868a22a412e5dfdceafd4e21ccfdb34ad4764.pdf", "page": 2, "parent": 3457924, "version": 1739891699576995843, "ocr": "2-A GARFIELD COUNTY NEWS Thursday. April 10. 1997", "articleTitle": "Four Named Winners at Sterling Scholar Finals"}, {"id": 3457897, "paper": "Garfield County News", "type": "article", "date": "1997-04-10T00:00:00Z", "year": "1997", "month": "April", "day": "10", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/4e/5b/4e5b87ace5c6ed72556bfc10c090e1df1044b11f.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/84/74/84741490122cdbdfb977491342aff5c85c466bcd.pdf", "page": 2, "parent": 3457924, "version": 1739891506299273216, "ocr": "Panguitch News  By Mamie Taloot  676-8084  Clem McEwen, who passed  away last week, returned home  from Dixie to rest among his ancestors  an-cestors and hometown friends in  the Panguitch Cemetery on  March 24. The McEwen 'and  Houston families were here from  Dixie and the many scattered  dwelling places of our Panguitch  natives. Our thoughts are with  Irene, Melanie, Clem and all the  family.  A missionary farewell was  held for Elder John Hulet in Panguitch  Pan-guitch Lds 3rd Ward Sacrament  meeting. Many family members  and friends in this area were here  to wish Elder Hulet well. Taking  part in the program were dad and  mom, Bishop Del and Annette  Hulet, Jackie Klein, Holly Hulet,  Tiffany Hulet, Paul Hulet, Mindy  Hulet, Michael Hulet, Scott Ole-son,  Ole-son, Lisa Arter, Annessa Olsen,  Margaret Wilder and Elder Hulet.  He will serve in the Mississippi  Jackson Mission.  The elementary school students  stu-dents had a lot of interesting exhibits  ex-hibits at their Science Fair last  week: an ant farm, volcanoes,  engines, etc. What an exciting  way to learn.  Glen and Bonnie Owens have  added a chuck wagon to their  interesting antique yard collection.  collec-tion. Drive by and see.  Don and Tony Stowell and  family, Caleb, Starly and Sarah,  of Portland spent several days  with momgrandma Merle Stowell.  Stow-ell. Grandson Shawn Stowell is  serving an LDS mission in Arkansas.  Arkan-sas. Kenny and Heather Allen, who  live over on the River Lane in the  Blaine Tebbs house, have a new  baby girl. Little Harleigh Ann  was born January 26 in Cedar  City. Big sister Sierra loves to  help care for her. Great-grandparents  Great-grandparents Sam and Lorraine  Allen are thrilled with her.  Natives Laine and Dorothy  Norton came from Brigham City  to spend time with daughter Joan  Norton and her foster daughter  Chrissy who is happy over a new  German shepherd puppy which  grandpa and grandma have to  oversee.  Earl and Evelyn Roe and  Beverly Crosby went to Bountiful  to the wedding of Dusty Roe, son  of Ken and Judy Tebbs Roe.  Elizabeth Foy just returned  from an eventful three-week trip  to visit her children Howard and  Pat Riggs Foy and family in  Ponca City, Okla.. Their son  Sterling received his Eagle Scout  badge and participated in a string  ensemble competition playing  cello. Their youngest son Alex  was baptized a member of the  LDS Church. Elizabeth returned  by way of Las Vegas and spent a  few days with daughter Caroline  and husband Will Robinson and  their family. They happened to  be presenting the program in LDS  Sacrament meeting in which they  all participated. On the way  home, Elizabeth stopped in St.  George for a couple of days and  visited with her sister Susan  Weage.  Alisha Orton Hatch went to  Salt Lake City for training at the  University of Utah. She spent  three days working in the rehabilitation  rehabili-tation center. Alta Orton went  along on the trip for company and  to visit daughters Judy Mann and  Joann Jones. Shana and Sonny  Orton are in Oklahoma, spending  Spring break with their mother  DebbieSirley.  LaMar Stoker called from  Boulder City, Nev. to tell us that  his mother-in-law Addie Talbot  was recovering from surgery and  will be undergoing chemotherapy.  She would like to hear from some  of her old friends. She was  thrilled once before when she was  mentioned in the \"Panguitch  News.\" LaMar is a son of the  late Herb Stokers. He is restoring  the old Miller cabin at Blue  Spring. Addie's address is: Addie  Ad-die Talbot, 1301 Yucca Street,  Boulder City, Nevada 89005. Her  (See Panguitch News On Page 4-A)  Panguitch News  From Page 2-A  grandkids are taking good care of  her.  This time feels about right to  give a bit of Panguitch history;  fifty years ago, World War II was  just ending. There were very few  men left in Panguitch between  the ages of 18 and 35. Most had  been in the Armed Services or  away working in \"war work\". As  they returned home, George and  Addie Talbot decided to build a  little cafe on the north end of  Panguitch called the \"Honky-Tonky\"  \"Honky-Tonky\" or as one elderly lady  Mary Jane Schow called it: the  \"Donkey-Donkey\". The owners  asked George's cousins fiddler  Alton Talbot and his brothers  Stan, Archie, cousins Orton Talbot  Tal-bot and Jay Talbot, Dell Cooper  and other shepherds and self-taught  self-taught musicians and singers to  come once a week to the cafe to  play for dancing and entertainment  entertain-ment for the newly starting tourist  trade. This was one of the precursors  precur-sors to todays western or country  bands. This lasted until a ranching  ranch-ing couple, Dewey and Eliza  Moore from TropicHenrieville  area bought the cafe to serve beef  from their herd to travelers. This  was the beginning of the Flying  M Restaurant. George and Addie  Talbot then build a small motel  and called it the Bryce Way  Lodge. The much bigger motel is  now owned by Jay and Charlotte  Clark. Addie, we think of you  often and wish you health and  happiness.  Brian Boshell, son of the Evan  Boshells of the Panguitch 1st  LDS Ward received his mission  call to Australia. Hugh Goulding  was baptized by his friend Kirk  Moore.  Fred and Esther Dagnal have  been recently baptized members  of the LDS Church in Panguitch  3rd Ward. The Ward Choir gave  a beautiful program on Easter  Sunday. Choir director was  Murietta Syrett, narrator Carl Gillette,  Gil-lette, reader; Carol Bunker, and  accompanist Fawn Gillette. Soloists  Solo-ists and a small group of singers  were Raymond Roundy, Barbara  Orton, Jerna Mitchell and Rachel  Keller, supported by the rest of  the talented choir.  The new son of Ray and Julie  Ross Richards was blessed and  named Kelton William Richards  by his grandfather Wayne Ross.  Little Elissa Kay Mullenoux  daughter of Sam and Angie Riggs  Mullenoux was blessed by her  grandfather Lee Mullenoux.  Other grandparents present were  Ron and Karletta Riggs. Ruth  Mitchell was presented with her  Gospel In Action Award. Brent  Roundy was called as a Sunday  School teacher.  Jay and Dudley Proctor celebrated  cele-brated her 80th birthday and  Easter by a trip to Mesquite and a  night in St. George.  Many visitors were here over  the Spring Break from college  and Easter holiday. Seen were  Gary and Terrie Jacobson of  Malad, Ida. visiting the Kay  Heywoods; Verda Tebb's kids, the  Angela Sheffer family from the  north and the Julia Ann Tebbs  Nichols family of McGill, Nev.  Clem and Geralyn Veater  McEwen and the Ronald Veaters  were with mom Marilyn Veater.  The Fran Henries, Val Churches  and Merle Princes had families  home plus many more we didn't  get down.  In talking with Verle Matthews  Mat-thews recently, we found he has  not been lying around recuperating  recuperat-ing from his many years as  County Agriculture Agent after  his retirement. Among his many  activities are trips to Roosevelt to  help his brother with farm work,  trips to the migratory bird refuge  to admire the thousands of birds  in their lovely spring mating  plumage, plus keeping up with  the Matthews kids all over the  state. Keeping up with the kids is  much easier than it used to be  since most of them are involved  in Verle' s hobby of short wave  radio. Even mom Elaine has her  license. What fun!  Paul and Lynda Henrie and  children Chelsey and Robert of  West Jordan spent Easter vacation  vaca-tion with Paul's mother, Shirley  Henrie.  Visiting with momgrandma  Norma Talbot at Easter time were  Tom and Maxine of Greenwich,  Brett and Michelle Talbot, Art  and Mary Talbot of Cedar City,  Roma and Hal Wilcock family  and Jimmy and Erika Wilcock  and baby, of Price.  Thanks to the volunteers who  helped clean up main and center  streets: many volunteers are  needed just to keep loose plastic  bags gathered up.", "articleTitle": "Panguitch News"}, {"id": 3457898, "paper": "Garfield County News", "type": "unclassified", "date": "1997-04-10T00:00:00Z", "year": "1997", "month": "April", "day": "10", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/40/3a/403a5fd7d8211ad7d7720ec37cd044ff3088af10.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/13/d1/13d15cfd9972ab0240bf7513513b14ff5e924f36.pdf", "page": 2, "parent": 3457924, "version": 1739889150906073088, "ocr": "GARFIELD COUNTY NEWS  ProductionManagementSubscriptionsMailing  120 North Main Street  P.O. Box 127  Tropic, Utah 84776-0127  801-679-8730 Fax: 801-679-8847  Garfield County News (ISSN: 1064-7309) is published each  Thursday in Tropic, Utah 84776 for $22 a year in Garfield  County and $27 out of Garfield County by the Garfield  County News, 120 North Main, Tropic, Utah 84776.  Periodical postage paid at Tropic, Utah 84776. POSTMASTER:  Send address changes to Garfield County News, P.O. Box  127, Tropic, Utah 84776.  Single Copy70C  Katie Thomas, Publisher Nancy Twitchell, Editor  Debbie Urpani, Layout Rebecca Bales, Computer  Deadline for wedding and missionary announcements, columns and regular news articles: 5  p.m., Friday. Copy submitted after deadline may not be used until the following week's  publication. Deadline for classified ads, display ads, and legals: 5 p.m., Monday.", "articleTitle": "Panguitch News"}, {"id": 3457899, "paper": "Garfield County News", "type": "article", "date": "1997-04-10T00:00:00Z", "year": "1997", "month": "April", "day": "10", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/fe/c1/fec16da723e4abcefbbeb15926342f2023bf670a.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/8f/6d/8f6de1cb1acc44b36a66de8d7a0cf0940a3287c5.pdf", "page": 2, "parent": 3457924, "version": 1739891715180855296, "ocr": "Escalante News  By Mariene Haws  826-4859  Donna Brian, Loa and Peggy  Palmer, Tropic stopped by to see  Beth Hunt while they were in  town on Wednesday. They, with  their husbands, Harry Brian, Bart  Palmer and Terry Hunt all met in  Tropic that evening for dinner.  Mariene Haws was pleasantly  surprised last week by a visit from  t Donna Lamborn, Kemmerer,  Wyo. The two were roommates  at Brigham Young University,  more years ago than either of  them cared to remember!  All the children of Chase and  Helen Shurtz came home again  for the funeral of their father,  Chase. David Ray and Bonnie  Shurtz, Troy Michigan; Ron and  Annette Hlavac, Costa Mesa,  Calif.; Gary and Marian Mills,  Portland, Ore.; Dennis and Sara  Cowles, Casper, Wyo. and Dale  and Susan Wilson, Escalante.  Also here were Chase's two sisters,  sis-ters, a brother and two spouses:  Steve and Vivian Collard and  Park and LoRee Shurtz all of  Bountiful and Blake and Betty  Schow, Salt Lake City. Also here  were Voyle and Lillian Munson,  Bountiful, Carlyle and Randy  Shurtz, Sandy and Thora and Milan  Mi-lan Roundy, Cedar City and quite  a number of people with whom  Chase worked in the St. George  LDS Temple. Here from Helen's  side of the family were Keith and  Afton Zobell, Spanish Fork; Susie  Zobell and Brenda Turner, Sandy;  Ferris and Jordan Clegg, Richfield;  Rich-field; Leslie and Alma Ruth  Boyce, Leavenworth, Wash.  Visiting at the home of Betty  R. Alvey were Ferrell Roundy,  Taft, Calif.; Quinn Roundy, Bak-  ersfield, Caht.; and Paul Michael  Cardon and Leo Hayes, both of  St. George. Ferrell had visited  with Bernard and Freeda Schow  in Las Vegas, Nev. and reports  that they are doing well. After  getting their exercise here (from  climbing the Grand Staircase)  Paul Michael and Leo returned to  St. George and Ferrell and Quinn  continued up North to visit Ferrell  and Freeda Mooseman in Anna-bella;  Anna-bella; and Ferrell's daughter, Kara  Lynn Roundy and Vivian Roundy,  both of Salt Lake City.  Seventeen-year-old Brandon  Haws, son of Jon and Jillyn  Sorensen, Salina and grandson of  Klyn and Mariene Haws; great-grandson  great-grandson of Starns and Fon  Mecham and Elda Haws, Escalante,  Esca-lante, has earned a place as one  of \"Today's Heroes\", according to  the Sevier Valley Volunteer and  RSVP Center in Richfield. Brandon  Bran-don has given more than 7,000  hours of voluntary community  service the past six years and has  worked to help promote drug, violence  vio-lence and alcohol rehabilitation  programs. He has also been a  member of youth city council,  attended volunteer fire department  depart-ment meetings, city council  meetings and received permission  to ride with city and county law  enforcement officers. After completing  com-pleting his education he would  like to become a highway patrolman.  patrol-man. Kevin Schulkoski took his  daughter, Andrea, to visit his parents  par-ents in North Dakota.  Stan and Jan Liston are home  from St. George so you will begin  to see little green things sprouting  around their yard before long!  Clea Woolsey is back home  from Lehi where she spent some  time with her son, Robert Woolsey,  Wool-sey, after he had surgery on his  neck.  Haynes and Iola Woolsey are  home after Iola's long stay in the  hospital in Provo. Haynes stayed  with his brother and sister-in-law,  Hal and Lasca Woolsey in Salt  Lake. He also had more eye surgery.  sur-gery. Both seem to be doing a lot  better now.  Darrell and Dana Alvey  brought their family from Cedar  City to spend daughter, Lisa's,  birthday with Grandma, Rolain  Alvey. The families of Tyler Lyman,  Ly-man, Dqnnie Porter and Faye  (See Escalante News On Page 4-A)  Escalante News  From Page 2-A  Lyman joined in to help celebrate.  cele-brate. Loreta Spencer will be having  a cataract removed from her eye  this week, in St. George.  Jody Brooks and Velma Boulter  Boul-ter spent the weekend in Mesa,  Ariz.  April Fool's day played a nice  joke on us for three days with a  lovely snow storm that contained  1.11 inches of moisture. As near  as our weatherman, Sharon Dale  Marsh, could measure there waas  13 inches, maybe more, if it hadn't  had-n't been so wet, settled so quickly  and been so hard to measure  Many people were in the area  for the Easter weekend. After all  this storm, the desert shold have  blossomed like a rose, but maybe  all the roses are trampled out  now!  Sandie Hitchcock is now, officially,  offi-cially, our Chief of Police and  Ryan Horton, Circleville, who  will be our new peace officer will  be moving his wife and baby here  to live.  Orilla Cowles has had some of  her children here, off and on, for  the past three weeks. Wells and  Emma Lou Mclnelly have gone  back home to Ellensburg, Wash.  Glen and Colleen Imlay stopped  off on their way home to Evan-ston,  Evan-ston, Wyo., after being in Arizona  and Mexico all winter and Alvin  and Joan Cowles, Richfield  dropped in on Thursday, last week  to check on her. Orilla even went  up on the 50 mile bench with her  family on Easter weekend.  Edna Andreg, Green River,  visited here with her brother,  James Mclnelly and sister-in-law,  Twila Mclnelly.  Ben Porter got his income tax  done early, in Provo, and moved  Renee back early for the summer.  April Fool, Renee!  Sox Spencer spent a couple of  days in Garfield Memorial hospital,  hospi-tal, in Panguitch, but is back  home again and feeling better.  Frank and Kathryn Coleman  went to St. George, where Frank,  went into the hospital for surgery.  Daughter Deanne says he is making  mak-ing good progress.  Parents of our sterling scholar  students accompanied them to  Cedar City last Thursday. They  are Justin Marsh, Curtis Mclnelly,  Ben Carter and Rebecca Fischer,  who lives in Boulder. Congratulations  Congratula-tions to them!  Aaron and Michelle Johnson,  Cedar City visited here with Michelle's  Mi-chelle's parents, Robert and  Louise Liston and grandparents.  (See Escalante News on Page 5-A)  5-A) i  Escalante News  From Page 4-A  Neal and Alberta Liston. Also !  visiting Neal and Alberta were  granddaughter, Cozan Latoski and  husband Lonnie and family and  Lonnie's mother Joan Latoski,  Colorado.  Nelda and Blaine Willis were  visiting Lowell and Dorothy Willis  Wil-lis in Lindon, when Nelda fell and  broke her elbow. She stayed with  Lowell and Blaine came on home  to take care of things here.  Condolences to the Griffin,  Spencer and Olsen families in the  loss of their two loved ones.  Tamara Olsen and her 14 month  old son, Griffin.  Vernon and Peggy Roundy  were in town over the weekend,  as were Steve and Cheryl Cox  and family, who stopped by tc  visit them after spending the  weekend at their summer home in  Boulder.  Jerry Taylor brought his family  to spend the weekend at the home  of his parents, Arden and Mae  Von Taylor. Jerry lives in Salt  Lake City. Eva Dean Liston went  back with them, as far as Maple-ton.  Maple-ton. Ray and Lois Barney came  I  (from Kaysville to spend the  .weekend with Elda Haws,  i f  g Arnold and Deon Alvey went  ye Las Vegas, Nevada to be with  the families of Dave and Raylene  Whitefield and Andy and Denise  Dube for Easter.  Klyn and Marlene Haws had  the family of Jon and Jillyn  Sorensen, of Salina visiting.  Harriet Priska went to Salt  cake City for a meeting of the  'daughters of the American Revolution,  Revo-lution, flew to Pacifica, Calif, to  spend Easter with family mem-  b'ers and flew back to Las Vegas,  ' Nev. where Philip picked her up)  \" Fay Alvey had Anthony and  ! Dot Coombs and daughters here  over the weekend. The Coomb-  \" s'es also stayed at their home in  Boulder for a few days before  returning to Manila.  1 Michelle Roundy, Palmdale,  Calif., brought her children to  visit their grandparents, Jerry and  ( Sherree Roundy and Betty R.  Alvey.  I Danny Spencer took his wife,  Lois, his mother LaRue Spencer  and Garneal Smith to Mesquite,  Nev. and left them to visit with  family members while he flew to  Nashville, Tenn. for telephone  meetings.", "articleTitle": "Escalante News"}, {"id": 3457900, "paper": "Garfield County News", "type": "advertisement", "date": "1997-04-10T00:00:00Z", "year": "1997", "month": "April", "day": "10", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/4a/68/4a68e5974c8f30365744bbe020f1d16c41af29f0.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/65/20/65201629d0babf71d6adef349bfe3103a3c7c3b3.pdf", "page": 2, "parent": 3457924, "version": 1739886028679806976, "ocr": "new beginning I  Baptist Church  585 East 50 North  Panguitch  Sunday  Bible Study - 9:45 a.m.  Worship -11 a.m.  Wednesday  Bible StudyPrayer - 7 p.m. :  David Payne -Pastor  j Everyone Welcome  Card Of Thanks  Special thanks to  John and Marie  Niemann  for the  dedicated help  they gave to make the  6th Grade  Invitational Basketball  Tournament  at Bryce Valley  such a rousing successl  Escalante  BAPTIST CHURCH  Community Center  I Sunday School 10 a.m.  I Morning Service 1 1 a.m.  I Evening Service 7:30 p.m. I  Wednesday 7:30 p.m.  Pastor James Daggit  826-4915 J  S i Open 7 Days A Week 7 a.m. -10 p.m.  Breakfast Lunch Dinner  ; ' I Relax & See N I GREAT  All The Games On ft J FOOD j  Our New Big Screen TV! j  We Are In Good Standing !  With The DABC! PRICES  Now Taking Applications For Cooks,  f Waitresses, Bussers & Diswashers  j All Shifts Available! I  tAt Pink Cliffs Village Bryce, Utah  Meet Our Texas Imports Gino & Diane! H  Call 801-834-5300 J,  OR SALE  1991  CHEVY  CAMARO  Loaded  CD Good Tires  $5,000  Or Best Offer  See Rod Syrett  Ruby's Inn  801-834-5245  v  j Card Of Thanks  Our hats off and our  ! sincere thanks go to those :  ! in nearby communities who  I supported local 6th grade !  teams and who gave of  j their money, time, energy  and cheers to make the I  Bryce Valley 6th grade  basketball tournament  such a success.  John & Marie Niemann j  Printing Is Our  Specialty  679-8730  Catholic Church  MASS  10 A.M.  SATURDAYS  955 S. Main Panguitch  j DO YOU HEEE j  LETTERHEADS ?j  I.I801)S7?:8730j", "articleTitle": "Escalante News"}, {"id": 3457901, "paper": "Garfield County News", "type": "article", "date": "1997-04-10T00:00:00Z", "year": "1997", "month": "April", "day": "10", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/59/51/59518c35f7de5232dfbdde05ffcf65d3e2c19537.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/13/6b/136b9e0f4f614a89c8752d35fa91628da51e0f5a.pdf", "page": 2, "parent": 3457924, "version": 1739889183898468354, "ocr": "Antimony News  By Betty Wiley  624-3215  These warm days have the water  wa-ter running again. Dry Wash has  started to run but some of the low  snow up in John's Valley has  melted and stopped running.  Wind and now snow! What a  way to meet April, but it could be  much worse here. We have had  wind but nothing violent like  those areas up north.  The Hal Jensens spent Easter  weekend with their children and  grandchildren in Capitol Reef and  Lake Powell.  The \"Rockin R\" was really  jumping during the weekend as  all of the Burns Black family  were home except Shauna and  her husband and family who are  stationed in Alaska. They had all  daughters and sons with their husbands  hus-bands and wives, all grandchildren  grandchil-dren and extended families. Diana  Di-ana and Glen Weeks brought his  mother here for the weekend.  Such good times for families to  get together and enjoy each other.  The first trailers are starting to  come for the summer here and  lets hope the fishing is good this  year for all vacationers.  The Eric Jolleys of West Valley  Val-ley spent the weekend with his  parents, the Ted Jolleys.  Gregg and Cynthia Black had  their new baby girl blessed and  named on Easter Sunday in LDS  Sacrament meeting. , She was  given the name of Hailee Mona  Black by her father.  Spending Easter weekend here  with his two brothers, Ted and  George Jolley was Kay Jolley.  Lynn Kendall was sustained as  2nd Councilor of the Priesthood  Group in LDS Sacrament meeting.  meet-ing. The 5th and 6th graders from  Antimony Elementary School  attended a basketball tournament  in Tropic and Jourdan Montague  was named to the alternative  team.  Corlas Montague has been ill  with pneumonia but is starting to  feel some better.  Gayle Ipson has been home for  the spring break from her teaching  job in Arizona.  Jane and Bill Wiley had the  Chris Petersons, the Van Wileys  and Bree Fullmer for dinner after  church on Sunday. Their son Jeremy  Jer-emy was home for the weekend  from St. George where he attends  Dixie College. Bree has transferred  trans-ferred from up north to Southern  Utah University in Cedar City.  Judy Fielding's parents, Ed  and Jean Boss of Eagle River,  Alaska, stopped by for a few days  on their way back home.", "articleTitle": "Antimony News"}, {"id": 3457902, "paper": "Garfield County News", "type": "article", "date": "1997-04-10T00:00:00Z", "year": "1997", "month": "April", "day": "10", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/03/60/0360dd05c49964f18905a1f4a98505aaef5e906f.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/fa/cb/facbe1bab4fa72cba8092d8f4341d029c140ada3.pdf", "page": 2, "parent": 3457924, "version": 1739883343777890305, "ocr": "w  Elder Garrett Cottam  Cottam Will Serve  Zimbabwe Mission  ESCALANTE Elder Garrett  Doyle Cottam has been called to  serve an LDS mission in the  Zimbabwe Harare Mission.  A farewell will be held at the  Escalante LDS Stake Center on  Sunday, Apr. 13 at 12:50 p.m. He  will enter the Missionary Training  Center on Apr. 23.  Elder Cottam graduated in  1996 from Escalante High School  where he was active in basketball,  basket-ball, He was nominated to the  All-State team and was a Sterling  Scholar candidate. He has also  earned his Eagle Scout and his  Duty To God award  Cottam is a son of Myron and  Sanette Cottam and a grandson of  Doyle and Thelma Cottam, all of  Escalante and Patricia and the  late F. Widtsoe Checketts.", "articleTitle": "Cottam Will Serve Zimbabwe Mission"}, {"id": 3457903, "paper": "Garfield County News", "type": "article", "date": "1997-04-10T00:00:00Z", "year": "1997", "month": "April", "day": "10", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/e3/3c/e33c7d997ae5b89860c83749bf3fb620c2a1ea77.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/cc/33/cc3357b9fcca81977430fe1a26f9aaa8c24faec6.pdf", "page": 2, "parent": 3457924, "version": 1739892430670397441, "ocr": "SidwellBarney  ESCALANTE Joe Sidwell  and Tricia Barney were married  Friday, April 4, 1997 in  Escalante.  The bride is a daughter of  Geraald and Carol Baarney. She  graduated from Escalante High  School in 1993.  The bridegroom is a son of  Mary Lynn Scott and the late  Richard Sidwell. He graduaated  from Escalante High School in  1986.  The couple will make their  home in Escalante.", "articleTitle": "Sidwell/Barney"}, {"id": 3457904, "paper": "Garfield County News", "type": "article", "date": "1997-04-10T00:00:00Z", "year": "1997", "month": "April", "day": "10", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/f2/6c/f26ca2b386b9c2b694867f0c4df2098d7abb011d.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/f7/45/f745dc9024da5b77e69fbbfd7e9852303b34b23c.pdf", "page": 2, "parent": 3457924, "version": 1739894980775772161, "ocr": "Tropic News  By Louise Ott  679-8776  Wallace Ott had a doctor's  appointment in Cedar City and  Mary Ott had one with her heart  doctor in St. George. Their  daughter Marilyn Murdock has  been here visiting.  Twyla, Dewey Hansen and  four children from Salt Lake City  visited with Dixie Shakespear.  Also visiting with her were  Janette Coleman and son Verl  from Orderville. Janette is Louie  Shakespear's daughter.  Steve Littlefield stayed with  his mother Sara Littlefield one  night, helped her getting the  things done that needed done this  time of year, fixing lawn  sprinkler-heads etc.  Bruce Campbell visited with  his parents Elwood and Coleen  Campbell. Elwood had surgery  recently in Panguitch. He is  home where he is improving each  day. Sherry and Rachel Pollock  visited over Easter with DeVar  and Faye Pollock at Larvin and  Eva Pollocks' were son and  daughter-in-law Bill and Stacey  Pollock from Delta and daughter  afjil son-in-law Marian and Blake  Allen from Orem. They all went  to Rock Springs Bench to enjoy  their time together.  Janet Pollock along with  Gayle Lynn, Marie and family,  Joe and Anita Pollock and family,  Jacki Kincaid, Leo and Jeanne  Chynoweth and family from  Henrieville got together and had a  nice Easter picnic.  Givonna Sudweeks had all  three of her daughters and their  families, they went over by the  (See Tropic. News On Page 4-A)  Tropic News  From Page 2-A  fish hatchery for a get-together for  their annual Easter picnic.  News from the Kent and Betty  Wintch home, is that their  daughter Charlene and Edward  Higuera, were remarried on  March 25 in Orem. Edward  retired on March 31 after more  than 30 years with Chevron Oil.  The couple will reside in Orem  for the present to be near their  children, but hope to eventually  build on their own land here in  Tropic.  Keela Mangum, along with  her mother Iris Bushnell, flew to  Alabama, where they stayed with  cousins Sabina and Donald  Redding. They took in a lot of  the sights and brought Doris Lyles  home for the summer. Keela then  re-packed her bags and she and  Florence Syrett took off for Salt  Lake City to catch another plane  to go to Baltimore, then on to  Gettysburg to attend the Quilter  Hertiage convention. Hope the  weather cooperated with them  while they were gone. It sure  turned back to winter for several  days here but needed the storm.  Just two inches down, the ground  was very dry. Tthis nice snow  storm, followed by rain, soaked  into the ground and really helped,  but, sadly, the blossoms on the  apricot trees were frozen.  Ferriland and Orlan Ruesch  were in Cedar City for doctor  appointments when those high  winds were so bad in Cedar City.  They were mighty thankful to be  home safe.  Fred Hall from-Ogden visited  sister-in law Minnie Nielson and  daughter Marie Niemann over  Easter.  JoNiel Alvey had surgery on  her hand. She is staying with her  parents Russell and Beverly  Wright in Hurricane. Grandparents  Grandpar-ents Royal and Rella Alvey are  helping Kerry and Ryan while  their mother is recuperating.  Rachel and Earl Jolley are in  St. George with Helen and Dar  Smith.  Clare and Mary Lee Ramsay  have been to Kanab helping  daughter Brenda and husband  Dennis on their new home they  are building. Brenda's brother  Martin Ramsay has been a big  help, too.", "articleTitle": "Tropic News"}, {"id": 3457905, "paper": "Garfield County News", "type": "article", "date": "1997-04-10T00:00:00Z", "year": "1997", "month": "April", "day": "10", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/f1/02/f1028588f5d3ec65b2cd2b8c1a13200616609ff5.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/52/eb/52eb5c70ed4769f0882df02b490998ace7797d47.pdf", "page": 2, "parent": 3457924, "version": 1739890978957819907, "ocr": "Elder Slate Stewart  Slate Stewart To  Ecuador Mission  TROPIC Elder Slate Reg  Stewart has been called to serve  an LDS Spanish-speaking mission  to the Ecuador Guayaquil South  Mission.  A farewell in his honor will be  held at the Tropic LDS Ward  Sacra-ment meeting on Apr. 13 at  11:50 a.m.  Elder Stewart will enter the  Missionary Training Center on  Apr. 16.  Stewart graduated from Bryce  Valley High School in 1996,  where he was active in basketball  and served as student body  president. He also graduated from  LDS seminary.  Elder Stewart is a son of Max  and Phyllis Stewart of Tropic and  the grandson of Leona and the  late Reg Stewart, also of Tropic  and Floyd and Colleen Tucker of  St. George.", "articleTitle": "State Stewart to Ecuador Mission"}, {"id": 3457906, "paper": "Garfield County News", "type": "article", "date": "1997-04-10T00:00:00Z", "year": "1997", "month": "April", "day": "10", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/5a/8b/5a8b57730e26d43482cdac8af73c90c61c57b9a6.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/64/9f/649f2d10ecb871d7a1084a119f9c0a11f3bf0388.pdf", "page": 2, "parent": 3457924, "version": 1739886137704448000, "ocr": "Commissioners  Address Issues  PANGUITCH All three  county commissioners Louise  Liston, Clare Ramsay and Maloy  Dodds were present for the regular  Mar. 10. meeting where the  following actions took place:  County Engineer Brian  Bremner was first on the docket.  Following review, the commission  commis-sion adopted the Surplus Property  Resolution allowing Bremner, the  commissioners and Chris Hatch,  representing Emergency Management,  Manage-ment, to purchase from the State  Surplus System.  Bremner informed the commission  com-mission that he had advertised  and received bids for the purchase  and removal of the shed at the old  dead animal pit. Three bids were  received of $203, $350 and  $503.39. The higher bid of  $503.39 from Tom Simkins was  accepted. Bremner stated that  once the shed was removed, the  pit could be closed completely.  The bid for supply of a building  build-ing for the Bryce Valley County  Road Shed will be readvertised.  Danny Perkins of Panguitch  came before the commission to  discuss the impact of increased  traffic on the River Lane Road  near his farm. Apparently the  dust from the gravel road is  affecting the quality of his hay  crop", "articleTitle": "Commissioners Address Issues"}, {"id": 3457907, "paper": "Garfield County News", "type": "article", "date": "1997-04-10T00:00:00Z", "year": "1997", "month": "April", "day": "10", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/5d/75/5d750c6fc571d14a58f5545bc5b4defa5374a102.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/05/cb/05cbf4392437a281236a90af9fbf24dea9af0297.pdf", "page": 2, "parent": 3457924, "version": 1739888834310569984, "ocr": "v , 'fat ' 4 '  Elder Colin Clark  Clark To Serve In  Colombia Mission  CEDAR CITY Elder Colin  Clark has received an LDS  mission call to service in the  Colombia Barranquilla mission.  A farewell in his honor will be  held on Sunday, Apr. 13 at 9 a.m.  at the Cedar West Stake Center,  725 South 1 100 West, Cedar City.  Elder Clark is a son of J.  Arthur and Margaret Clark,  formerly of Panguitch and a  grandson of Cleo Miller Clark of  Panguitch.  Paid Advertisement", "articleTitle": "Clark to Serve in Colombia Mission"}, {"id": 3457908, "paper": "Garfield County News", "type": "article", "date": "1997-04-10T00:00:00Z", "year": "1997", "month": "April", "day": "10", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/29/d3/29d370fb3f8a3303905fb88a027d23f2c683d390.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/73/e2/73e24a450f75210adbfb11881c2a6b2c45a6770d.pdf", "page": 2, "parent": 3457924, "version": 1739884595695845383, "ocr": "Elder Travis Christy  Christy Returns  From Portland  PANGUITCH Elder Travis  Christy has returned from serving  his LDS mission in the Portland  Oregon Mission.  He will be reporting his  mission in Panguitch LDS 1st  Ward Sacrament meeting on  Suday, Apr. 20.  Elder Christy is a son of Mary  Jane and the late Dr. William  Christy of Panguitch. He plans to  attend college in the fall.", "articleTitle": "Christy Returns from Portland"}, {"id": 3457909, "paper": "Garfield County News", "type": "page", "date": "1997-04-10T00:00:00Z", "year": "1997", "month": "April", "day": "10", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/ba/70/ba700c5d8c9f43acd764f91d280152b3634a8590.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/ac/34/ac34cfa88c0880ea74ee27096312d70988f427be.pdf", "page": 3, "parent": 3457924, "version": 1739893437580181506, "ocr": "Elder Travis Christy  Christy Returns  From Portland  PANGUITCH Elder Travis  Christy has returned from serving  his LDS mission in the Portland  Oregon Mission.  He will be reporting his  mission in Panguitch LDS 1st  Ward Sacrament meeting on  Suday, Apr. 20.  Elder Christy is a son of Mary  Jane and the late Dr. William  Christy of Panguitch. He plans to  attend college in the fall.", "articleTitle": "Christy Returns from Portland"}, {"id": 3457910, "paper": "Garfield County News", "type": "advertisement", "date": "1997-04-10T00:00:00Z", "year": "1997", "month": "April", "day": "10", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/9e/ee/9eeef817832485c16136d4455b3e442cf0a1cc14.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/a7/4d/a74d77af5b93bf6b3fbd80518c70dedcb17d49d5.pdf", "page": 3, "parent": 3457924, "version": 1739888352069419011, "ocr": "As for my people,  children are their  oppressors, and  women rule over them  O my people, they  which lead thee cause  thee to err, and destroy  the way of thy paths.  Isaiah 3:12  West Panguitch  Irrigation & Reservoir Company !  ; PUBLIC NOTICE j  1 NOTICE: There is delinquent upon the following !  . described stock of the West Panguitch Irrigation &  Reservoir Company, on account of assessment i  ! levied on the 1 0th day of October, 1 996, the amount  J set opposite the name of stockholder as follows: i  J CERTIFICATE NUMBER OF AMOUNT '  NAME NUMBER SHARES DUE  WardL Moore 2565 3 $17.75 i  ; and in accordance with law so many shares, or parts i  of a share, of such stock as may be necessary will  ; be sold at the front of the Panguitch City OfficeLibrary  building on the 18th day of April, 1997, at the hour  J of 10:00 a.m., to pay the delinquent assessment  thereon, together with the cost of advertising and  J the expense of the sale. 1  J. Merle Prince !  ! Secretary-Treasurer j  -:..  PANGUITCH DENTAL .  would like to thank our patrons  for their patience with long waiting  times for appointments.  We are pleased to announce that  David G. Lee, D.D.S.  has now joined the practice full time! '  Our new hours are  Monday thru Friday '  8 a.m. until 6 p.m. and i  Saturdays 8 a.m. until 1 p.m.  I We hope this will decrease  waiting time considerably.  We appreciate your patronage and  look forward to providing for your  dental care needs.  I April 15, 1997 6 p.m. I j  j Bryce Valley High School j  ! j  i Henrie's Drive-In i  Main St. - Panguitch  i Apr. 14, 15,16 -Chubby Cheese, SmFrench 1  Fries, Med. Drink - $3.50  ! I Apr. 21, 22, 23 - Burrito With Cheese - $1.10 j '  Apr. 28, 29 30 -Chubby Cheese -$2.00  I Mon. - Sat.  I -10 a.m. - 10 p.m  501-676-2731  N ;  Introducing the  NEW GOLD CD  AND ITS RATHER Large  ANNUAL PERCENTAGE YIELD.  Shown here actual size.  The Gold CD is just the latest reason to be glad you're a Gold Account customer.  But don't feel excluded if you're not - just come in and sign up for. both. You'll be glad  you did. The Gold CD\" gives you the kind of yield Gold Account customers  have come to expect from their investments. Onl3' the best. Just stop by your $  local Zions.'Bank branch or call 1-800-789-2265 before April 30, 1997, to sign up.  www.zioiwbank.coin  ZIONS BANK  Member FDIC  \"With a Gold Account, you'll receive the following Financial services: better rates on loans, higher rates on savings, special  CI) rates, Free perconal checks, firee safety deposit box, banUcard with no annual fee (credit approval required), Free on-line banking and bill pay  services, 10 savings on discounj, brokerage fees, no fee travelers checks, free money orders, Free official checks, and Free accidental death insurance.  \"The Gold CD requires a $2,500.minimum deposit. Substantial penalty For early withdraw!.", "articleTitle": "Christy Returns from Portland"}, {"id": 3457911, "paper": "Garfield County News", "type": "unclassified", "date": "1997-04-10T00:00:00Z", "year": "1997", "month": "April", "day": "10", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/90/b1/90b16f8230a76dfdf7575911c976e270745beae5.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/04/cf/04cf5064d24f9b24d39f4f26a576dd325bb97ef2.pdf", "page": 3, "parent": 3457924, "version": 1739888716247203840, "ocr": "Thursday. April in. 1997 GARFIELD COUNTY NEWS 3-A", "articleTitle": "Christy Returns from Portland"}, {"id": 3457912, "paper": "Garfield County News", "type": "article", "date": "1997-04-10T00:00:00Z", "year": "1997", "month": "April", "day": "10", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/f7/64/f764773879080561156dc7a134192b9ed669cb9b.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/06/79/06797b72fdf8803676ac1e6d9bc9cda3f8d8cc0f.pdf", "page": 3, "parent": 3457924, "version": 1739888623703031811, "ocr": "Fire Safety  From Page 2-A  and a container of water should  be kept nearby. When lighting the  grill, stay with it and keep  children and pets away from the  area.  Barbecue grills should never  be brought inside the house, tent,  or recreational vehicle, because  of the danger of carbon monoxide  poisoning in addition to the fire  hazard. When lighting a grill,  Wise says, the safest fire starters  are chemicals in cake form or a  charcoal electric starter.", "articleTitle": "Fire Safety"}, {"id": 3457913, "paper": "Garfield County News", "type": "page", "date": "1997-04-10T00:00:00Z", "year": "1997", "month": "April", "day": "10", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/48/f4/48f42650ceaa62ec1515fd85fa17916a87508fe4.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/db/9c/db9cfde3aca71a33ac2eaabfb373ec824c937f9d.pdf", "page": 4, "parent": 3457924, "version": 1739884878129790976, "ocr": "Fire Safety  From Page 2-A  and a container of water should  be kept nearby. When lighting the  grill, stay with it and keep  children and pets away from the  area.  Barbecue grills should never  be brought inside the house, tent,  or recreational vehicle, because  of the danger of carbon monoxide  poisoning in addition to the fire  hazard. When lighting a grill,  Wise says, the safest fire starters  are chemicals in cake form or a  charcoal electric starter.", "articleTitle": "Fire Safety"}, {"id": 3457914, "paper": "Garfield County News", "type": "unclassified", "date": "1997-04-10T00:00:00Z", "year": "1997", "month": "April", "day": "10", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/12/90/1290ee4b232537f74602087ef2c22e1784db3bee.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/f3/b0/f3b02ef1962e0e1e143ec4deb9d9dbc27ccab703.pdf", "page": 4, "parent": 3457924, "version": 1739895080193359872, "ocr": "4-A GARFIELD COUNTY NEWS Thursday. April X). 1997", "articleTitle": "Fire Safety"}, {"id": 3457915, "paper": "Garfield County News", "type": "advertisement", "date": "1997-04-10T00:00:00Z", "year": "1997", "month": "April", "day": "10", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/18/b8/18b8112a24ba29442bbf2badb9acf62b53687f36.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/18/f8/18f8b91834a057e0a8eaa68968b92b17801bc9f6.pdf", "page": 4, "parent": 3457924, "version": 1739889546045161472, "ocr": "FOR FAST ACTION, PLACE  YOUR CLASSIFIED AD IN  THE GARFIELD COUNTY  NEWS -- Up To 20 Words, Only  $4; 20 Cents A Word Thereafter.  Send Your Ad & Your Check To  P.O. Box 127, Tropic, Utah  84776, Or Call 679-8730 By 5  P.M. Mondays.  OR  PLACE YOUR CLASSIFIED  AD IN NOT 1, NOT 2, BUT 43  NEWSPAPERS THROUGHOUT  THROUGH-OUT UTAH. One Placement,  One Payment, Puts You Into The  \"Utah Classified Ad Network\".  Reach Over 403,415 Utahns For  Only $120. Call The Garfield  County News At 679-8730 For  Further Information.  ABORTION? WHY? CONSIDER  Adoption? Warm Secure Loving  LDS Home Available For A  Newborn Baby. Please Call Attorney  At-torney At 1-800-606-441 1. A607.  (ucan)  ALL STEEL BUILDINGS. ARCH  Buildings- 40x30 $2,995. 40x50  $4,995. 50x100 $9,650.  Straightwall Buildings Also  Available. 1-800-973-3366.  (ucan)  STEEL \"HI-RIB\" SHEETS FOR  Building Sheds, Barns, Etc. Low  Prices, Great Stock Galvanized  And Colored. Call For  StockPrice List. Palmer's  Metalmart 1200 E 100 S Lehi. 1-800-947-0249.  (ucan)  FRIENDLY TOYS & GIFTS HAS  Immediate Openings In Your  Area. Number One In Party Plan:  Toys, Gifts, Christmas, Home  Decor, Free Catalog And Information.  Informa-tion. 1-800-488-4875. (ucan)  QUILTING BUSINESS FOR Sale.  Includes 14 Ft. Commercial Quilting  Quilt-ing Machine, 4' X 6' Lighted  Marking Table, Patterns, Guides,  Material, Fabric Books, Like  New, $22,000. Includes Setup.  Judy 801-896-8312, Richfield.  (ucan)  BECOME A MEDICAL TRAN-SCRIPTIONIST.  TRAN-SCRIPTIONIST. Opportunity To  Work At Home Or In Office Typing  Typ-ing For Doctors. Home Study.  Free Literature. P.C.D.I., Atlanta,  Georgia. 800-362-7070 Dept  YYE729. . (ucan)  HELP WANTED AT BRYCE  Canyon Lodge. Full And Part-Time  Part-Time Positions. Call 801-834-5634,  Ext. 170 For Information  And Applications.  AAEOEMFVB.  (327-515)  DRIVERS: SWIFT ANNOUNCES  Retention Incentive. Now Hiring  Drivers. Contracted Training  Available. Our Drivers Earn More  Because They Get More Miles.  Swift Transportation 1-800-347-9438.  (Eoe-MF) (ucan)  EARN MONEY READING  Books! $30,000Yr Income Potential.  Poten-tial. Details. (800) 513-4343 Ext.  Y-2236. Fee. (ucan)  HOME TYPISTS, PC USERS  Needed. $45,000 Income Potential.  Poten-tial. Call 1-800-513-4343 Ext. B-2236.  B-2236. Fee (ucan)  1000'S POSSIBLE TYPING. Part  Time. At Home. Toll Free 1-800-218-9000  Ext. T8413 For Listings.  Fee. (ucan)  SEIZED CARS FROM $175.  Porches, Cadillacs, Chevys,  BMW's, Corvettes. Also Jeeps,  4WD's. Your Area. Toll Free 1-800-2218-9000  Ext. A-8413 For  Current Listings. Fee. \" (ucan)  PHARMACIST NEEDED. FULL-Time  FULL-Time Position In Rural Town.  Call 801-257-0445, Ask For Alan  For Details. (ucan)  OPENING FOR 2 MOTEL Clean-ing  Clean-ing Maids. Full Time Position.  Call After 1 P.M., 801-826-4653.  (ucan)  NANNIES NEEDED. AIRFARE,  Room, Board, Transportation,  Health Care Assistance. Quality  Families Representing The Finest  Nationwide. 1 Year Contract.  Helpers West 801-561-8889.  (ucan)  1000's POSSIBLE READING  Books! Part Time. At Home.  Toll Free 1-800-218-9000. Ext. R-84  R-84 1 3 For Listings. Fee (ucan)  CONSOLIDATE YOUR BILLS  Using The Equity In Your House.  Good-Bad Credit. If It Can Be  Done, We Can Do It 1-800-817-4767.  (ucan)  WOLFF TANNING BEDS. Tan  At Home. Buy Direct & Save!  CommercialHome Units From  $199.00. Low Monthly Payments  Free Color Catalog. Call Today  1-800-842-1310. (ucan)  PIPE FOR BUILDING: FENCES,  Gates, Posts, Rail, Panels. Too  Many Sizes To List. Best Prices  In Utah. Call For PriceStock  List. Palmer's Metalmart, Lehi 1-800-947-0249.  (ucan)  FISHINGHUNTING Franchise-Own  Franchise-Own Your Own Company Packaging  Packag-ing Fishing And Hunting Trips.  Call (520) 753-4638 Or Write:  Outdoor Connection, 2700 Clack  Canyon Road, Kingman, AZ  86413-9589. (ucan)  WOLFFSUNMASTER Commercial  Commer-cial Home Systems. Our Sun-beds  Sun-beds Are Larger, Tan Better, Cost  Less. America's Largest Independent  Inde-pendent Manufacturer. Easy  Payments, Free Delivery. Free  Color Catalog. 1-800-605-2268.  (ucan)  THE LIFE OF JESUS IS Chroni-cled  Chroni-cled In This Six-Hour Video  Tape, 24 Historical Moments  From Life Of Jesus. $16.95 2.95  S&H Send Cheque Or Money  Order Payable To Paramount Distributors  Dis-tributors 5915 Uvalde Rd. 806,  Houston, TX 77049. Allow 4-5  weeks For Delivery 30 Days  Money Back Guarantee. (ucan)  Why Coll Anyone Bui fid taped?  Call Someone Who Works With Pumps  Everyday. We Handle Jet, Submersible,  Irrigation And Turbine Pumps,  Dempster, Windmills, Pressure Tanks,  and Complete Water Systems  IUe fllo Do EHCCiYCiting &  Septic Sylem Intcillcition!  SERVING... Jl  Sanpete, Carbon, Emery, Sevier, Wayne, pa a  Piute, Garfield, Grand, & Kane Counties  s&s noun pumps  Mobile: 801-749-1522  1-800-852-1353  Emergency Or Weekends - 801-286-2314  uui A CAMPGROUND Membership  Mem-bership Or Timeshare? We'll  Take It. America's Most Successful  Suc-cessful Resort Resale Clearinghouse.  Clearing-house. Call Resort Sales Information  Informa-tion Toll Free Hotline 1-800-426-5967.  (ucan)  GUNSHOW, DELTA, UTAH.  April 26 & 27, Sat 9-5; Sun 9-4.  Admission $4. For Table Information  Informa-tion 801-864-3210. At Fairgrounds.  (10,17,24)  GERMAN STUDENT AND Other  Scandinavian, European, South  American, Asian, Russian High  School Exchange Students Arriving  Arriv-ing August. Become A Host  FamilyAISE. Call 1-800-SlBLING.  (ucan)  WATCH SHEPHERD'S CHAPEL  On Satellite, Galaxy 4 Trans 6.  (tfn)  2020 WITHOUT GLASSES!  Safe, Rapid, Non-Surgical, Permanent  Per-manent Restoration 6-8 Weeks.  Airline Pilot Developed. Doctor  Approved. Free Information By  Mail: (800)422-7320, ext. 238,  (406)961-5570, Fax (406)961-5577  (406)961-5577 http:www.visionfreedom  .com Satisfaction Guaranteed  (ucan)  DIABETICS! (USING INSULIN)  Did You Know Medicare (Or Insurance)  In-surance) covers Most Supplies?  Save Money- Call 1-800-748-1662  Liberty- Medical- Satisfaction  Guaranteed No H.M.O. Members.  Mention AD-AAOO (ucan)  CANNONVJLLE RENTAL. 3-Bedroom,  3-Bedroom, 1-Bath, Furnished,  Fully Equipped Kitchen And  Laundry Room, Plus All Linens,  $450 Month. First And Last Plus  Utilities. Security Deposit $200.  (801) 679-8880. ' (3)  BRYCE VALLEY 12.5 ACRE  Horse Ranch Property. Stream,  Trees, Two Water Meters 619-367-7356  (36-424)  50 ACRES ON HIGHWAY 12  North Of Tropic By Bryce Canyon  Boundary. Excellent Commercial  Or Cabin Property. $2500Acre.  Also One Farm And Three Nice  Homes In Bryce Valley Starting  At $40,000. Call Joe Thompson,  Stagecoach realty 801-679-8793  or 801-676-8878. (tfn)  JOHNS VALLEY RECREATION  Residential About Ten Miles  Northeast Of Bryce Canyon. 40  Acres To Be Sold At Auction.  Financing Available. Finder's  Fee To Qualified Parties. (801)  538-5100. State Of Utah Trust  Lands Administration.  (27,3,10,17)  TWO COMMERCIAL BUILDINGS  BUIL-DINGS For Sale. Currently  Leased To US Postal Service.  One In Tropic, One In Escalante.  $65',000 Each Or $110,000 For  Both. Terms Available. For  More Information, Call Dawn  Realty 801-826-4262. (3,10)  560 ACRES DRYLAND FARM  Ground North Of Mona, Utah.  Call (801) 667-3237 or 667-9955  After 7 p.m. Owner will Carry  Contract. (ucan)  VIEWS GALORE! 40- AC  $49,900. LakeMtnsValleys  Awesome, Top-Of-The-World 360  Degree Views From This Spectacular  Spec-tacular Montana Acreage! Back  To BLM WMule Deer Everywhere!  Every-where! Close To Hauser Lake &  Just 15 Minutes To Helena! Private,  Pri-vate, Secluded, On End Of Cul-De-Sac  WUG Utilities & Food  Access. Excellent Financing.  Won't Last, Call Now 406-227-5901  (ucan)  IDAHO RANCH BARGAIN 40  Acres- $29,900. Snake & Salmon  Rivers Spectacular Ranch Acreage  Acre-age W60 Miie Views & Tons  Of Wildlife. Private Location On  End Of Road WMillions Of  Acres Of Public Lands Nearby,  enjoy Excellent Year Around  Recreation. Surveyed, Warranty  Deed, Excellent Financing. Call  Now 208-839-2501. (ucan)  CAN'T AFFORD THE HOME  You Need? Get More Home For  Your Money With Minimal  Downpayment. Complete Financing  Financ-ing If Qualified. DeGeorge Home  Alliance. 1-800-343-2884. (ucan)  BUILD YOUR DREAM HOME  The Landvest Owner- Involved  Building Offers Below Market  Construction Financing And No  Interest And No Payments For six  Months On Landvest Materials,  Approved Labor And Site Preparation.  Prepa-ration. Call Toll Free 1-888-HOME-005  ext 007 For More Information,  In-formation, (ucan)  READING & SPELLING Improvement  Im-provement - Guaranteed Results.  Retired Certified Teacher. Phonics  Phon-ics Expert. (801)826-4722 (tfn)  HARDING GLASS (Formerly  Kanab Glass) Will Be In the Pan-guitch  Pan-guitch Area Weekly For Residential,  Residen-tial, Commercial And Auto Glass  Repairs. Local Contact: Margaret  Marga-ret Frandsen, 676-8835 Or Call 1-800-871-2757  Kanab. (tfn)  '96 EXTENDED CAB CHEVY,  Teal Color, Third Door, Loaded  With Extras: Diamond Plate Tailgate  Tail-gate Cover, Rail Protectors, Bed  Liner, Chrome Rocker Panel  Guards, Bug Card, CD & Cassette,  Cas-sette, 17-19 MPG, Tow Package,  Vortec V-8 Engine. Like New,  Only You Pay Less! New  $28,000 Asking: $23,995 OBO.  '96 Full-Size Suburban, Loaded  With Full-Length Running  Boards, Low Mileage: 23,000,  Great For Family Vortec V-8, Up  To 22 Miles Per Gallon, CD &  Cassette, Luggage Rack, Tow  Package, Removable Third Seat.  New $35,000 Asking: $29,995  OBO. Will Negotiate Trade On  Used 4x4 Truck Or Bronco. Call  (801) 679-8633 or 8632.  (3 ,10,17)  DO YOU DRIVE A Volkswagen  Or Do You Wish Yours Were  Running? I Specialize In Parts  For Your Air-cooled, Pre-1967  Bug, Bus, Squareback, Fastback,  Notch, Or Ghia. Do You Want To  Sell Your VW? Call Eric, 1-801-756-8646.  (ucan)  NOTICE PLEASE: Garfield  County News Does Not Endorse,  Promote Or Encourage The Purchase  Pur-chase Or Sale Of Any Product Or  Service Advertised In This Newspaper.  News-paper. Advertisements Are The  Sole Responsibility Of The Advertiser.  Ad-vertiser. Garfield County News  Hereby Disclaims All Liability  For Any Damage Suffered As The  Result Of Any Advertisement In  ' This Newspaper. Garfield County  News Is Not Responsible For Any  Claims Of Representations Made  In Advertisements In This Newspaper.  News-paper. The Garfield County News  Has The Sole Authority To Edit  And Locate Any Classified Advertisement  Ad-vertisement As Deemed Appropriate  Appro-priate And Reserves The Right To  Refuse Any Advertising.  MEMBER  NATIONAL NEWSPAPER  ASSOCIATION  fYOUR BEST WEAPON IN THEl  FIGHT AGAINST FOOT PAIN  Very few foot specialists are I End Foot & Ankle Problems  Board Certified. Dr, Olsen is I pPPPB I wjth one phone call.  DOUBLE BOARD Certified in MB I All Non-Surgical Options are  Podiatric Orthopedics and in I I explored first  Primary Podiatnc Medicine. \"'rlrW 'Insurances Accepted  stitch office procedure Mm ' ' ACCEPT DIFFICULT 1  Heel Pain? Bunion Pain? mM k Ml CASES  State-of-the-Art Non-Surgical I l IWWR7-71W  Treatment Plan. WmM M MMM TREATMENT  Foot & Ankle Team Physician For SUU  In Panguitch Every 3rd Thursday Monthly  Special Training To Solve Special Foot & Anke Problems  HSI Fooi7d m am  Ankle MMTWftt  Clinics In Kanab, Beaver, & Panguitch Hospitals  Office In Cedar City J", "articleTitle": "Fire Safety"}, {"id": 3457916, "paper": "Garfield County News", "type": "page", "date": "1997-04-10T00:00:00Z", "year": "1997", "month": "April", "day": "10", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/75/d1/75d1bbc3f2f3fabb9f716e60de44d9fb7ae6bf60.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/ec/6e/ec6e1b1f9a8a433a34df4fa6ac524e17d6e13ec9.pdf", "page": 5, "parent": 3457924, "version": 1739885040626565126, "ocr": "FOR FAST ACTION, PLACE  YOUR CLASSIFIED AD IN  THE GARFIELD COUNTY  NEWS -- Up To 20 Words, Only  $4; 20 Cents A Word Thereafter.  Send Your Ad & Your Check To  P.O. Box 127, Tropic, Utah  84776, Or Call 679-8730 By 5  P.M. Mondays.  OR  PLACE YOUR CLASSIFIED  AD IN NOT 1, NOT 2, BUT 43  NEWSPAPERS THROUGHOUT  THROUGH-OUT UTAH. One Placement,  One Payment, Puts You Into The  \"Utah Classified Ad Network\".  Reach Over 403,415 Utahns For  Only $120. Call The Garfield  County News At 679-8730 For  Further Information.  ABORTION? WHY? CONSIDER  Adoption? Warm Secure Loving  LDS Home Available For A  Newborn Baby. Please Call Attorney  At-torney At 1-800-606-441 1. A607.  (ucan)  ALL STEEL BUILDINGS. ARCH  Buildings- 40x30 $2,995. 40x50  $4,995. 50x100 $9,650.  Straightwall Buildings Also  Available. 1-800-973-3366.  (ucan)  STEEL \"HI-RIB\" SHEETS FOR  Building Sheds, Barns, Etc. Low  Prices, Great Stock Galvanized  And Colored. Call For  StockPrice List. Palmer's  Metalmart 1200 E 100 S Lehi. 1-800-947-0249.  (ucan)  FRIENDLY TOYS & GIFTS HAS  Immediate Openings In Your  Area. Number One In Party Plan:  Toys, Gifts, Christmas, Home  Decor, Free Catalog And Information.  Informa-tion. 1-800-488-4875. (ucan)  QUILTING BUSINESS FOR Sale.  Includes 14 Ft. Commercial Quilting  Quilt-ing Machine, 4' X 6' Lighted  Marking Table, Patterns, Guides,  Material, Fabric Books, Like  New, $22,000. Includes Setup.  Judy 801-896-8312, Richfield.  (ucan)  BECOME A MEDICAL TRAN-SCRIPTIONIST.  TRAN-SCRIPTIONIST. Opportunity To  Work At Home Or In Office Typing  Typ-ing For Doctors. Home Study.  Free Literature. P.C.D.I., Atlanta,  Georgia. 800-362-7070 Dept  YYE729. . (ucan)  HELP WANTED AT BRYCE  Canyon Lodge. Full And Part-Time  Part-Time Positions. Call 801-834-5634,  Ext. 170 For Information  And Applications.  AAEOEMFVB.  (327-515)  DRIVERS: SWIFT ANNOUNCES  Retention Incentive. Now Hiring  Drivers. Contracted Training  Available. Our Drivers Earn More  Because They Get More Miles.  Swift Transportation 1-800-347-9438.  (Eoe-MF) (ucan)  EARN MONEY READING  Books! $30,000Yr Income Potential.  Poten-tial. Details. (800) 513-4343 Ext.  Y-2236. Fee. (ucan)  HOME TYPISTS, PC USERS  Needed. $45,000 Income Potential.  Poten-tial. Call 1-800-513-4343 Ext. B-2236.  B-2236. Fee (ucan)  1000'S POSSIBLE TYPING. Part  Time. At Home. Toll Free 1-800-218-9000  Ext. T8413 For Listings.  Fee. (ucan)  SEIZED CARS FROM $175.  Porches, Cadillacs, Chevys,  BMW's, Corvettes. Also Jeeps,  4WD's. Your Area. Toll Free 1-800-2218-9000  Ext. A-8413 For  Current Listings. Fee. \" (ucan)  PHARMACIST NEEDED. FULL-Time  FULL-Time Position In Rural Town.  Call 801-257-0445, Ask For Alan  For Details. (ucan)  OPENING FOR 2 MOTEL Clean-ing  Clean-ing Maids. Full Time Position.  Call After 1 P.M., 801-826-4653.  (ucan)  NANNIES NEEDED. AIRFARE,  Room, Board, Transportation,  Health Care Assistance. Quality  Families Representing The Finest  Nationwide. 1 Year Contract.  Helpers West 801-561-8889.  (ucan)  1000's POSSIBLE READING  Books! Part Time. At Home.  Toll Free 1-800-218-9000. Ext. R-84  R-84 1 3 For Listings. Fee (ucan)  CONSOLIDATE YOUR BILLS  Using The Equity In Your House.  Good-Bad Credit. If It Can Be  Done, We Can Do It 1-800-817-4767.  (ucan)  WOLFF TANNING BEDS. Tan  At Home. Buy Direct & Save!  CommercialHome Units From  $199.00. Low Monthly Payments  Free Color Catalog. Call Today  1-800-842-1310. (ucan)  PIPE FOR BUILDING: FENCES,  Gates, Posts, Rail, Panels. Too  Many Sizes To List. Best Prices  In Utah. Call For PriceStock  List. Palmer's Metalmart, Lehi 1-800-947-0249.  (ucan)  FISHINGHUNTING Franchise-Own  Franchise-Own Your Own Company Packaging  Packag-ing Fishing And Hunting Trips.  Call (520) 753-4638 Or Write:  Outdoor Connection, 2700 Clack  Canyon Road, Kingman, AZ  86413-9589. (ucan)  WOLFFSUNMASTER Commercial  Commer-cial Home Systems. Our Sun-beds  Sun-beds Are Larger, Tan Better, Cost  Less. America's Largest Independent  Inde-pendent Manufacturer. Easy  Payments, Free Delivery. Free  Color Catalog. 1-800-605-2268.  (ucan)  THE LIFE OF JESUS IS Chroni-cled  Chroni-cled In This Six-Hour Video  Tape, 24 Historical Moments  From Life Of Jesus. $16.95 2.95  S&H Send Cheque Or Money  Order Payable To Paramount Distributors  Dis-tributors 5915 Uvalde Rd. 806,  Houston, TX 77049. Allow 4-5  weeks For Delivery 30 Days  Money Back Guarantee. (ucan)  Why Coll Anyone Bui fid taped?  Call Someone Who Works With Pumps  Everyday. We Handle Jet, Submersible,  Irrigation And Turbine Pumps,  Dempster, Windmills, Pressure Tanks,  and Complete Water Systems  IUe fllo Do EHCCiYCiting &  Septic Sylem Intcillcition!  SERVING... Jl  Sanpete, Carbon, Emery, Sevier, Wayne, pa a  Piute, Garfield, Grand, & Kane Counties  s&s noun pumps  Mobile: 801-749-1522  1-800-852-1353  Emergency Or Weekends - 801-286-2314  uui A CAMPGROUND Membership  Mem-bership Or Timeshare? We'll  Take It. America's Most Successful  Suc-cessful Resort Resale Clearinghouse.  Clearing-house. Call Resort Sales Information  Informa-tion Toll Free Hotline 1-800-426-5967.  (ucan)  GUNSHOW, DELTA, UTAH.  April 26 & 27, Sat 9-5; Sun 9-4.  Admission $4. For Table Information  Informa-tion 801-864-3210. At Fairgrounds.  (10,17,24)  GERMAN STUDENT AND Other  Scandinavian, European, South  American, Asian, Russian High  School Exchange Students Arriving  Arriv-ing August. Become A Host  FamilyAISE. Call 1-800-SlBLING.  (ucan)  WATCH SHEPHERD'S CHAPEL  On Satellite, Galaxy 4 Trans 6.  (tfn)  2020 WITHOUT GLASSES!  Safe, Rapid, Non-Surgical, Permanent  Per-manent Restoration 6-8 Weeks.  Airline Pilot Developed. Doctor  Approved. Free Information By  Mail: (800)422-7320, ext. 238,  (406)961-5570, Fax (406)961-5577  (406)961-5577 http:www.visionfreedom  .com Satisfaction Guaranteed  (ucan)  DIABETICS! (USING INSULIN)  Did You Know Medicare (Or Insurance)  In-surance) covers Most Supplies?  Save Money- Call 1-800-748-1662  Liberty- Medical- Satisfaction  Guaranteed No H.M.O. Members.  Mention AD-AAOO (ucan)  CANNONVJLLE RENTAL. 3-Bedroom,  3-Bedroom, 1-Bath, Furnished,  Fully Equipped Kitchen And  Laundry Room, Plus All Linens,  $450 Month. First And Last Plus  Utilities. Security Deposit $200.  (801) 679-8880. ' (3)  BRYCE VALLEY 12.5 ACRE  Horse Ranch Property. Stream,  Trees, Two Water Meters 619-367-7356  (36-424)  50 ACRES ON HIGHWAY 12  North Of Tropic By Bryce Canyon  Boundary. Excellent Commercial  Or Cabin Property. $2500Acre.  Also One Farm And Three Nice  Homes In Bryce Valley Starting  At $40,000. Call Joe Thompson,  Stagecoach realty 801-679-8793  or 801-676-8878. (tfn)  JOHNS VALLEY RECREATION  Residential About Ten Miles  Northeast Of Bryce Canyon. 40  Acres To Be Sold At Auction.  Financing Available. Finder's  Fee To Qualified Parties. (801)  538-5100. State Of Utah Trust  Lands Administration.  (27,3,10,17)  TWO COMMERCIAL BUILDINGS  BUIL-DINGS For Sale. Currently  Leased To US Postal Service.  One In Tropic, One In Escalante.  $65',000 Each Or $110,000 For  Both. Terms Available. For  More Information, Call Dawn  Realty 801-826-4262. (3,10)  560 ACRES DRYLAND FARM  Ground North Of Mona, Utah.  Call (801) 667-3237 or 667-9955  After 7 p.m. Owner will Carry  Contract. (ucan)  VIEWS GALORE! 40- AC  $49,900. LakeMtnsValleys  Awesome, Top-Of-The-World 360  Degree Views From This Spectacular  Spec-tacular Montana Acreage! Back  To BLM WMule Deer Everywhere!  Every-where! Close To Hauser Lake &  Just 15 Minutes To Helena! Private,  Pri-vate, Secluded, On End Of Cul-De-Sac  WUG Utilities & Food  Access. Excellent Financing.  Won't Last, Call Now 406-227-5901  (ucan)  IDAHO RANCH BARGAIN 40  Acres- $29,900. Snake & Salmon  Rivers Spectacular Ranch Acreage  Acre-age W60 Miie Views & Tons  Of Wildlife. Private Location On  End Of Road WMillions Of  Acres Of Public Lands Nearby,  enjoy Excellent Year Around  Recreation. Surveyed, Warranty  Deed, Excellent Financing. Call  Now 208-839-2501. (ucan)  CAN'T AFFORD THE HOME  You Need? Get More Home For  Your Money With Minimal  Downpayment. Complete Financing  Financ-ing If Qualified. DeGeorge Home  Alliance. 1-800-343-2884. (ucan)  BUILD YOUR DREAM HOME  The Landvest Owner- Involved  Building Offers Below Market  Construction Financing And No  Interest And No Payments For six  Months On Landvest Materials,  Approved Labor And Site Preparation.  Prepa-ration. Call Toll Free 1-888-HOME-005  ext 007 For More Information,  In-formation, (ucan)  READING & SPELLING Improvement  Im-provement - Guaranteed Results.  Retired Certified Teacher. Phonics  Phon-ics Expert. (801)826-4722 (tfn)  HARDING GLASS (Formerly  Kanab Glass) Will Be In the Pan-guitch  Pan-guitch Area Weekly For Residential,  Residen-tial, Commercial And Auto Glass  Repairs. Local Contact: Margaret  Marga-ret Frandsen, 676-8835 Or Call 1-800-871-2757  Kanab. (tfn)  '96 EXTENDED CAB CHEVY,  Teal Color, Third Door, Loaded  With Extras: Diamond Plate Tailgate  Tail-gate Cover, Rail Protectors, Bed  Liner, Chrome Rocker Panel  Guards, Bug Card, CD & Cassette,  Cas-sette, 17-19 MPG, Tow Package,  Vortec V-8 Engine. Like New,  Only You Pay Less! New  $28,000 Asking: $23,995 OBO.  '96 Full-Size Suburban, Loaded  With Full-Length Running  Boards, Low Mileage: 23,000,  Great For Family Vortec V-8, Up  To 22 Miles Per Gallon, CD &  Cassette, Luggage Rack, Tow  Package, Removable Third Seat.  New $35,000 Asking: $29,995  OBO. Will Negotiate Trade On  Used 4x4 Truck Or Bronco. Call  (801) 679-8633 or 8632.  (3 ,10,17)  DO YOU DRIVE A Volkswagen  Or Do You Wish Yours Were  Running? I Specialize In Parts  For Your Air-cooled, Pre-1967  Bug, Bus, Squareback, Fastback,  Notch, Or Ghia. Do You Want To  Sell Your VW? Call Eric, 1-801-756-8646.  (ucan)  NOTICE PLEASE: Garfield  County News Does Not Endorse,  Promote Or Encourage The Purchase  Pur-chase Or Sale Of Any Product Or  Service Advertised In This Newspaper.  News-paper. Advertisements Are The  Sole Responsibility Of The Advertiser.  Ad-vertiser. Garfield County News  Hereby Disclaims All Liability  For Any Damage Suffered As The  Result Of Any Advertisement In  ' This Newspaper. Garfield County  News Is Not Responsible For Any  Claims Of Representations Made  In Advertisements In This Newspaper.  News-paper. The Garfield County News  Has The Sole Authority To Edit  And Locate Any Classified Advertisement  Ad-vertisement As Deemed Appropriate  Appro-priate And Reserves The Right To  Refuse Any Advertising.  MEMBER  NATIONAL NEWSPAPER  ASSOCIATION  fYOUR BEST WEAPON IN THEl  FIGHT AGAINST FOOT PAIN  Very few foot specialists are I End Foot & Ankle Problems  Board Certified. Dr, Olsen is I pPPPB I wjth one phone call.  DOUBLE BOARD Certified in MB I All Non-Surgical Options are  Podiatric Orthopedics and in I I explored first  Primary Podiatnc Medicine. \"'rlrW 'Insurances Accepted  stitch office procedure Mm ' ' ACCEPT DIFFICULT 1  Heel Pain? Bunion Pain? mM k Ml CASES  State-of-the-Art Non-Surgical I l IWWR7-71W  Treatment Plan. WmM M MMM TREATMENT  Foot & Ankle Team Physician For SUU  In Panguitch Every 3rd Thursday Monthly  Special Training To Solve Special Foot & Anke Problems  HSI Fooi7d m am  Ankle MMTWftt  Clinics In Kanab, Beaver, & Panguitch Hospitals  Office In Cedar City J", "articleTitle": "Fire Safety"}, {"id": 3457917, "paper": "Garfield County News", "type": "article", "date": "1997-04-10T00:00:00Z", "year": "1997", "month": "April", "day": "10", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/30/70/30706843ce1435ff5ad776ebbd640dd911b3cfd0.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/26/06/2606223bc1a5fb9effdc749eef792200b7ffecf6.pdf", "page": 5, "parent": 3457924, "version": 1739890381789593600, "ocr": "PUBLIC NOTICE  Please take notice that Garfield  Gar-field County Commission has  scheduled a public hearing on  Monday, April 14, 1997, at 11:30  a. m. in the Garfield County  Commission Chambers, Located  at 55 South Main, Panguitch,  Utah, to receive public comment  concerning proposed zone change  for the following described tract  of land in Garfield County:  Beginning at a point which is  South 890I)'04\" East (North  8945'23\" East by record) 67.98  feet and South 6056'16'' West  227.16 feet from the Northwest  corner of Parcel 10, Henrieville  Annexation Plat and running  thence south 8916'27\" East  208.82 feet; thence South  6956'16\" West 190.24 feet; thence  North 89 16' 27\" West 208.82 feet;  thence North 656'16\" East 190.24  feet to the point of beginning.  Published in the Garfield  County News On March 27, April  3 and 10, 1997.  NOTICE OF  PUBLIC HEARING  ,. Please take note that the  Board of County Commissioners  of Garfield County, State of Utah,  will hold a public hearing to  consider a petition by ED  WILSON, to amend the  subdivision plat of the Beaver  Dam Estates Subdivision in  Garfield County, State of Utah, to  vacate a subdivision street in said  subdivision, on the 28th day of  April, 1997, at the hour of 2:00  b. 'm., in the Countv Commission  Chambers of the Garfield County  Courthouse, 55 South Main,  Panguitch, Utah 84759.  Dated this 10th day of March,  1997.  Camille A. Moore,  County Clerk  Published in the Garfield  County News on April 3, 10, 17 &  24, 1997.  NOTICE OF  PUBLIC HEARING  The Southwest Utah Board of  Health, consistent with its authority  author-ity as outlined in 26A-1-121, Utah  Code Unannotated, is proposing  the adoption of the Tolfowing  regulation.  All students attending public  and private schools, kindergarten  through grade 12, in Beaver, Garfield,  Gar-field, Iron, Kane and Washington  Counties, State of Utah, snail  comply with 53A-1 1-301 through  306, Utah Code Unannotated, and  in addition shall be required to  have two vaccinations against  measles (rubeola). Students presenting  pre-senting appropriate exemptions to  immunization, as outlined in 53A-11-302,  Utah Code Unannotated,  are not required to have the additional  addi-tional vaccination, however, may  be excluded from school in the  event of an outbreak. This requirement  re-quirement is dependent on funding  fund-ing from the State of Utah or the  United States Government in order  or-der to purchase the vaccine. Partial  Par-tial funding may be used to immunize  im-munize selected grades.  , A public hearing to receive  comments on this proposed  Southwest Utah Board ol Health  a. requirement will be held at 609 N.  Main St., 2 from Noon to 1 p.m.  in the Health Department office  on April 28, 1997.  Written comments will be accepted  ac-cepted until 5 p.m., April 30,  1997. Written comments must be  submitted to Gary Edwards, Director,  Di-rector, Southwest Utah Public  . Health Department, 285 West  ' Tabernacle, St. George, Utah  84770.  Published in the Garfield  County News on April 3 and 17,  1997. NOTICE TO  SIGN SUPPLIERS  Garfield County is accepting  quotes on a signing package until  5 p.m., Thursday, April ID. The  Country reserves the right to  accept or reject any or all quotes  or to separate the contract to  maximize economic benefit to  Garfield County.  Questions regarding the quotes  may be directed to the Garfield  County Engineer, 55 South Main,  PO 5 Boxh77, Panguitch Utah  I 801-678239.' Suppliers may be  required to demonstrate qualified  status by documenting successful  completion of similar type  projects. Faxed quotes will be  accepted.  Published in the Garfield  Qninty News on April 3 and 10,  PUBLIC NOTICE  Please take notice that the  Garfield County Planning and  - Zoning Commission has changed  the day of their regular monthly  meeting to April 17, 1997 at 4  p.m. All subsequent meetings are  ' scheduled for the second  Ihursday of each month.  Published in the Garfield  County News April 10, 1997.  NOTICE TO WATER USERS  The State Engineer received  in the following Application(s) to  Appropriate Water in Garfield  Counly (Locations in SLB&M).  Persons objecting to an  application must file a Protest  stating the reasons for the protest.  To have a hearing before the  State Engineer, persons must  request a hearing in the Protest.  Protest must be Filed in duplicate  with the State Engineer, 1594  West North Temple, Salt Lake  . City, Utah 841 14, (801-538-7240)  on or before MAY 7, 1997.  (PROTESTS MUST BE  lc LEGIBLE WITH A RETURN  ADDRESS). These are informal  proceedings as per Rule R655-6-2  . of the Division of Water Rights.  (LEGEND: Point(s) of  Diversion POD; Place of Use  POU: Nature of Use USE)  61-1860 (A70738): Timothy  B. Smith QUANTITY: 0.015 cfs.  SOURCE: 6 in. well 100 ft. to 200  . ft. deep. POD: (1) S 573 W 1000  from El4 Cor, Sec 16, T34S,  R5W. (1 mile north of Panguitch)  USE: Irrigation: from Apr 1 to Oct  31, total acreage 0.25 acs-Stockwatering:  acs-Stockwatering: 4 head of  livestock: Domestic: 1 family.  POU: NFJ4SE14 Sec 16, T34S,  R5W.  97-2119 (A70757): Robert &  Naomi Brems QUANTITY: 0.015  cfs. or 0.45 ac-ft. SOURCE: 8 in.  well 300 ft. to 600 ft. deep. POD:  , (1) S 850 W 700 from NE Cor,  , Sec 26, T33S, R4E. (Near  Boulder, UT) USE: Domestic: 1  family. POU: NE14NE14 Sec  26, T33S, R4E.  Robert L. Morgan J'.E.  STATE ENGINEER  Published in Garfield County  News on April 10 & 17, 1997.  i  NOTICE OF PUBLIC  HEARING  Please take note that the  Tropic Town Council will hold a  public hearing on April 23, 1997,  in the Tropic Fire Station at 7  p.m. to consider adoption of:  1. An ordinance amending  Chapter 15, Sub-Chapter 15-3(2)  of the Town of Tropic , Utah  Uniform Zoning Ordinance, to  provide for the establishment of  non-commercial recreational  coach parks for temporarily  housing seasonal employees of  local Businesses, on less than 5  acres of land.  2. An ordinance amending  Chapter 2, Sub-Chapter 2-10 oT  the Town of Tropic, Utah Uniform  Building Zoning Ordinance, to  request that both sides of a corner  lot be treated as front yards for  determining the requirecf setback  distance.  Dated and posted this 4th day  of April, 1997.  Wendy J. Brinkerhoff,  Town Clerk.  Published in the Garfield  County News on April 10 and 17,  1997.  PUBLIC LAND USER  SCOPING NOTICE  We are proposing through an  environmental assessment to  amend our current land use plans  in the Henry Mountain and Sevier  River Resource Areas which  include the following Management  Manage-ment Framework Plans (MFP):  Henry Mountain MFP, Parker  Mountain MFP, and the Mountain  Valley MFP. Currently these  plans contain little or no provisions  provi-sions that allow the Bureau of  Land Management to consider  land tenure adjustment specifically  speci-fically for the purpose of Benefiting  Bene-fiting community growth and development  de-velopment nor for land tenure  adjustments that could enhance  management of sensitive resources  resour-ces such as big game winter  range, cultural resources, riparian  areas, high value recreation  lands, etc.  We are proposing to amend  the above-mentioned plans by  adding five new land tenure  adjustment criteria which would  replace the limited site-specific  parcel identificationcriteria in  the Henry Mountain MFP, and be  added to the Parker and Mountain  Valley MFPs in order to provide  for land tenure adjustments, if  certain conditions are met.  Public lands, in order to be  considered for any form of land  tenure adjustment including but  not limited to exchanges, in lieu  selections, R&PPs, DLEs etc.  (except FLPMA 203 Sales)  within the above-stated planning  areas, must meet one or more of  the following criteria:  (1) is in the public interest  and accommodates the needs of  state, local or private entities,  including needs for the economy,  community growth and expansion  and are in accordance with other  land use goals and objectives and  RMPMFP. planning decisions;  (2) results in a net gain of  important and manageable resource  re-source values on public lands,  such as crucial wildlife habitat,  significant cultural sites, high  value recreation areas, high quality  qual-ity riparian areas, live water,  threatened and endangered species  spe-cies habitat, or areas key to the  maintenance of productive ecosystems;  eco-systems; (3) ensures the accessibility  of public lands in areas where access  ac-cess is needed and cannot otherwise  other-wise be obtained;  (4) is essential to allow  effective management of public  lands in areas where consolidation  consolida-tion of ownership is necessary to  meet resource management objectives;  ob-jectives; (5) results in the acquisition  of lands which serve a national  priority as identified in national  policy directives.  In addition to the above  criteria, all future land disposal  actions will also require a site-specific  site-specific environmental analysis in  accord-ance with the National  Environ-mental Policy Act when  an actual land tenure adjustment  action is proposed. All future  land tenure adjustments must  meet one or more of the above  land tenure adjustment criteria as  well as be in conformance with  other goals and objectives in the  subject plan, some of which could  pre-clude land tenure adjustment.  All Land Tenure Adjustments  would be subject to valid existing  rights as determined by the  authorized officer.  We are very interested in any  feedback you may have on these  proposed amendments. Your  comments could help us refine or  better define these proposed  amendments. If you feel that  there are any important issues or  concerns that we should address  in our environmental assessment,  or if there are possible alternatives  altern-atives to the proposed amendments,  amend-ments, or if you have any questions  ques-tions on the above proposal,  please let us know. Our address  is: Bureau of Land Management,  Richfield District Office, ftfj East  900 North, Richfield, Utah 84701.  You may also contact Mr. Rod  Lee at 801-896-1524.  Published in the Garfield  County News on April 10 and 17,  1997.  ADVERTISEMENT FOR BIDS  Separate and sealed bids from  building suppliers for the Garfield  County Bryce Valley Building  Supply Project will be received  by Garfielcf County on or before  5:00 p.m., Wednesday, April 16,  1997, at the Garfield fcounty  Courthouse in Panguitch, Utah.  The Commission reserves the  right to reject or accept any or all  bias.  Building Suppliers may obtain  plans from Garfield County Engineer  Engi-neer at 55 South Main in Panguitch,  Pan-guitch, Utah 84759 - 801-676-1101.  Prospective bidders may be  required to demonstrate qualified  status by documenting successful  completion of similar type and  size work. Demonstration of the  bidder's qualified status shall be  provided upon the County's request.  re-quest. Garfield County is an  equal opportunity employer.  Faxed bids will be accepted.  Published in the Garfield  County News on April 3 and 10,", "articleTitle": "Public Notices"}, {"id": 3457918, "paper": "Garfield County News", "type": "advertisement", "date": "1997-04-10T00:00:00Z", "year": "1997", "month": "April", "day": "10", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/4e/76/4e76b682383682ee70fd55c31bbce0f174d49781.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/08/94/089491146942e5898b5305a86737a213b20927ee.pdf", "page": 5, "parent": 3457924, "version": 1739888680175140864, "ocr": "Advertising Pays  Help is closer than you think,  (So is April 15th.)  A timely reminder that no one has more'experienced preparers at more  convenient locations-tHan H&R Block.  Our rates are reasonable, we stand behind our work. So while tax time is  just around the corner, the good news is, so are we.  H&R BLOCK  505 N. Main, Panguitth, lit (801) 676-8328  loorToverin  W Carpet Se Vinyl  I Experienced Professional I  L For Estimates, A  k Call 801-648-2293 A  Serving Garfield County  Prom Qlendale  Hii DISPOSAL 1  I COMPANY  \"Give Us A Try!\"  I We'll Pick Up Household Garbage, z  j Small Appliances, Tires, Mattresses I  Big & Bulky Stuff  Tues: EscalanteTropic I  Wed.: Hatch  Thurs:. Panguitch  801-676-8375  K 'tfenf'a Commercial I  190 S. Pahreah Ln.  Cannonville i  Our Specialty  Tune-ups & Brakes  STATE INSPECTIONS  679-8807 $gSst  'instate  Senior Accovmt A5ert  297 West Hilton Drive  St. George, UT 84770  Bus. (801) 628-8778  FAX (801)634-1065  1-800-435-5994 J  Jf&f Frosty's I  k Upholstery  5y-s&A Cleaning  Free Estimates  Truck Mounted  Steam Extraction Unit  648-2178  Orderville  Refrigeration & Appliance  Air Conditioning Heating ;  Water Heaters  All Major Appliances  Repair & Replacement  801-679-8891  40 Years Experience  AU.HSHSL I  Martin & Manuela Escobar  Open 7 Days A Week  In Panguitch; 7 a.m. - 9 p.m.  Hatch; Sun. - Fri.; 7 a.m. - 9 p.m.  Panguitch 801-676-8222  Hatch 801-735-4357  READY-MIX CONCRETE I  Fiber Mesh  BGrout Mixtf  t tlfe I  801-679-8678  Cannonville  Our Specialty:  \"Honey Do\" Projects  Simple Remodel Decks  State Licensed  TVs' VCR s Appliances  Guaranteed Service  Reasonable Prices  801-577-2100  SHOP  801-577-2545  HOME  In Panguitch  Tues. & Fri.  RSR Welding\"  S Machine. Inc.  Trailer Repair  930 N. Hwv. 89 Panguitch I  Whitfield  Pellet Stoves  We Carry Pellets & Deliver  S & L STOVES  801-679-8556  Shawn Chynoweth '  T  Decisions,  $19.95 jSB  Hpj? Decisions,  $69.95 gA  m Decisions,  ' C'KH) or M \"lOTonoLA  JfZyy.ZfD ArDiehredCellLtr Dealer  With so many choices in life, Motorola gives you just what you needed another one.  Choose from the sleek Motorola Micro TAC Lite n, the practical Motorola Power Pak  or the value of a Motorola Tele TAC 250. Motorola phones starting at $1 9.95  CELLULARONE  ESCALANTE PANGUITCH A7 GtlAOffC  Brent Cottam Greg & Jane Excell CANNONVILLE  801-826-4344 801-676-8079 George Thompson  'Restrictions Apply 801-679-8806  All Roofs Licensed  & Repairs Contractor  Orson Worthen  com coumnooFiHG  801-676-2423  Translation Service  FromInto French Or German  Menus Brochures  Call Or Fax For An Estimate  801-679-8664  Cannonville, Utah  SI il THOMAS j  ill Al i  7 Days a Week .  801-676-8111 i  24-Hour Towing I  NAPA AUTO CARE CENTER  hooper's Scnric  TIRES REPAIR  State Inspections  Heat, Farm & Bulk Oil  195 N. Main  l Panguitch  801-676-8892y  Electric Inc.  801-676-8039  James Ciecalone, Panguitch  Master Electrician  License No. 96-322290-550 1  '\"LfN Color \"  Qgjjj) Co wrier  f Will Distribute Your Printed Advertising Materials  Thoughout Garfield, Kane & Wayne Counties & The Sevier  V Valley Area For A Small Annua! Fee J  Information,  Call Nancy  S01-G79-SS04 or j  S01-G79-S730 J  801-676-8287  IRA'S LIFE HEALTH  HOME AUTO ANNUITIES  Aaron Bybee  Plumbing  rW fijwmpi (Plumbing  gjjV SuwicaA  J Faucets  1 Taps, Drains  New & Remodel  Licensed Contractor  801-679-8618 Tropic  f FRONTIER  SERVICE  Full-Service Paint ii Body Shop  Wrecking Yard Impound Yard  Welding Repairs Salvage Parts  485 N. Reservoir Rd. - Escalante  A Lady's Touch  Vendy Swiger  fiW FREE ESTIMATES  M i Iff Interior Exterior  A'j V Stain Varnish  Cabin Oiling  ' uwmmismiioii  II  Derrick Clark, Owner  Licensed & EPA Certified  801-679-8430  HOME MED CARE  SertWttf fyvi-lietd (? aunty  ASK FOR  CLINT OR JOLENE POLLOCK  801-676-2712  Toll Free  1-800-662-2535", "articleTitle": "Public Notices"}, {"id": 3457919, "paper": "Garfield County News", "type": "unclassified", "date": "1997-04-10T00:00:00Z", "year": "1997", "month": "April", "day": "10", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/4b/ce/4bce4cb89b8250fbc52fcb9956d2b4a187c9475b.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/4e/58/4e58b395fd94fd54ace5c6f4907cc766175a46d3.pdf", "page": 5, "parent": 3457924, "version": 1739889123582279681, "ocr": "Thursday. April 10. 1997 GARFIELD COUNTY NEWS 5-A", "articleTitle": "Public Notices"}, {"id": 3457920, "paper": "Garfield County News", "type": "birth", "date": "1997-04-10T00:00:00Z", "year": "1997", "month": "April", "day": "10", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/bc/f4/bcf45b634943ff767224a7b4a8b841caa1367f27.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/6a/2c/6a2c1710297fae859911c97c197a2048c937b7b2.pdf", "page": 5, "parent": 3457924, "version": 1739887045818449922, "ocr": "Two New Babies  Born In County  PANGUITCH Information  officer Connie Sawyer reported  the births of two new babies this  past week at Garfield Memorial  Hospital in Panguitch.  On April 4, Sean Anthony  Hoover was born to John LeRoy  and Donna Cerise Hoover of  Circleville, weighing 6 lbs. 7 oz.  and measuring 19.25 inches.  Shay Dre Chamberlain was  born to Mr. and Mrs. Max  Chamberlain of Ordcrville,  weighing 7 lbs. 2 oz. and  measuring 21 inches.", "articleTitle": "Two New Babies Born in County"}, {"id": 3457921, "paper": "Garfield County News", "type": "page", "date": "1997-04-10T00:00:00Z", "year": "1997", "month": "April", "day": "10", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/fc/15/fc15a4d8cbd6cde85386aecfe20f391647344dfd.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/21/0a/210a14e7fd7bac83871643e3a67681e3a654f4df.pdf", "page": 6, "parent": 3457924, "version": 1739889989876973573, "ocr": "Two New Babies  Born In County  PANGUITCH Information  officer Connie Sawyer reported  the births of two new babies this  past week at Garfield Memorial  Hospital in Panguitch.  On April 4, Sean Anthony  Hoover was born to John LeRoy  and Donna Cerise Hoover of  Circleville, weighing 6 lbs. 7 oz.  and measuring 19.25 inches.  Shay Dre Chamberlain was  born to Mr. and Mrs. Max  Chamberlain of Ordcrville,  weighing 7 lbs. 2 oz. and  measuring 21 inches.", "articleTitle": "Two New Babies Born in County"}, {"id": 3457922, "paper": "Garfield County News", "type": "unclassified", "date": "1997-04-10T00:00:00Z", "year": "1997", "month": "April", "day": "10", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/1f/ec/1fec21af9eaaf9c35c378927763e1a52799eb027.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/b7/57/b75733f2037766ff36fdc00b2f07860d6828d61f.pdf", "page": 6, "parent": 3457924, "version": 1739893711311994880, "ocr": "6-A GARFIELD COUNTY NEWS Thursday. April TO. 1997 M", "articleTitle": "Two New Babies Born in County"}, {"id": 3457923, "paper": "Garfield County News", "type": "advertisement", "date": "1997-04-10T00:00:00Z", "year": "1997", "month": "April", "day": "10", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/64/2b/642bb369f608a68406f2c69644050b7186de8f03.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/0d/a3/0da37087da5b7d3d402ca785806cda3014ca072f.pdf", "page": 6, "parent": 3457924, "version": 1739887283170967554, "ocr": "6-A GARFIELD COUNTY NEWS Thursday. April TO. 1997 -  8 KORN f1 Corn Flakes S, Z Marketsvl? Toweis aS 8  fi ,8oz-$l,69lly rffio 59i PBa I  8 liJSS J3$ V leoz. $1.29suw?N jgg Saltines 9  PinDele M'  9 VPI QQf lb!S u-s-d-a7 WJBfm Clorox V  X Vol 20oz. 1 Choice Boneless .. rz fe Bleach ,0  8 tggft Sirloin Tip Roasts BarS rn89CTvS  0 Extra Ml $1.69 lb. BaCOn Gallon 5y 0  S Liquid b leoz. $1.79 ea. Western Family JX  X Determent POfe Snack Crackers Umnw  gallon 2$4.99 jjpgpPF 16 oz. $1.29 jSgpj I  Campbells S jKud (a' Smoked i BSfl Salad or Elbow i  fl Tomato Soup 1 Ham Shanks mmj Macaroni X  J 299C HJS 1 W Bars 4tt$1.09 lb. izoz. 69C 8  USISSP Meat Bologna re . V  S MSA 16oz. 99C eawyj BjEEH 8  X T&ttSHtt Campbells (0  V HA Chicken Noodle ualS0gLs . fAsJrc nzr  1 ser Hums ISF arS:Jb' )l  I 3 Snack Pack cfeA FrA f  V Captain Crunch QQC ( c,0Pen Jrneesp rorn, Aro Ma ifl  rroai 4pk2- rHai V ?r ) 80, to , e I fR-or Cnnkiej ore iaa V  8 tf C?f;tf9tf 7 ,?n7 $! qq TaterTots  f Crunch Berries, Peanut Butter J Hunts g Sffftgwsr 41. $1 99 N  n 1 5 oz. $3.29  Hunt's I Jimmy Dean riiS I '  I Fruit'cociftail jfe '\"S) Cit?usMoln1' i  l Dei Monte IJp Vf 7 Western Family 1  J Sj? Peaches \"V CA CrelmThTese H i  89C Asparagus mmS soz 89C 8  I PotchiPs 51.29 lb.  8i 14 oz. $99 y SlieingLTomatoes \"  S TRmBSm J Ga,lon ' -S  XSI meMarks. . fl  V ! Thank you for i -KKKm Jimtrv Dean X a--iV Ifl  W ! Shopping At j I$BKS SaUSaSi ,4- Absolutely j  Vt5 Welco\"arke'! 10 South Main - Panguitch, Utah 84759 BfcBBF f ApriPl6 HJHD  S cjf Fa J NEW HOURS S I I IfH ,0'5'-'6' tS? S  8:00 a.m. -9:00 P.m. vi' L 1 &", "articleTitle": "Two New Babies Born in County"}]}