{"numFound": 56, "start": 0, "numFoundExact": true, "docs": [{"id": 27847049, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/49/55/4955b0671e6d0b2b692a014c2d50bb411f9a4f83.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/a8/95/a8951d96ce50b49d90ccbd45275d28d9b7a5ede2.pdf", "page": 1, "ocr": "PR FoeIT EE ee Se Salt LakeGribiine - Utah's Independent Voice Since 1871 ° WEDNESDAY, SEPTEMBER12, 2001 143 South Main Street, Salt Lake City, Utah 84111 Telephone numbers listed on A-2 DAY OF TERROR , Suzanne Plunkett/The Associated Press People tunfrom the collapse of one of the World Trade Center Towers on Tuesday. Both towers crumbled to the grounda two hijacked planes were steered into them. Death toll likely in thousands; US. vowsretaliation . who,for security reasons, spent much of the day in the-air aboard Air Force One, E> TRIBUNE STAFF and NEWS SERVICES L ie the wake of the worst.attack ever escorted by fighter-planes from Florida civilians, the United States to Louisiana to Nebraska before returnfeis pointing fingers at Islamic radical ing to’ Washington, D.C., on Tuesday * Osama bin Laden. The exiled Saudi is* evening. (The complete textof the presibelieved to be hiding in ‘dent’s evening address can be found on “Today, our-nation saw evil,” PresiPage A-2,) dent Bush told the nation about 12 hours Noofficial death tally had been anafter three hijacked commercial airlin-. nounced by press time, but the number said Tuesday night “just. about everythingpoints” to him. Theloss oflife from Tuesday’s attacks is likely to be horrendous — as many as 50,000 people could have been in the two 110-story skyscrapers, and thousands in in the Pentagon. The grim toll is almost certain to sur- “pass the 2,403 who were killed in the Ajetairlineris surprise Japanese attack on the U.S. na- lined up on one of the World sinancialaattine ae “of casualties ‘iricludes about 900 fire- val base at Pearl Harbor, Hawaii, on Dec. ousands, reducing New York’s World fighters who responded to the initial 7, 1941, and alreadyis greaterthan the Nam GenTomatoes ofrubble ..crash, and the final number will be fortress known as the Pentagon. » Bush vowed to “hunt down and pimnish” those responsible. A fourth commandeered <airliner; which crashed in western Pennsylvania, was believed. headed for Washington. ahof the 266 people aboard the two American Airlines and two United Air“Wewill make nodistinction between the terrorists who committed these acts and those who harbor them,” said Bush, and destroying a portion of the national lines planes survived. “more than any of us can bear,” said 167 who died in a domestic terrorist bomb attack on a federal building in Trade Center ‘New York Mayor Rudolph Giuliani. Bin Laden is blamed for masterminding the bombings of U.S. embassies in Kenya and Tanzania in 1998, and is suspected inthe bombing ofthe USS Cole in Yemenlast October. He is believedto be based in Afghanistan. He heads the AlQaida, a global terrorist network that OklahomaCity on April 19, 1995. ‘Theattackis likely to havea similarly jarring effect on a stunned nation, as Americans hunkered down, suddenly unsure ofthe safety oftheir skies and the nation’s ability to protect them from faceless enemies. Talk turned quickly to retaliation and even war. York on Tuesday. Both towers crumbled to the round her two & head iets Na jel were steered repeatedly. Sen. Orrin Hatch, R-Utah, a member of the Senate Intelligence Committee, war,” proclaimed Sen, Bob Bennett, unprecedented act of terrorism. has ‘targeted the United States Towers in New “This is an act of war, and we are at into them in an See ATTACKS,Page A-9 Carmpen Taylor/TheAssociated Press Attacks cks ForceForce Review Review ofof Olympic Olympic Securit Security BY MICHAEL VIGH and CHRISTOPHER SMITH University’s dean ofcriminal justice. RBART “Oneofthe unfortunate prices we pay fare aa ina free society is a higherlevel of risk,” ‘Tuesday’s fiery terrorist attacks will security we see there will be applied to said Greene, whose research on Olympic the Olympics. Utahns tad find them in- security measuresis used by organizing convenient and unfamiliar. committees and the federal government. Olympic security experts say Salt Lake Organizing Committee Lake City Games organizers’ taeofbal- President Mitt Romney met Tuesday ancing the inherent with the U.S. Secret tension pare a ————Servite, which is in open society charge ofUtah's $200 equate safety is now GAMES AND THREATS million Olympic se- | more difficult. | | | a Greene, Northeastern } | Some Utahns are feeling vulnerable “We should do ev. erything we can to security, but wedon’twant todo Se ana eat cer aaen Ue rest Of the country. we're going to be.stopping cars the Utah boraN ™ aes : 5 curity program. “I thought the program was a complete and holistic plan, which did not have gaping holes or obvious weaknesses,” he told The Associated Press. “I ” See RECURITIPERN Prasat, oe Dramatic photo display A3, AB World reaction Utah Muslims condemn attack Utahns witness the disaster A2 A-7 At Economic predictions A4 On the trail of bin Laden AS Impact on business 0-6 Sporting events postponed Editorial and Bagley B41 a8 i i ", "parent": 27847048, "version": 1739897607523663873}, {"id": 27847050, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/e0/32/e0322bc10d5c38fc30c953de8418fe84ac1abf56.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/ee/08/ee08e44110976d10c83081bf778429924b25a61d.pdf", "page": 2, "ocr": "A2 The Salt Lake Tribune Full Text of Bush’s Address Leaders condemn terroriad in US., offer sympathyto victims “horrifying” Jim aid groups to offer help “regardless of politicalpolitical concon- or differencesbe and the ed ai hs Eis arTibieh tofugos coho veer.soudheador chy ofidan WEST BANK Arafat expresses shockat ‘unbelievable’ attack as Palestinians cheer ‘TradeCenter in New York and oe zpNABLUS—= \"Thousands of celebrated ee ace, try to undermine While Iraqi TV appeared to salute the atee aa 35-year-old poet U.S. embassies are evacuated as countries go on high si emergency lence. Wereiterate our ‘total and strenuous re- ty” alertwon pa inoeffectatmajorairports eeeotters ordered to return. Brazilian authorities sta- ae States canceled independence day -and all flights en route to the United States were S Maemattc i nie areas tioned battalion’ ofsecurity forces around the Fernando Henrique Cardoso EUROPE sued a statement condemning EUFOpeans declare’solidarity Tn Colombia, the government ofPresident ipanese companies with inthe veeTae Leics scrambled for infor- mation on.the safety is MNES President Gen. Pervez MusharrafofPaki- foocomantiyeal wath US., resolveforjustice the cowardly and citetogsConeitatacke ane*9 ope’s leaders responded with cries ofout, stan, one ofthree countries that reoognize Af ’s Talibangovernment, condemned Rea ee of terrorism. tion’s condolences. RUSSIA ‘ U.S. governmentnot to seek hel Putin puts troops on standby, expresses sorrow over tragedy — sma iynd cane ierwere dovensofcandleg In Moscow,Russia’s President Vladimir Pu: “erning and urged an intensified war tin expressed sorrow and outrage over what he terrorism. “Our message to who perpetrated unspeakable crimes called “a terrorist act, this terrible tragedy” and said that“theentire international community. aee eae \"it said. terroxism:\"* 3 Chancellor Gerhard Schroeder “Retaliation will lead tothe deathsofmany peo-. BRITAIN “Blair calls for all democracies to fight the/‘new evil’. in world British Prime Minister Tony Blair cut short a key policy speech to union leaders at the seaside resort of Brighton and returned ately to London to monitor what he described as though through valley the shadow ofdeath, I fear no evil for you are with me.” ‘This is aday whenall Americans from every walk oflife unite in our resolve for justice and peace. America has stood down enemies before, and we will do so None ofus will ever forget this day, yet we go forward to defend freedom andall thatis good andjust in our world. ‘Thank you. Good night and-God bless America. : VATICAN CITY Pontiff invokes God’s mercy for victims,blesses rescuers Pope John Paul Ii condemned the telegram to President Bush as “deeply shocked.” The U.S. Embassy in Moscow saidpublic ar- offoreign children. MEXICO ; Heavily guarded borderis open to U.S.; Fox denounces terrorism broke atourefBritany to turdPari CIUDAD JUAREZ — Tightened securit Fenda arg bat phar DoeHaltLakeTritune (SSN746.3600) dailyand Sunday 148 16,1971. Published” KearnsTribune Main St, Salt se ete ‘SaltTribuneat wboveaddress. —™ ple stand by the American eae and ity in this tragedy,” plunging humanity into an unimaginable climate of war. NEWSROOM NUMBERS SUBSCRIPTION eee ae nbn $100 Member Bureau ofCireulations “RatesmayvayoutsidetheSaltakometroptanava.” ADVERTISING —_ ChaletAdvertising (Qo) 2979000, Display Advertsing ......... (eo 297205 y oh j ", "parent": 27847048, "version": 1739896785904599040}, {"id": 27847051, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/76/9e/769e815d854e95e01d794a24582e66227e1c8d85.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/c4/b5/c4b52b77d8c995bc6b3a8e5c3889fa6795cce54a.pdf", "page": 3, "ocr": "DAY OF TERROR © A ‘Defining The Salt Lake Tribune A3 “These were not just crimes against the United States, they are acts of war. Wewill Moment’ prevail in this war, as People flee across the Brooklyn Bridge from the clouds of smoke over lower Manhattan. In History — wehave prevailed in the past. May God bless us in this trial, defend us, and make SEN. JOHN McCAIN Arizona Republican “Make no mistake: The United States will hunt down and punish those responsible for these cowardly acts.” PRESIDENT BUSH “Tt’s just heart-wrenching.I don’t know any other way to express it. We’ve seen other countries being attacked but never here, like this. Pearl Harborwas the last time. These people come to the U.S. under false pretenses and they try to destroy us. a Ernesto Mora/The Associated Press ‘ ‘Two women hold each other as they watch the horrific scene unfold at the twin 110-story World Trade Cente! r buildings in New York. ‘Workerssearch rubblefor victims; citizensseek waysto help Who can you trust? Wefeel safe here [in Beaver], but it is very sad to see such a horrible thing happen to our country.” BY HELEN O'NEILL MELVELYN BALL ‘THE ASSOCIATED PRESS Beaverresident NEW YORK — As nightfell Tues. day,the city moved past the nightmarish people “T kept my two children home from elementary school. I just wanted my babies with me.” TIFFANY JONES Leedsresident Matt Moyer/The Associated Press Firefighters carry an injured fireman from the World Trade Center area after the twin towers’collapse. what they feared would be hundreds of bodies — including maity col f “This is going to hurt,” said Jack a 43-year-old. Brooklyn ter. Hundreds of volunteers with medi- “Tt is premature to level allegations against a person who is not in a position to carry out such attacks, It was a wellorganized plan and Osama has no such facilities.” MULLAH ABDUL SALAM ZAEEF Taliban's ambassador to Pakistan Mike Derer/The Associated Press {An unidentiied bum victim is loadedinto en ambulance atJersey City Genter inJersey City, Nl. » ty ", "parent": 27847048, "version": 1739897192538177536}, {"id": 27847052, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/5e/54/5e542e883a222af1615314b2252cc9d94e6a58c2.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/15/56/1556d7cf6ddf981f57253d9d272dcb227b9c6000.pdf", "page": 4, "ocr": "DAY OF_ The Salt Lake Tribune Markets closed them and bring them back for trial, that would be best. But I don’t think they'll be able to do that. They'll have to hunt them down and kill them. Unfortunately, that’s the only thing terrorists understand.” REV. ERIK RICHTSTEIG Price’s St. Anthony of Padua Catholic Church 2h EES they could capture ity in U.S. history. most. immediate economic problem was how to get et “ a Me ponder future “ipl | lhe Abe Ske vi today as experts Ht for revenge, but for justice. We cannot sit by and let innocent people be killed. What these terrorists have done demands justice. Our government needs to track them down and deal with them. If Economy. Expected Reel,Too i‘ “We need to pray for the people who are injured or killed and their friends and families, That’s our first duty. But there also is a demand not TERROR > i i A4 Universities — OfferVigils, Counseling Officials fear forsafety of certain ethnic groups BY KIRSTEN STEWART THE SALTLAKE TRIBUNE _- “Tt seems that things [in the Bible’s Book of Revelation] are coming true. It’s just unreal to me that people can take life, children and all the people involved. And I am sure there is more to come.” eons i 17,000 students. were suggesting students abroad students. to LAURA KURTH New Harmony resident F a 5a, Lt £ E A uel Ne z Z 5 z :WlHiuyHi id | i i Pi ieut g p2de i Gh EEE He ; i ul Ley iea < g i: “We havebeen somewhat busiertoday,” saidMaureen May, customer service manager. But such an ‘increase is usually seen after any sort of disaster, even hurricanes, she said. iB ifehartt i aut BES q: :: et re ie TT neti aie if iI a _ = i i Bi Soe aF they ought to be wiped out. T don’t think we ea. “When they find out who’s Sieitl i i iail bie dtl JEFF RONDINERO . again when they saw the tower go.” i FE TE rinteny still f FEE i. screamed, ‘Oh, no! Oh, no!’ ovet and over ‘Lower Manhattan resident i o n u if cLPyAta]EAUETEEPEPETE 1e iE iiguiieteettt ! iai ifi {Lif “1 looked up at the smoke and saw the building shake and then begin to drop like a house of cards. People around me F i pa i i; Hi BY i Utahns Stock Up on Storable Food, 72-Hour Kits, Survivalist Supplies ", "parent": 27847048, "version": 1739897376110280704}, {"id": 27847053, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/cb/5b/cb5b3e3c1cb774b5eddc9b5c069da462a90a1b3f.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/f9/28/f9289947a790a27c36528c13c15e7f490d292b01.pdf", "page": 5, "ocr": "DAY OF TERROR Games May Survive Terrorism, Not War BY LEX HEMPHILL ‘THE SALT LAKE TRIBUNE bertpem britsoA tanminrapeaptag festival pales into insignificance in the im‘Tuesday’s unimaginable attacks on New York and Washinget Salt Lake City, now just five months global eventthat has been in for the past six years itisnaturalto AN ESSAY “Some Utahnsfeel vulnerable wonderwhether BY LINDA FANTIN and MIKE GORRELL who works in the Olympic ‘THE SALT LAKE TRIBUNE nature of the event,” Moran movement today because of its said, “But when you have the world’s most nation Sept. 11, 2001, will prove to be a date of inthat changes the mood for, oe es ractisity etsieesetee soma Win: ter Olympics. If it is not hyperbole to suggest, as many already have, that Tuesday’s attacks constitute the Pearl Harborofthe terrorism age — the main difference being that this perpetrator is not as identifiable as Japan was 60 difficult to discuss the future of Berlin, ofWorld War I. And the 1940 and 1944 Olympics, both summer and winter, were not held because of World War IL. In the latter case, ofcourse, the 40 The Olympic Games, aneived asacatalyst for international friendship through Hae cits coleciat with a stato otwar. but six decades ago some of its idealists still dreamed thatit could. The International 0 ic Committee supported holding the 1940 until the host countries themselves bailed out and turned their attentions to war, not peace. The 1940 Olympic Games had been awarded to Japan — winter in Sapporo, summer in Tokyo — and Avery Brundage, then an IOC memberfrom the United States, aimed to keep the Games in Japan, despite [Brundage] said, only ifthe host city voluntarily gives it up. This is exactly what the Japanese Cabinet did on 16 July 1938, announc- ing to the world that eethe Olympic Games in their country would weaken ‘the essential Japanese spirit.’” Butthe IOC had a backup plan after the Japanese gave up the Games.In the spring of 1939, it decidedto hold the 1940 Summer Games in Helsinki and the Winter Games in Garmisch-Partenkirchen, the German town that played hostto the 1936 Olympics. ose who were determined to games, come what may, were soon faced with another obstacle,” wrote Allen Guttmann in The Olympics. “On Sept. 1, 1939, less than a year before the games ofthe 12th Olympiad were to be celebrated, Germany invaded Poland. While Brundage admitted that World War II was ‘the suicide ofa culture,’ he nonetheless clung to the illusion that the games might be saved... . “The definitive end to these illusory hopes came when Germany withdrewits invitation to host the winter games at Garmisch-Partenkirchen and the Soviet Union invaded Finland[on Nov.30].” So, the Olympic Games do nottrumpwar, but they have survived acts of terrorism before. Twice during the Summer Games,in 1972 and 1996, people were killed in terrorist acts, and the Games continued.In 1972 in Munich, 11 Israelis were killed by Palestinian terrorists, but declared that the Games must go on. Andin 1996 in Atlanta, a bombexploded in Centennial Olympic Pere killing one person; the Games continNia just two days before the Atlanta Games opened, TWAFlight800 crashed into the Atlantic Ocean after takeofffrom New York, killing 230 people. The early speculation of a bomb exploding on board or a missile shooting it down — noabsolute conclusion was reached — bred suspicion ofterrorist involvement, but the Olympics were unaffected. IfTuesday’s attacks are viewed over the nextfive months as a single act ofterrorism, albeit of unconscionable scale, then the brave words Tuesday ofthe 2002 Olympics proceeding unimpéded will probably hold true. Butifevents follow Tuesday's “Pearl: Harbor” the waythey did thefirst Pearl Harbor, then there is certainly precedentfor the Gvene Games’ becoming oneof the casual- “This is the second Pearl Harbor. I don’t think thatI overstate it.” SEN. CHUCK HAGEL Nebraska Republican “T havea sense it’s a horrendous number of lives lost. Right now we have to focus on saving as manylives.as possible.” RUDOLPH GIULIANI New York mayor “T’m sickened and disgusted. I’m just glad I live in a small town in Utah.” KELL] VALADEZ Ivinsresident “Weought to serve notice to the terrorist world that you’ve had your last hurrah. We must spare no effort to find the responsible party, parties or groups and bring themphil@sttrib.com them to justice.” SEN. BEN NELSON Nebraska Democrat something has moreofa US. soho fe If they hit the Olympics,it hits the world more.It’s more of an international “Life will not be the same any more as far as travelers are concerned; there’s going to be a lot more scruti- ble. They wondered it is possible to welcome the world without reservation,, whether, the Games would resemble a police state, or ifsuspicion and stereotypes might spoil the ny. At the same time, Some even speculated the United Statescould be at war come February. U.S. Sen. Bob Bennett said that in some ways, we already are. “This is an act of war, and we are at war. In wartime, ae oe eens vee Steve Griffin/The Salt Lake Tribune LDSChurch PresidentGordon B. HinckleyspeakstoTabernacle concertgoers aboutthetragedy. in Utah knowing that we prob- Local Churches Offer Solace Congregations acrossvalley open door to mourners, plan services Anguished Roman Catholics as well as people of other faiths filled the Cathedral of the Madeleine in downtown Salt Lake City on Tuesday evening coder Shen orien: cradling babies, people alone Wi 5 in il Foe ef Francisco Kjolseth/The Salt Lake Tribune On Tuesday, churches from St. George to Logan opened their doors for prayer vigils and services for those wishing to offer prayers. Many people sat in silent mayer at the Ca- i § thedral Church of St. Mark, 5 z ii | |F i eUnEepeL ay g ofthe — THE REV. JOHN DELARIVA Madeleine on A Catholic priest at San Francisco the Cathedral executives in suits, mothers to share the moment. “I don’t belong to this church, but I had to go somewhere to grieve with other peocae ok said Bonnie McBeth of Salt holy place in sought out a children In in school uniforms, and in groups — came Immigration and Naturalization “This is a time for compassion. It’s not a time for long sermons,” Cowlishaw of Cedar City to mournthe dead andprayfor Fs STEVE BRANCH Service officer in charge of Utah BY PEGGYFLETCHER STACK THE SALT LAKE TRIBUNE a when we ID these people, we need to understand their culture and their background. We can’tjust go out and round up everyone.who looks suspicious from entering the country.” said Dan Webster, director of communication for the Episco- Tuesday. audience in the Tabernacle. ity at the LDS Church’s downtown Salt Lake City was stepped up in the hours after the attack. About 2:30 p.m., the church closed the office building in deference, to those who died.It also temporarily closed temples from Ogden to Provo, and its temple in Washington, D.C. The church planned to resume normal operations today. Officials for The Church of Jesus Christ of Latter-day Saints said they. were making “all resources of the church” available to any relief agency needing help. The church said missionar- jes in New York City and Washington, D.C., were accounted for and steps had been taken to protect all missionaron Tony LDS romSalt whodeLa International Airport “T am former military intelligence. I can’t believe thatthis is something that happened within the United States, I’m infuriated and depressed. I was going to do a lot of work around the house today. That’s not going to happen now.” MICHAEL OHOLLAREN i a ‘St. George resident sail — a ! ", "parent": 27847048, "version": 1739894527285526528}, {"id": 27847054, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/b5/27/b5279a03bd2b4bfed6663f16c5349a9631693ff0.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/d5/4a/d54ad2b84245ba9c0fc8e5532bb532fb2551593a.pdf", "page": 6, "ocr": "“This is bigger than Pearl Harbor. It wipes the slate clean on Americanhistory. But this one is even more dangerous. It is an act of war but we don’t know who did it and we don’t know how.” Bin Laden Emergingas Sus Manifest links jet passenger to Terrafram the Sty: istTacHt ewYor A day of terror across the nation Islamic radical BY KAREN GULLO and JOHN SOLOMON OMAR KADER Former Utahn and a PalestinianAmerican “Any acts of retribution, or any feeling of hatred against people ofany race or religion, would simply be a perpetuation of the bigotry and hatred that led to the events of today.” ROCKY ANDERSON Tuesday. Authorities were focusing someoftheir efforts on possible bin Laden supporters in Florida based on the identification Salt Lake City mayor “It is just unbelievable. I don’t see how anybody can do that to somebody. They’re warp-minded. E i énee Fed ze FE ii i ftp i bg ; ifi i: 5é ute aes i Fes haven’t had to face this before.” JAN ENOS Parowan resident : g “Tt kind of makes you wantto go home and spend time with your family. It puts everything in perspective.” KEITH MEYERS Ohio resident the plane aE: Fie ; Utah Sen. Orrin Hatch was in no mood to mince words following Tuesday’s terrorist attacks. ! BY JIM WOOLF THE SALT LAKE TRIBUNE American forces, to try to hit against Americans. He has called for the death of # i ru z i E F5Ff [Ee I f Hel E Ii 5 ittid Virginia Republican, the senior member on the. Senate Armed urges firm,rational response ie,! SEN, JOHN WARNER | HatchLambastes ‘Bastards’ Behind Attack Utah’s Washingtondelegation “This story has been written in fiction and nowit’s before us as reality. Our lifestyle will neverbe the same again. We'll need to restrike the balance between the exercise of our freedoms and security pressures to protect this nation.” carries 1 itis 155 feet long and hasa wing span of 124feet. ai iBgi%zg i | i : LitiE :é eif ii g : [i ‘Towers blast in Saudi Arabia in 1 was Ht actcaneet wish it wasn't so, butit is,” he said. ", "parent": 27847048, "version": 1739895528973402112}, {"id": 27847055, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/64/d6/64d6a9db7c84c905e02183856af5bb40063fb621.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/c5/4f/c54f66ed3a58f540eb20828bf4df1c6836578d51.pdf", "page": 7, "ocr": "DAY OF Weduesday, September 12, 2001 . The Salt Lake Tribune ee “It is a very tragic : occurrence. I don’t 3 ff y know how surprising AEs. it is, We’ve known for Workers had New York tragedy es x activity could take on TV when plane hit building BY CRAIG GORDON ee? oe fe ae the and EARL LANE hee NEWSDAY on tearing better job in our gaping national security. The building’s west side that disaster reaction by WASHINGTON — Just as houses the Army's planning Pentagonworkers werestaring center fire, police and health hes was Soeenee la Soe York’s distant terror became his office when the plane hit, thelr own Tuesday as a third nd headeddowntowardthe Gefromaite m alo SeebrGnlne bs The massive headquarters Said. He then went to the Na- eh | aatic. I workpart time in Zion National a! Peele nee hee, pein feagpier Cogent vin eeee writin especially the foreign Pentagon that houses top mili- visitors, are concerned section ofone ofthe structure’s ‘ary commanders, where he poundingthe horror of an alBut some inside thePenta2 day. gondidn't realize the building estaingta ht was under attack. Air Force about their safety . Ithas going home. made them all very i ch ae ga po angle oa: DAVID HATFIELD five’ fabled. walls and com- Temained through theday. aware: dent andpisshe in the National Military Comstarted ” said ‘5%. a waitress who Ida mand Center, watching the Twin Towers catastrophe on a 3 Rockville mayor works in an- executive dining bank oftelevisions. room. “Youknowhowyou get a He felt a rumble and didn’t Penn seven Gloriosa ‘g saw on — iagon hadboonhit.Hetamed ae released petalaisenal night, but Rep. Ike Skelton, D- Mo., said Defense. Outside, 100 casualties in the building, “Wehad false sense of security. I don’t tended to told thewoundedwho know how you protect oy himthere appeared to be about — @ woman from these terrorist aitacks.” could walk only a few steps beforecollaps- CegumensUelisclipheted,and Setaiteaemiesrdity,2 JOYCE MOODY an Delta resident it will not be a few,” Defense eryoeibeadoi jookeaniat Sixty-four and Craig Quigley said Pentagon GanAirlinesFight.ha Boeing precautionsafterseeingthe can ‘787 en route from Washington second plane slam into the to Los that slammed World Trade Center. intothe F6fighteraircraftfromthe ee ete D. oe Guard burnunits... and could be seen flying over pect caterers the ingte building, one the world’s framt heard rumors @ Sec- largest, ripped through hijacked plane was headed three an five concentric utero = x Ng “We are at war, we are actually at war goon] bung cele ney iS «Rant {NuueLae : This is a 21st century war.” PETESTen BS . an z , Rescue workers assess the damage after a hijacked airliner slammed into a section of the Pentagon in Virginia shortly after the attacks on the World Trade Centerin New York. REP.CURT WELDON Pénesyivania Ropatlican dine Taliban Say bin LadenIs Innocentin Attacks *--« e e Wie’ ( fficials ins hic s e ° ist _ Abdel-Bari Atwan, editor of the Al-Quds al-Arabi bin Laden does not have the facilities to orchestrate rulin newspaper, said he received a warning from Islamic 8 St oup , me interview BY KATHYGANNON London. phones “We usually receive this kind ofthing. At the time baufpment. ‘we did not take the warnings seriously as they had name. oe in : We 's attacks in New York, Laden's but bin Laden escaped unhurt. Since then he has been forced by the Taliban rulers to stop giving : the . The only thing I can interviews and making statements. ; In Kabul, foreign aid workers were keeping a low it toi was little girl * . Watching President -Kennedy being shot while I ate my lunch. 2 i ... I literally was sick today. I couldn’t keep ye anything down. My hands . were shaking. - ewe kner’ changed today in a lot of ways, I hope we cam Ds join together as Americans and forget : about being Democrats and profile and security measures were heightened with Republicans. Let’s the spokesman for the Taliban's reclusive leader, Mullah Mohammed Omar, most expatriates being advised to stay in their homes for fear of retaliatory attacks from the United States should evidence implicate bin Laden. But Muttawakil said there is no fear among the * back ‘ get to being Citizens.” “Such a bigconspiracy,to have infiltrated in such a major way is impossible for Osama,” Muttmain told ‘TheAssociated Press in a telephone interview. He said “Since there is no reason for an attack and we are not expecting any reprisal attack we are not taking any precautions,”he said. A London-based Arab journalist said Tuesday that tack” onU.S. interests. retaliatedwith ablisteringmissile attack missiles into eastern Afghanistan, apparently training camps operated bybin Latien. _| i i Bin Laden, the exiled Saudi millionaire indicted in’ they would carry out a “huge and unprecedented at- After the attacks in East Africa three years The U.S. attacks killed about 20 followers of bin the attacks, he said: “We have andwe are now again in all its bombings oftwo U.S. embassies in Africa in 1998, has livedheresince 1996 under the protection ofthe ruling Taliban religious militia. Washington accuses him of running an international terrorist Y in August 1998, sending more than 70 Tomahawk .” Asked whether the the United States on charges of . The Taliban, who espouse a harsh brand ofIslamic law, have resisted U.S. demands to hand over bin We on and elsewhere in the United States were ‘froma’ tarin pointofviewsurelyalossanda veryterrifying in m “They are in Kabul, Herat, Jalalabad. They have training centers in every province of Afghanistan,” said one Taliban commander, who would not give his tried our best in the past and we are Muttawakil said nica oe Afghanistan has increased in recent months. aftertoawareheUnitedStatesnay WakilAhmedMuttawakcil, histicat i several commanders say that the number ofArabnationals in Afghanistan — Afghanistan’s hard-line nds of setivitien”the other Meanwhile,foreign aid workers and even Taliban Taliban rulers ‘suggestions that Osama bin Laden,whomtheyare sheltering, could be behind the fe terrorist attacks in the United States on 3 like this day in my life. “tsp eeu vexhogand uoreceted SEATSombatseveal sourscoe relate ittoiswhen I amine nm “We assault within the United States. threat seriously. ; im, but several sources sock neg Game i.” Atwan sh in 8 = say bin Laden has regular access to satelitetele s \\ such major fundamentalose o bin Lae, but dd not take telasayin Laden's communicationave GowSN't, Sanction terrorism ; SHAUNA KERR Islamic Community inUtah Condemns Terrorist Attacks BY PEGGY FLETCHER STACK ‘THE SALT LAKE TRIBUNE Utah's Islamic community, Sineunceentaramccs Joss of in the United States, and between Utah’s “We in the Middle our (Utah] “Weinowr[Uiah) communityfeel different > ty foe. from those who cheer in Pal- Setabeets Wecbertreebned ine. We strongly regret sondesanie acts. And weprayforthe and condemn these acts. And Tabal Hossain, apastpresident ofthe said, attack. I don't causecan suchan know whodid this, butIdon’tthinkany beliefwould it.” ™€ Prayfor thefamilies of the victims.” laneson loving towards me, an American.” theworld,” said Ritchie, nowdeanofthe business school at Utah Valley State College in “When one kein someth a = ee Such Seeee dent lifestyle getting its due,” might be those at the sight of “Tam angry at whoever’s done it. I hope we don’t have to go to war,but if we do, we do.” DEE GIBBENS Manti resident we < AT ", "parent": 27847048, "version": 1739896946566365184}, {"id": 27847056, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/bc/25/bc2521b1d77dd3d291522999260b89a3963fc25f.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/8f/e7/8fe7ec0ebbd3b904f2572e2d19cc432486619c46.pdf", "page": 8, "ocr": "A8 The Salt Lake Tribune “’m sitting here with shivers down my DAN WEILAND An American Airlines passenger at Boston's Logan Airport “J don’t think there’s - anyplace in America right now that’snot at Department Tuesday. ‘Chad Rachman/The Associated Press ‘They Had toBe Trained Pilots’ risk.” ANDREW HUDSON “~ Denver City spokesman Impact, collapse of towers show terrorists knew their target well “Wehavea fairly . cosmopolitan community. There are quite a few Muslims and Arab-Americans wholive in our city. I just hope there’s no retaliation or hate-crime activity thatfollows this. I hope we don’t see the rights that have made America great he weakened because of this. We need to be very careful in how we respond. We can’t iS shut down. We have to maintain, to hold our meetings, keep our cities and businesses going. Even though we want to have proper respect for the dead, America has to carry on and show these terrorists that they can’t stop us.” have collapsed because the weight on the damaged portion of the building would not have been enough to overwhelm a tower’s structural supports, engineers said. ‘The lower the planes could hit the buildings, the more damage they could cause. But the planes had to fly at a height of about 60 stories to skirt nearby buildings. The first tower was hit at about the 80th story. The second tower was hit at about the 60th. : showed know! physics in the attempt to make the hits as low as le,” said Ron Hamburger, for ABS in Calif., and a past president of the Structural En; gineers ‘To many who sawthebuildings: on television, collapse planned especially in the way that the towers imploded — tumbling in on themselves. But engineerexperts discounted the notion that DOUG THOMPSON Logan mayor “We're used to hearing about this happening in our countries, It was really shocking to hear about it happening here.” SHANTI SVRAPANENI Indian immigrant living in Atlanta . i Jerry 5 he Associated Press hadbeen planted Smoke and debris erupt from the South Tower of the World Trade Center as it collapses after the terrorist attack. around the base of the buildings to ensure’ 4 the “We havecriticized and we are now again criticizing terrorism in all its forms.” ‘would req charges around the building,” Ham- burger anyone. |*-~ many planning.” WAKIL AHMED MUTTAWAKIL upward of 1,000 would suffice to said Scott Demtech Taliban's foreign minister of experts. 20,000 11,000-gallon fu planes nental “Nopilot, even with a gun to his head, is fully loaded with fuel. ‘going to fly into the halfway to the core of Gustafson World Towers, [The terrorists] flew the through a couple with ‘ corridor fuel, spread the: GENE POTEAT President of the Association of Former Intelligence Officers _ kept Even in material, cause the. strength. ~ + ¥ ", "parent": 27847048, "version": 1739897727052939264}, {"id": 27847057, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/56/9a/569a8902d5eec718322c66b80a2ec6d4289aa3c1.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/53/21/532117d5f23014f77848ee4f1be5868d36b928e5.pdf", "page": 9, "ocr": "Security Plan MayGet Another Look 1 Continued i from A-1 4: aeiehieidecaution ested by the State Department only last . But the targets and methods of the attacks ap peared to catch U.S. intelli- SUSTUUPETADELETATPLIET TITLE EE IUTULELETTIRELEE i Seae Intelligence officials Tuesday that bin Laden may have used intelligence abilities against the United States. They said bin Laden used communications _ he knew were monitored to plant false clues about his plans. In the meantime, he switched to human couriers to transmit In Kabul the foreign minis i “We should do everything we can to increase security, but stretch from Ogden to Provo = from Kearns to Park City, we don’t want to do it will be protected bycircles of restricted airspace of up to at the risk oflosing the three miles in diameter. Restrictions will be in effect be- valuesofthe rest of the like this in place.” The venues, which will tween Feb. 4 and Feb. 24. The Olympic Village at the Uni- country.” tected for two additional days, Kennedysaid. The exact permitting process thatwill allowpilots to fly near Olympic venues has not JACK GREENE evaluated in light of today’s versity of Utah will be pro- von,hows after the ter Northeastern University’s dean — unparalleled in of criminal justice Ushismey Utah Olympic Public Safety Command head Robert Flowers was noneom- yet been established, but spe- some people.” If history is any guide, semittal, saying it was unclear cial certification will be necwhether planners would need essary to enter the airspace. curity funding constraints for more money, officers or Crew members will have to the Games may no longer be an isste. submit to criminal backequipment. “It’s too early to say, but ground checks andonlypilots ~ After the February 1993 this illustrates that some- with legitimate business rea- bombing of the World Trade thing like this can happen,” . Sons — such as TV news heli- Center, security forces and he said. “We will be asking copters — will be allowed to terrorism countermeasures were increased dramatically . ourselves if our plan is as fly in the zones. strong as it needs to be. We Salt Lake County Sheriff for the World University will be reevaluating and Aaron Kennard says the re- Games later that year in Bufmaking. changes if stricted airspace zones should falo, N.Y. The “Universiade” is second only to the Olympics be increased: in 2002. necessary. An event the scale of the “Mybelief is all airspace as the world’s largest multineeds to be restricted sports competition. lympics Atlanta’s 1996 Summer throughout, as was the case in ners must consider the range Nagano,” he said. “I don't ,Games organizers also received more Olympic security of possibilities from the low- wantto see anyholes.” funding in the wakeofthe 1995 Countered Kennedy: “Our tech sabotage of a light-rail train track witha pipe bomb to plan is excellent, but it re- Oklahoma City bombing and the now all-too-believable quires a lot of assets and the July 1996 explosion of prospect ofa hijacked airliner equipment,” such as radar TWAFlight800. But how muchsecurity is plowing into bunkers. of and staff to monitor the too much for the world’slargstockpiled: herve gas in Tooele. airspace. If security planners deter- est sporting event, where funmine they. need ‘additional damental principles call for planning can create an ac- help, Utah’s senators expect “encouraging the establishceptable level of risk for stag- that no expense will be spared. ment of a peaceful society “Tt is worth a review to see concerned with the preservaing eventsthat are primetargets forterrorists. But, whether we have committed tion ofhuman dignity”? “Whenthe bombwentoffin Greene notes, “nobody wants enough money to security,” to publicly admit there is an Bennett said. “I have met with Centennial Park in Atlanta, see eeeAnd the CIA, Secret Service, FBI there were a lot of recriminathreat can. never be and local law enforcement tions andfinger-pointing over Seance agencies. All have been aware why there wasn’t more secu“Thatetosay it, but it isjust from the beginning of the pos- rity,” Greene said. “In reality, going to get worse,” said Rob- sibility of an international the question had been raised “ ert Bunker, adjunct professor terrorist attack, butit is worth months before about whether of national security studies at going over the plans one more we should shut this park California State University, time. I'm not aware of any down,andthe decision was it was an international gatherspeaking at an Olympic secu- majorfinancial gaps.” Kennard said it might not ing place that should be open. rity conférence in Salt Lake Salt LakeCity is pans eve City. be enough. “Whatis the next big event to consider the Plans to restrict airspace over Olympic venues re- in the international and na- tween levels of cries mained after tional arena? The Olympics,” andlevels offreedom.” Tuesday’s attack, but the is- the sheriff said. “And I have sue will be a hot topic when expressed my concerns in Tribune reporters Kevin security planners meet next pleading for additional mon- Cantera, Frank Curreri, Jim week, said UOPSC Capt. T.J. ey. We're stretched very thin Woolf, Joe Baird and Mike right now [in the county]... . il contributed to this “We “have considered This will be an eye-openerfor story. 2 oRRP 3] TROATTITTITT TOROS ERTS PETTERS RESPERSTPRP TERT TIES i medical i ‘olunteer to Ia Tealso urged those whowear Islamic clothes, which cover their hair, arms think that characterization has to be completely re- exactly these types of situations,” Kennedy said. “It just validates why we have a plan Official Entry Form Geeared BB \"aeinne we Retr inainie: —— enereee©Cok in semeaeen, rene inet Boxed FrzenVegetables-one padiage [pie oe andi hadnt - oe tesa Sl oe tie Aca ~ onepackage iCet-onerci Sdadamow PiaCra onecan MacaWheShepSpeSat Soaddone 1 acoie Com=e 1 cat ne orParmesan reads ObElPasd” Seton ecSis Oseening | Ads!racy isgpedoas: ae raveVes test ‘bowes Be Oiaignatedtacts - one Wr ex can 2, eed Oat Centeae We scene the fee ofAber pote Soup ~anyHove Experience Simple Won ers September 6-16 Ay at ‘When you buy any two Frozen oe mcwireeen. OnteoBDSerna Us ADMISSION PRICES Adults $6.00 ‘Seniors 62 and over $5.00 Children 6-16 $4.00 Children 5 and under Free Season Pass $30.00 mA FAIR HOURS Sunday-Thursday 10:00 a. ~10:00 p.m. Friday and Saturday 10:00 a.m.-11:00 p.m, « September 6th 3:00-10:00 p.m.) For Fair Information Call 801-538-FAIR (3247) COMPLIMENTARY SHUTTLE FROM TEMPLE/SQUARE TRAX STATION TO THE FAIR. ¢) ¥ ", "parent": 27847048, "version": 1739902954645749760}, {"id": 27847058, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/25/da/25da9a93eacfd75ce330ee376220cb8bdb75e368.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/49/85/4985761669531a34a72a94fac2b67c9742df6f36.pdf", "page": 10, "ocr": "AlO EAS SN NS TERROR ; The Salt Lake Tribune Wednesday, September 12, 2001 Stranded Travelers FBI Mum on Pittsburgh Crash Ties Fill SaltLake Hotels Congressmen speculate BY MARK EDDINGTON, JOHN KEAHEY Farther down the hill wereheavy woods where police say most ofthe plane and the bodies came to rest. Coroners from around the state were at iie ep, help it is linked to attacks le As poses siren BY THOMAS FITZGERALD and DIANE MASTRULL KNIGHT RIDDER NEWS SERVICE They did not expect to be able to start their work until today. “Atthis point, we're not prepared to say it was an act of though it ap- pears to be that,” said FBI agent Wells who oshouted “We are being hijacked!” police, spokesman David Korzep. When those passengers will beable to continue on their way remained uncertain at press time. Korzep said the U.S. military is in control ofthe nation’s airspace until at least 10 a.m. MST today. Thatis the earliest the Federal Aviation Administration has said U.S. flights might resume. When they do, security will be at unprecedented levels. “jt’s going to make our lives hell,” said Henry Rosen, visitingfrom San Diego. “From here ‘on out, the delays are going to be horrible. There’s going to be safely. Meanwhile, hotels in downtown Salt Lake City — many of them already booked full because of two large Salt Palace conventions — braced for unplanned guests. “Between the guests who aren’t coming and those staying over because of the airport of Maryland. The crash site was 85 miles northwest ofCamp David. Later, during a conference call with ity dispatch centerreceived a call at 9:58 a.m. from a man whosaid he was a passenger locked in a bathroom on the flight. scorched and woods littered with plane debris and bodies trying to determine what brought down the Boeing 757. About100 statepolice troopers roped off an area aboutfive miles in radius around the crash site. It was unmistakable: a gouge 8 fect to 10 festdeep in a hillside. Kaysville Woman, Daughter Die in Jetliner. q BY JACOB SANTINI i ‘THE SALT LAKE TRIBUNE keting City Center. “We've been able to take care of most of our learned they had lost . What we customers.” many more Hotel Monaco manager Tim Estestold a similar story as he stood in a lobby full of people trying to make new lodging arrangements. As at the Marriott, televisions were set up to allow guests to monitor 15,000 pdase flights nation- developments. The nearby Shiloh Inn and wide and left 9,000 passengers stranded at Salt Lake's airport. smaller downtown motels also One ofthem, Elmer Wheeler reported full houses. “We're ofLas Vegas,sat on the ledge of oversold,” said Gina Bennett, the baggage carousel, wonder- assistant general manager at ing where to go and whatto do the Shiloh. However, outlying * motels in West Valley City and next. “Our flight has “been Sandy had rooms available. Visitors tried to make the grounded. We can’t renta car, and we are having trouble best of it. At the airport, Provo finding a hotel,” said Wheeler, Angels baseball’player Brent who was on his way with his Delchiaro ahd a teammate wife, Mary, to visit his seri- pondered an offer to stay in a ously ill mother in Detroit Bountiful couple’s mobile whentheir flight was diverted home. The Angels’ inaugural season ended Sunday when to Salt Lake City. Planes in the air did notre- they lost to Billings, Mont., in main that wayfor long after the the championshipseries. “I was supposed to be back FAA ordered the. nationwide airport shutdown at 7:45 a.m. attending the University of Kansas tomorrow,” Delchiaro said. “It doesn’t look like I'm going to make it.” Not everyone stuck around, though. Bay area resident Suzi Alexander and a companion booked a rental car and drove home. “I’m sort of anxious to get out ofhere,” she said. a4 were among the ney mes. By’ had to of the city’s major car eat saw today was a miserable failure of [airport] security: They're going to make sure there are no ‘more miserable land at the nearest , outlets were tapped out. eeee GUNSH SOUTH TOWNE EXPO 9575 S. STATE, SANDY SAT 9-5, SUN9-4 SEPT 15 - 16 World Trade Center in New York — American Airlines Flight 11, “You can’t believe We grandson. “We ‘athave to go, “The 3 Most CommonMistakes Knowthera “ight way” 0get pau 0 notinUaho:Medina Rubble is piled tack that killed a OLYMPIC HISTORY LECTURE SERIES Obert C. and GraceA. Tanner Humanities Center presents the second lecture in our ten lecture series. Olympic historian Roland Renson will present a lecture titled: in the aftermath of the deadly taroristatKaysville, Utah, woman and her daughter. <P \"© “The Cool Games: Winter Olympics 1924-2002” Purnace & Air Duct Will A Sk. Let us lig ‘any. Dénted a vieurea it 966-9366 Sey September13, 2001, 7:30 p.m. CUSTOM BUILDINGS jeerHal, WPRA Orson Spencer Hall, WPRA Auditorium ANY'S Professor Renson has a Ph.D in Physical Education from Katholieke Universiteit, Leuven, Belgium. He is the author several books about the OI including: The Games Reborn:The VII Olympiad, Antwerp, 1920 and co-duthor of the Olympic Games through the Ages: Greek Antiquity and its Impact on Modern beg Sponsored by: TheSait LakeTribune, theLawrence T. andJanet'T, Dee Foundation,Women’s Studies, theCollege ofHealth, Tanner Humanities Center, ee BUY THE “ © PLAYHOUSES: yam Quality at affordable Direct from manutacturer. Oallin 974-0725 Council, theColl the Officeofthe UniversityofUtah Vice President forResearch and the Officeof 3489 Sa. 1400 West we vacuum andbrush forthe Dest aiaas oie y to adverse See at's Talk. nara| OE OD ial CF uyour PILOT! 2400 Digital Minutes Visual er, CallNow! oe pilot light! Offer ends 9-30-01 99 for 23 only 0: month* NO LONG DISTANCE CH GES* “Free phone with activation on select rate plane, Call Today 1-866-WCOMNOW (toll free) ; (1-866-926-6669) COMFORT SYSTEMS Ldd USA INTERMOUNTAIN WORLDC Murray - 6322 South State St. 801-266-6100 agreement, free Nokia 5165 $e Vaaraprsman.bong nce charges for onl ed Nom your t § ", "parent": 27847048, "version": 1739904448402030594}, {"id": 27847059, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/3b/9a/3b9a495f2e0c502436f5c973a30e15bd55e78c6e.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/84/a9/84a981e106421d717d30c776c105c68c45626434.pdf", "page": 11, "ocr": "DAY OF TERROR Wednesday, September 12, 2001 © Utahns See the Devastation Firsthand BeehiveState residents describe in the middle of a perfect blue chaos in streetsas dramas unfold BY BOB MIMS ‘THE SALTLAKE TRIBUNE lapsed,” Eldridge’ added. “There was this city official who told me, ‘I wouldn't go any closer ifI were you; that second tower will go down, too.’ And sure enough, it did a moment native, said she was.on a New York subway when a fellow rider screamed that there had pregnant, got off the subway, ran to a and purchased a disLgetan po She was snapping pictures and spread. Shouts of“don’t panic” Smoke in a Blue Sky: Salt Lake City's Kelly Lear was watching the news of the apparént suicide plane crashes in Washington, D.C., when the second wave ofterrorist attacks struck the Pentagon and State Department buildings, just two miles away from her apartment. “lL. suddenly heard a plane, very loud and very low, pass right over my apartment building. Then felt the whole building shake and I heard an explo- sion,” said Lear, who moved to within a few blocks of the car- the nation’s capital six weeks nage when the second airline dived into the nation’s finan- wa “a.coupleofhundred yards mass of people slowed to a dent eventually made it back to his Times Square Marriott Hotel. In telephonecall from the hotel, sirensce be heard wailing in the background. “Trucks with tons of firemen hanging on were heading toward the World Trade Center area,” he said, adding that U.S. fighter jets were patrolling the skies over New York not long after the crashes. David Fletcher, who works ago with her husband,John. wat eee Ijustfelt adeep for the families ofthose inooe er and shock that anybody could do something so devastating to innocent. peoel Lear said. “Tt’s just ay filled the air. Eventually, the walk, and the Park City resi- pack in New York, Nathan Rafferty, director of communications for Ski Utah, had been paying his breakfast check at an eatery: several blocks from the Trade “At first I simply et what I heard was a bombing.I DA ala peoec after that ... office papers Manhattan, said it was “horrifyingto watch the Trade towers go down.” He had arrived for work about the same time the planes rammed the towers, meeting fellow employees whotold him what had . It took Fletcher two hours to walk the 15 blocks north to his home as the streets filled with stunned New Yorkers. “The look on their faces was like their whole world had dissopered and they were going to be changed forever,” he said. oieer ee for Parting Suite Barney and a Utah native, was on the subwaygoing to work at his office across the street from the Trade Center when the attack came. He never made it to work; authorities evacuated the underground trains. Stoddard watched from 10 blocks away as the two towers collapsed. ou was hard to realize this fas happening and that it waetatin: Tt looked like [the movie] ‘Towering Inferno’” he said. “{Then] people began panicking, running through the streets and yelling, ‘It collapsed, it collapsed!’ ” It took Stoddard nearly four hours to walk eight miles to his home on 107th Street, but he says the trek showed him New Yorkers at their best. Down- town, civilians rushed into the Trade Center area offering to help police and firefighters, and on his walk home he found More compassion: People offered drinks and use of their telephones. “T have to hand it to New Yorkers,” Stoddard said. “I've always found that New Yorkers on the outside are tough and unapproachable unless there is an excuse to be otherwise. “It’s asad dayfor new York,” he said. “[But] life is going to continue here. We're a tough crowd.” TheSaltLake Tribune get back to his Utah home. Copelandhad just gotten off a : plane at JFK International i aa I was on the Belt Parkway and saw the smoke from the first explosion; I didn’t hear it,” he said. “At first I thought it must be from a smokestack, an example ofNew York’s poorair quality. But the smoke filled the sky quickly and I knewit was something else.” Copeland soon found himself in a traffic jam on Staten Island, unable to budge for three hours. “The entire New York skyline is engulfed in smoke. It reminds me of the smoke that came off the fires of Yellowstone a while back.” As he watched convoys of firetrucks, ambulances and police cars arriving from nearby New Jersey to help with rescue , efforts, Copeland said, his emotions turned from shock to outrage. “We mustfind out who did this and hold them responsible,” he said. “We've been naive in this country we're immuneto international terrorism. We need to take swift and strong action.” With airports closed nationwide, Copeland said Tuesday afternoon that he was considering getting back into his rental car and driving west. “I just might keep driving until I find an airport reopened. Maybe it will be in the Midwest.If not, I have 4 long drive aheadofme[to get home].” Trying to Get Home: Greg Copeland,vice presidentofSalt Lake City’s Greenfield Logistics, was trying to absorb what he had seen andto find a way to eri aere Introducing Value Price 35 - 40% Discount ) every day on All merchandise ora. ganaoe hs enednapeabea price! tribute to the 58,178 who gave theirlives Diems(aeertee Little ad. Big results. Classifieds ‘It pays to read the fine print. Call 237-2000 and getresults. BirSaltLakeribnme(3)Deseret 7 All ", "parent": 27847048, "version": 1739897392068558848}, {"id": 27847060, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/e3/00/e30033a58366e0244acd26409996558a467ff581.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/28/48/28485e7eb84f362e5819ecb6eea470cbb66b1039.pdf", "page": 12, "ocr": "‘The Salt Lake Tribune THE WEST Wednesday,September 12, 2001 Homosexuals See LittleChange in Climate in Wyoming Not enough has been donelegislatively, ially since deaths of men, leaders say BYTINA SUSMAN NEWSDAY ture, this was a great-opportunity “to “demonstrate they. weren't going to bow down to outside pressure,” said Loffreda, linking the attitude to Wyoming’s main traits — its small population and pride,in its Old West atmosphere. Thelive-and-letlive attitude that Wyoming residents boast about translates, in gay views, to a “don’t ask; don’t tell”atti- LARAMIE, Wyo. — In a place like Wyoming, where the biggestcity has just 53,000 people and most towns claim fewer than 1,000,it is not easy being different. Few know that better. than John Little, director of United Gevaaaa Lesbians of Wyoming spends much of his the tude, Little said. That is not to:éay nothing phone helping gay kle the problem of has changed. In the weeks after Shepard's death,for which two with their stdte’s men were givenlife sentences, Little said there was a marked don't faeis finding his phone numiber. “We're the only. gay organization listed in the phone book,” notes Little, group was transformed from a mainly social groupto a politically active one in October 1998 after the gay-bashing murder of University of Wyoming student Matthew Shepard in Laramie. sfneréase in phone calls from ~ “hed of Wyoming said Loffrecloseted gays in Wyoming ask- da, noting that the student img the best way to come out in group has yet to achieve a high@ state with virtually no bars, profile presence on campus, “If you're different in any bookstores, cinemas or cafes way here, you tend to be aoa catering to gays. According to the national ent by yourself. census, Wyoming had 30 same- you're different because a sex couples in 1990. By 2000 it like Shakespeare or whether had 807, an increase of 2,590 you're different because you're percent and the biggest in- gay,it’s not like you can go out on the street andfind someone crease of all 50 states. Still, Little said that after the like you,” said D, Claudia Thfailure of the hate-crimes legis- ompson .at the University of lation,the flurry of phonecalls Wyoming’s American Heritage from ‘gay people eager to come Center. “T’'m little bit disapout died down. There was no pointed in a way that. .more startling jump in membership people didn’t come out, because in gay groups, not even in the as long as they're afraid, then university’s gay and lesbian all of us area little afraid.” One person who did come student group. “It’s not as if a cdllective out in the post-Shepard days, light went onin the collective and who is now one of the a shift if attitudes, I think that as it.” tion Ssae have recognized the of various groups, inpast she has formed the Wind River Country Initiative for Youth, which aims to end discrimination based on sexual orientaChamber her a public service award for her work. “I don’t know of another time when an open lesbian received recognition for bringing this type of work to a community in Wyoming,” East said. “If you need a snapshot of cnting aiet Sx paieees tion, it was voted down 43 rather than earlier, similar resolutions that failed 7-0. Most striking, said East, was the in- anti-gay violence in a way that made people talk about it,”said Cathy Renna, spokeswoman for the Gay & Lesbian Alliance er Defamation in New STCOMSeNUNMO 4 GREAT EVENTS - 4 BiG DA What Has Changed? Three years after Shepard’s slaying captured international attention and drew condemnation from a slew of personalities, ranging from Madonna to then-President Clinton, those who were caught up in the case wonder what, if anything, has changed for gay peopleliving in the nation’s ninth largest state geographically and. its least populated, with just 490,000 people.It is a question more on their minds than usual given the slaying in June of another young gay man, 16-year-old Fred Martinez Jr., whose battered body wasfound in neighboring Colorado on June21. “I see Fred’s death ... .asa clear sign that there is much moreto be done before we can live free from fear and hate,” Shepard’s mether, Judy,. said last month during a week of. vigils in memory of Martinez. The samegay activists and organizations that streamed into Laramie after Shepard’s murder have also-been in Cortez, Colo., following the case and pressuring police to declare it a hate crime. A former Cortez resident, Shaun Murphy, 18, was charged with the murder of Martinez, an openly gay memberof the Navajotribe whodressed asa girl frequently and called himself “two-spirit,” an American Indian term for a i b e e OFF NULayy gays, lesbians, cross-dressers and transgendered. Cortez is about 500 miles from Laramie,but the similarities to the Shepard crime are striking. Both occurred in remote, tranquil towns in rug- gedly beautiful states that boast wide open spaces and claim to offer easygoing, “live-and-letlive” attitudes. Both victims were young, openly gay men beaten savagely, allegedly by young white men from the ht OSs Ta aa same area as their victims. Both were left to die in. open fields no more than a half-mile from the nearest homes buttoo far to be seen or heard by anyone. Both were foundlong after the attacks: Shepard, 21, remained tied to a fence, covered in blood, for nearly 24 hours; Martinez was found five days after he disappeared. MaaROTate roteyee PURCHAS EIER & F Tray AZT sre CARD ‘ ALESHUTpy Legislative Audit: Perhaps mostsignificant to gay organizations, both killings occurred in states where legislators have resisted, against mounting pressure in the wake of the Shepard case, laws that would ; mandate stiffer penalties for. hate crimes based on sexual orientation. Suchlegislation died on a tie ~ vote in the Wyoming Legislature three months after Shepard’s death, a move that would seem to defy expectations given the widespread revulsion to the crime but one that locals say wasnot surprising. “Their answer to being accused ofacting like hicks was to behave even more like hicks,” said Little, blaming the bill’s failure on lawmakers’ anger over whatthey saw as the unfair portrayal of Wyoming as a conservative backwater. Rather than bend to critics and approvethelaw, they stubbornly refused to budge, said Little and Beth Loffreda,a professor and faculty adviser to the University of Wyoming's: stu: dent Gay, Lesbian, Bisexual, ‘Transgender Association. “To people in the Legisla- (anew ) Ses) | WARDROBE eeeceaSy coed aeWh oy uo pes oa ra MEIERANOFRANKaits,com ease Exchange or pe ee oon wah “MEIER & FRANK aan exit 108 OFF All the ng” choices ANEW ACCOUNT % vf ", "parent": 27847048, "version": 1739897364544487424}, {"id": 27847061, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/21/d0/21d03e68eeb1773f0c91bfc10d89ec75010eb138.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/a1/6a/a16a61b736fd50ec9113d689e403ab9c6906a82b.pdf", "page": 13, "ocr": "The Salt Lake Tribune WORLD We September12, 2001 x Diplomats Visit Detained Foreigners BY SUZAN FRASER tore offher arm and chin and injured MartistgroupeatTeadayttcarled the prisonersto end. thelr hunger out the suicide attack near a main ‘ike. Istanbul square to avenge the deaths \"My last advice to’ those on the on a yearlong hunger death fast is to end theiraction. . . . 8 aid workers choose counsel for Taliban trial THE ASSOCIATED PRESS a protesting Turkey's new maximum security prisons. ‘The attack Monday killed the ‘Thestate never bargains,” he said. ‘Some 200 prisoners and their relatives said they will fast until death to bomber and two policemen and.in. DUS authorities to abolish anti terrorismlawsandend thenewprison. jured 20 others. ~ ‘The Revolutionary People’s Liber- system, which inmates say isolates claimed responsibility for the attack in a telephone call to the Cologne, ‘The government has said it will never allow a return to the old system. ation Party-Front, or DHKP-0, and thom vulnerable to Germany,office of the weekly maga” The fast began in December after 4 for the magazine, force inmates to abandon the large Pakistan. After weeks of trying to see their itionals, Donahue and felfrom Ai which is close to the group, quoted the wards officials say inmates were run- “t0 DAY and two soldiers died in. the Seeseamae Minister Rustu Karim Monday's bombing was the 14th caller as saying the attack was carried out to force the Yucelen issued a “final warning” to « ays the ning like training camps. Thirty in- suicide bomb attack in Turkey by leftKurdish militants during the years. eae Se, Afghan, © ° The eight agreed to appear before the Taliban’s Supreme Court as a groupdefended by the one lawyer. He could be in Afghanistan witithin days, Donahue said. Meanwhile, Heather Mercer, 24, ‘was reunited with her mother, Deborah Oddy of Lewiston, N.Y., for the first time since her arrest. Oddy arrived in Kabul with her husband, Delmer,earlier Tuesday. Mercer's father, John Mercer of Vienna, Va., has been in the Afghan BLK. Bangash/The Associated Press Deborah Oddy of Lewiston, N.Y., mother of Taliban detainee Heather MetCer, arrives at the United Nations guest house in Afghanistan on Tuesday. capital for more than two weeks. During his daughter’sfirst court appearance Saturday, he held her hand through most of the one-hour proceeding and gave her a hug anda kiss as she was escorted away. Dayna Curry,29, the other American being held, was also visited Tuesday by her mother, Nancy Cassell, ofThompson's Station, Tenn. The foreign aid workers, employees of Shelter Now Interna- tional, a Christian aid organization based in Germany, were arrested early last month, along with 16 Af ghan workers, on pi i c . = The other detained aid workers are Germans George Taubmann, Margrit Stebnar, Kati Jelinek and Silke Duerrkopf, and Australians Peter Bunch and Diana Thomas. Introducing Qwest DSL with MSN Broadband. How did Qwest® make the MSN network even better? We made it faster. A lot faster, From now on, you never have to wait for the best Stuff on the web — just point, click and you're there. Qwest DSL™ with MSN Broadband lets you see the web like you're supposed to — always connected and fast. Qwest DSI, with MSN Includes: Qwest DSL: 1 MSN Internet Access © Lets you talk and surf on the same line. Downloads in seconds what used to take up to a minute. * Use of DSL modem Isn't slowed down by extra users like cable modems. There's even 640K DSL available,too. Call Qwest now to get oneof the most powerful:combinations of speed and Internet access available. To order, call Qwest at 1-800-362-1850 or visit www.qwest.com/msn Home office customers call 1-877-453-9420 SCRIPT tao] + ; ‘ j b ride nD r me west. ==se ry depending on hover fators seamen P your home, computer performance and configuration, ratwark or Internet congestion, Wed sites accessed and 24-monthieee ‘then dates wil testes comuses cheon ane ene ‘onlyfor personal = Ber Fs SULRS ISS TS LEAT TE seas iis iii ats Ferya;. HHH (3 ~\\ ", "parent": 27847048, "version": 1739896958475042817}, {"id": 27847062, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/8a/55/8a55a08fd2b2ff1d17e5cf348e9ae1c762b1d85e.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/2f/33/2f3388def43d03dbca8e264f5f993d2b2f139c9f.pdf", "page": 14, "ocr": "The Salt Lake Tribune NATION/WORLD Wednesday, September 125m hes: EPA Mistaken About Arsenic Cancer risksgreatly exceed. pevigaiys. stnan ineEPA thoueht estimates scientists warn BY JOHN HEILPRIN ‘THE ASSOCIATED PRESS In the EPA working to study costs to local report rein- ie o>megetee eee The of 50 parts per billion (ppb)ofarsenic indrinkingwater has been Suspects Are Charged After Yellowstone Manhunt, Capture ‘THE ASSOCIATED PRESS YELLOWSTONE NATIONAL PARK, Wyo. — Two men arrested after a 12-hour manhunthere last week have P as was an unidentified teen-age girl with them when they were Matthews said. _ spotted. and arrested without incident Friday evening, Matthews said. ' The incident prc clo- sure ofthe park’s east entrance and of visitors. c agan are wanted for a string of ABSOLUTE AUCTION which police say they stole at and‘Thomas J. O'Flanagan,19, of So 9575 S. STATE, SANDY ieeeries, peneanal SAT9 - 5, SUN9- 4 ‘The men also are suspects in peared before U.S. Magistrate the assault ofan elderly couple peang =in Mammoth Hot SEPT 15-16 Clip ad for 1 _Discount -= Limit one 4their home in New Brighton, park: spokeswoman jinn,Police say the men beat CheryMatthews Sai. the husband and wife; then aiding and abetting a burglary, driveway. The suspects were \"GUN SHOW SOUTH TOWNE EXPO They welrecharged with stole a pickup truck from their. GARAGEBY ESPRIT CONST, INCLUDESCONCRETE FOOTING ae[ECAR] COMPLETELY SULTONvOUREvEL oT. CALL 801-557-7313 ol ‘SarahCoombe Customer Service Rep. Call 233-THIN (8446) Positive Changes of Utah FPF FF FFF FEF FFE ETF FFF SEF eEV EFF FER VYY 7200 So. 411 West Suite 300 Thinking about getting a home equity loan? Thinkfaster. > No aldsing costs, fees or points: > interest may be tax deductible. > Approval in ten minutes or less. > Qualify with little or no equity. > Seven days only. ~ 801-6717990 ‘ 801-968-1693 usbank.com MODEL.ON (QUALITYWORKMANSHIPSINCE1906 MODELON DISPLAY 1474 SO. 700 WEST ", "parent": 27847048, "version": 1739897325547945986}, {"id": 27847063, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/2a/92/2a92103797b8137e299c8a2fb0d673620d4c0616.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/67/79/677900089b1feea290d3445efd8cc68e9c38757f.pdf", "page": 15, "ocr": "The Salt Lake Tribune WORLD : Al5 12, 2001 Iraq Claims ItHas Shot Down Second U.S. Spy Plane ‘U.S.says unmanned aircraft is missing . BY SAMEER N. YACOUB eSattack slow-moving Amerioe ged surveillance ee BAGHDAD, Iraq—Asecond unmanned U.S. spy plane has been downed byie Traq in less than a month, Baghdad said Tuesday, following American reports that Iraq wasbeefing its ability to strike U.S. and British aircraft no* fly zones over Iraq’s north and south. AUS, ‘said aplane was missingand its loss was being investigated. The official Iraqi News Agency reported that wreckage ofthe downed aircraft —carryadvanced equipment” — had been found. it did not mention any pilots. : ae eee et) a.m. near the southern city of Basra, 350 miles south of the capital. “The plane was coming from great Iraq and free Palestine,” according to the agency’s report. Last month, Iraq claimed to lostin Iraq in the 10 years since U.S. and British planes began patrolling “no-fly” zones — except for a “friendly fire” incident in 1994. governmentforces. The southern patrols also provide early warning of potential Iraqi military moves to- used to provide the American’ enemy with information con-. cerning our installations, vital sites and our air-defense formations,” the news agency said, quoting an. uni | spokesman from the Iraqi Air Defense 5 The Iraqi spokesman said the plane was “shot down in connaissancé plane in the Basra area. x The U.S. Defense Department acknowledged losing a plane in that area, but said it was unsure whether it had been hit by hostile fire or had crashed on its own. The Pentagon has said that plane was the fitst U.S. aircraft fighter jets mistakenly shot down two U.S. Army helicopters over northern Iraq, killing 15 Americans, fivelragiKurds, three Turks, two Britons anda Frenchman. The United States and Britain have been patrolling Iraqi skies to protect Shiite Muslim rebelsinthesouthandKurdish Iraq considers the nofly zones violations of its sovereignty and has stepped upits efforts to .shoot down allied planes. In 1998, President Saddam Hussein offered cash rewards to any Iraqi military unit that shoots down an enemy warplane or captures.a U.S.or British pilot. rather than high-performance Kuwaiti territory and it was. have shot downa Predator re. fighterjets. Morris said the Predator PlanetookoffearlyTuesdayfor Iraq. The unaircraft, which iscontrolled from land, later Tuesday patrolling in the area,hesaid. r Tuesday, the Iraqi agency reported thata U.S. spy insurgents in the north from ‘Then, two American F-15 ward Kuwait. Morris, spokes- man for a U.S.-British military iask force in the Gulf, said coa- lition forces had lost a Predator , similar to the plane Jost last “We have lost contact with our aircraft,” Morris told The Associated Press in “There is an in goingon. . with regard to the Predator’s disappearance,” he. ee the assumption that the ie has } Lt gone and are trying to figure out why it went down and how it went down.” - and systems, while also adopting a strategy DigitalChoice” 350 Home-Brew VodkaKills - 33 in Estonia . i death: toll from a batch of homemade grain alcohol ' the number ofinjured to 64 with more deaths expected. Most victims. consumed. the ie | 350 250 (after agreement) $29.99 Price ~*29.99 re“ ole‘eliethe victims FREE *'. bought the “salaviin” — which Included Minutes Local Mobile to Mobile Minutes between Verizon Wireless Customers Night & Weekend Home Airtime Minutes 3600-—— mailin rebate ith annual ending ‘Baltic Searesort eae miles south of means “secret vodka” in Estonian — because it was cheaper than commercial spirits sold in licensed stores. The home brew costs only about $2.a pint. +3000 Oye Tee- lee aonal | Only $35 monthly access with annual agreement Audiovox 135 Digital Phone veri ONnwireless VERIZON WIRELESS COMMUNICATIONS STORES MURRAY Fashion Plaza WERTICALS prt:aWinchester St., o yh in) OFF! fora2614137 OGDEN saa ae ——ya ae: Boro2843 OREM Unsl, Ma AtZoEran SANDY South Towne Mall East Entrance, 2nd Level, Near ZCMI i 801-576-9290 WEST JORDAN Jordan Landing Plaza 7203 Plaza Center Dr, 801-280-3388 ee oo boraoigene ; AUTHORIZED RETAILERS UGLY GROUT? Phones and prices may vary by retailer ‘SALT LAKE CITY Cottonwood Mall 801-272-3010 ‘SALT LAKE CITY Fashion Place Mall 801-892-4204 ‘SALT LAKE CITY Valley Fair Mall 801-965-0363 BUSINESS SALES CUSTOMERS CALL 1-877-720-3109 FOR AN APPOINTMENT. feerektionvateen rounded to next full minute. Unused arntbape. Serves rt sca ot wet ‘Mobile: For cats on our network '3000 mitten, standard mi WipesCoo We1:59 ais Satan Socworsnn last. ©2001 Verizon Wirless. Sear ", "parent": 27847048, "version": 1739895538927534080}, {"id": 27847064, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/fb/3d/fb3d68289a989ced5dc478080ba854b885d20a49.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/47/83/478319b0d17ccc6b4c3e3cb099e3ef80a09daa75.pdf", "page": 16, "ocr": "‘The SaltLakeTribune NATION Wednesday, September12,2001 Alleged McDonald’sThief Donated $1M errsa>ene + ‘i Winning ticket sent. six in the recruited \"SipaTsoactos cause SRG eee to research hospital; Shadroui said. the “Instant se ee eee plain white envelope payments to continue ‘THE ASSOCIATED PRESS a postmark and no return McDonald's verified the $1 ATLANTA — A man ; charged much as $1 million, the indict- the ring’s members with mail Monopoly contest, waived con- more than $20 million worth of pieces redeemed pac aceBo hog pi .. Jerome “Jerry” Jacobson sent the Memphis, , hospital the winning game piece has been receiving the payAments since 1996. Jacobson, 58, was among 21 Jacobson distributed winning game pieces to accomplices who releemed or Hospital, CNN reported ment said. & According CNN, cae sources confirmed that million game piece from its Marketing Inc, embeziled parently, a million giftto. SekChieaa Remain ap- for:20 years. to do,” Shadroui said when asked if bq joent Gferme sources said Soone ee ee ee mailed game piece as Riker company : : _plans'to stop the payments. | ; Monopoly a litte extra . : Sthie homeelayo Yates is being held in the psychiatric unit of the Harris Prosecutors have said they will seek the death penalty. In put off for a week. They were told to return Sept. 18. Yates, 37, is accused of two counts ofcapital murder for the deaths of three of her children at their home in June. Prosecutors say she methodically drowned all five childrer: in the family’s bathtub. Defense attorneys say their. client was suffering from severe mental illness, = Sec! Dllcae homicidal birth of her first child, but “blew it off.” used by the doctor. : Classifieds It pays to read the fine print. Call 237-2000 andgetresults. heSaxbeneCZ)Deseret “T’ve lost 56 Ibs. with Hypnosis’; B] “It’s been amazing!A year later | still don’t want sweets.With hypnosis, my lifestyle changes have These minutes Free,Screening Call 484-SLIM (7546) get around. 941 Saade 2500...°39= Real Nationwide Long Distance Included. BaycoLe and ex; ienced any ofthese health problems, call us immediately so ‘we can consider your potential claim against the drug manufacturer. Call to anywhere inthe county from onpuhire on out nationwide network of over 300 major metropolitan areas. Yourke rightshave timedeadlines, s0call today(open7 days'week) 2500 minutes = 350 Anytime Minutes +250 Night & Weekend Minutes, toll free from anywhere in the U.S. at 1-800-THE-EAGLE for a with a one-year Sprint PCS Advantage Agreement” free consultation. We practice law only in Arizona, but associate with lawyers throughout the U.S.to help people across the country. : No deposit. Most customers can choose any Sprint PCS Service Plan betassy & OSBORNE IE-EAGLE, (1-800-843-3245) °°. The clearalternative to cellular: www.li WS wb tires Headaches? Stiff Neck? We can help in 2 aie AH Dr. Les Brooks is pioneering dentistry today. With state-of-the-art equipment and a specialized staff he is able to treat many ofthe symptoms that plague us today. These symptoms include migraines, headaches, tension in the neck and shoulders, numbness in the arms and hands and not sleeping well. Ifyou or a friendhave any ofthese symptoms, please give us a call for a free consultation. } treatmentis guaranteed. Dr. Les Brooks, DDS 806-505-5500 Toll Free > a) wi , ; Figmgt NPEcore re employer. ee ‘Simon torun recruit a cohort to cash it in so eres veeeee game $50,000 a year enve- McDonald's ‘The indictment alleges that prosecution and defense Judeonly after he had failed to stands by its gift and has no since the late 1980s, Jacobson, director of security for Simon cused of stealing millions ina near date ig the sn eee tamepeeeeia others to redeem aie “@SprintStore ThePcSContr mS ‘To.orte yourphonewith free delivery, wm, Satan ‘omen 1857 Sushi Stats Sooet 75-6500 auumen 0. mere ysaee Downtown Salt Lake City ‘590-1077 =. rectoial) ", "parent": 27847048, "version": 1739897659531984896}, {"id": 27847065, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/e1/98/e198290847749661abea5957ca81dbefb9b3855c.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/4b/a3/4ba35d2868dba10882eeb6b4fb68e366f0805dff.pdf", "page": 17, "ocr": "‘The Salt Lake Tribune. NATION/WORLD Wednesday, September12, 2001 Falun Gong Followers Strive to Bring Attention to Cause Age self-help group, the right of the people to peaceably assemble and petition their government for the redress of grievances. And they are tosoar paren Se is Web — a wellepring to humanity. Cheng cause at fairs and festivals around self-immolation RhodeIsland. She and her colleagues might have been staged by the government and was contrary to the said the have snagged Falun Gong features on local cable TV, maintained a Website and petitioned town governments principles ofthe Falun Gong. This is, in any event, a movement that has rippled more dramatically through international politics and diplomacy than any run-of-the-mill cult around thestate for recognition of the, or protest group. he makes his first state visit to China For Cheng, the proofis in the pudto Cheng, who has returned to Rhode Islandaftera five-dayfast. The Chinese government asserts that the movementis an evil cult, as evidenced by the public self immolation ofseveral practitioners in China this summer. Li Hongzhi, the Falun Gong founder who now lives in New-York, has raised eyebrows by describing the practice, in part, as a response to the threat that aliens pose Falun Gong. The next great goal of the followers is to catch President Bush's eye before next month. Buttheir momentary aim lengthsto protest its suppression. She is rather small, according to Eugene Cuiof-Atlanta, thefirst of the hunger strikers to arrive Aug. 17. He fasted for has traveled to Geneva, Hong Kong (where she says the government. de- the rest. ding: Falun Gong has so improved her life that she is willing to go to great nied her entry at customs), and now to the hunger strike in Washington, seeking news coverage at every opportunity. She paysher own way,she said. She teaches weekly Falun Gong classes at Roger Williams Park and she touts the 11 days, longer than Cheng and most of If more protesters want to fast, he said, they will simply appear at the scruffy park across from the Chinese Embassy. They will stand their watch against the persecution and they will move on. And theywill pass the word on the Net. Televis For advertising information, contact your NAC sales representative ", "parent": 27847048, "version": 1739896947151470593}, {"id": 27847066, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/62/0e/620eabbf729ec2fe6313db3bcc24493b6488f365.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/99/f5/99f5406912a669b01b92c4e3d78be8c49bd47602.pdf", "page": 18, "ocr": "ain bo OUR VIEW. Bloodied But Unbowed falls on the Middle East, butit is unwiseto jump to conclusions. As in. any criminal investigation, Americans must wait for their government to develop solid evidence and see where it leads. ee eee THE PUBLIC FORUM they cherish. ¢ In years past, a relatively obscure town like Salt Lake City would seem an unlikely target for foreign terrorists. That will change next February, when Utah's capital becomes the biggest little city in the world for the 17 days of the Games. And now some additional disruptions will be necessary, of course. 'The already-tight security planned for Utah’s big event might be tightened even more. Complacency was theally of those who defeated airport security personnel Tuesday, so Utahns and their Olympic guests should be prepared for whatever reasonable inconveniences are necessary to ensure the Games are safe. That doesn’t mean a wholesale suspension of civil rights, for that would give terrorists another victory. Butit might mean more metal detectors, more thorough checks of travelers and their baggage, and extra Fea This will require more than the cooperation of Utahns and Olympic visitors, however. The Olympic secu- rity team still needs about $12.7 mil- lion to fully fund its-plans, which might warrant an upgrade once the lessons from Tuesday's tragedies are sorted out. Congress should waste no time in appropriating whatever funds are necessary. security who do their best Oe iain ene al himselfbyhanging on the outfield face orjumping aroundon seats, the ‘staff is professional, discreet and patient with the ignorant. The facility is clean and well-kept. The restrooms are spotless, spacious, plentiful. On a hot day, you can retreat to the cool coricrete of the concession areas. There is always a breeze, and you have a view of the game even as you standin line for your shake or hot dog.It doesn’t get much better than this! Yes, the prices are higher than a fastfood joint, but that -is today’s norm for a sports facility such as this. They have to prepare provisions for a crowd, and must sustain a loss on unsold items, due to small crowds on The Gift of Life You may have watched Tuesday’s months. events unfold on national television “@ Contracting malaria in the past broadcasts with a sense of helplessness, yet it is within your power to’. .~ help. New Yorkarea hospitals are be-. donors have whittled that percentage down even more. The following criteria will rule you outas a donor: wien there i important work tobe since 1977. Getting a tattoo in the past 13 oe fellow’ Americans in New York need your help. Give blood. @ Living in certain parts of Africa ‘This park has so muchto offer, fora low ticket price! A Salt Lake Stingers game is one of the few luxuries we longtime locals have left to enjoy without crowds of rude, obnoxious nouveau-Utahns ruthe experience. The “Californication” of Utah has irretrievably spoiled so many of our recreational escapes. This field provides a minor league experience that takes one back to the old days when people weren't so self-involved, and no one had a cell phone. TRACY BIRDSONG Salt Lake City Dodge City confidential. @ Keep it short. Concise letters developing a single theme are more likely to be @ Please type and double space. @ Letters are condensed and edited. @ Because of the volume of mail received, not all submissions are published. @ Mail to Public Forum, The Salt Lake Tribune,P.O. Box 867, Salt Lake City, Utah 84110 @ Our fax numberis (801)257-8950. @ Our e-mail address is letters@ was to financially his Army battalion-sized family without the subsidy of Utah taxpay- ers, a. case might be made for the rea- i sonableness of his lifestyle. Was his:sentence. archaic, as suggested by° Hall? Unless Utah law is predicated on the civil code of certain Arab na-'' tions, which legally permits plural marriage, I think the United States is eee: further fallacy is evident in. Half ohoervations \"Todate, 0 se haslegalized homosexual Nehemiah Clarifications In a recentarticle, “Getting Over law reform which endorses, Pee and respects the unionof two peo} owners using the Nehemiah Program and now living in the Dream of homeownership. The-article clearly illustrates how many. hardworkingAmericans, who makea steady income, just don’t have the thousands of dollars required for a home’s down payment. However, there are some statements in the story that require clarification. The article states that, “most sellers who participate in the program inflate the selling price of the home.” This is simply not accurate. Home sellers participating in the Nehemiah are not given a chance to “mark their homes up” beforeoe through our program. The mechanics of the program work like this: A home buyer bids on ahome. Heor shethen qualifies foran FHA payment in touch with Nehemiah, typically through the real estate broker, homebuilder or lender. Nehemiah, tapping its funds, gifts the down paymentdirectly to the buyer as a credit in escrow. The seller reimburses Nehemiah after the escrow has successfully closed. In addition to being a ie attractive program for the buythis program is very positive for theetes who gets to movethe asset quickly and usually nets the same amount of money, even after Ne- which millions of “disposable” kids ««> are missing today. 3 a Pipe Dream ‘The decisionto build and deploy ar missile defense system should ulti- <5} mately be made hed informed elec: torate, through their elected repre:ar sentatives in Congress, This decision== should bets on ascarate nd en tinent information. It should not mark John Glenn made in 1961 (Ri + chard Jepperson, Forum, Sept. 2). ts believe that if the American a) had more information about the sys; tem’s intended mission, Pte sm TheSaltLakeTribune UTAH’S INDEPENDENT VOICE SINCE 1871 , PAST PUBLISHERS + Dominic Welch John eh a W,Gallivan (1960-1983) EDITOR James E. Shelledy EDITORIAL PAGE EDITOR Sn heinws Randy C, Frisch Note “Tati Lamu, 198. eh. SALT LAKECHTY ,tit ot ms raesimen tases DAVID KUHN . Salt Lake Citya [E Tuesday’s ‘terrorist attacks un- doubtedly have some jeople ques- tioning whether Utah should paintitself with a bull’s-eye in five months and host the 2002 Winter Olympic Games.It is more important now than ever, however, that the Games go on. As Gov. Mike Leavitt pointed out Tuesday morning, the disruption of Americans’ plans and dreams is the terrorists’ goal. Canceling the Olympics would hand them the victory Public Forum, ‘please include your full name, signature, address and daytime telephone numbers. Information other than your name and the city in which you live.are kept & Games Must Go On Missed the Point Itseems the controversy continues ~ in the case ofTom Green’s conviction and jail sentence. Bruce Hall’s letter’ (Forum, Sept. 3) totally misses the point of the conviction. Green was: convicted not only Bs Sieasy,sie by itself an illegal act under federal’ and state statutes, but for filing fraudulent welfare claims. If Green -' i Those: tasks must be undertaken immediately. While this ugly new reality will require “Americans to adjust their lives and someoftheir nation’s security policies, they also should remember that the United States remains proud, strong and free. The people thisreat nation wil pause today and in the coming days to grieve for the many victims of this outrage, the innocents andthe heroes whodied trying to rescue them. But, Americaiis never have surrendered to intimidation, and they are not” about to start now. e We Welcome Letters @ When submitting letters to the i forces of the United States to lash out in anger unless the can be positively identified: Even then, only the guilty must be tracked down and - brought to justice, and only the nations that harbored them must be singled out for punishment, because that is whatsets alawfulsocietyapattfrom terrorists and despots. For Americans, one ofthe challenges of this awful time will be remembering that. In the immediateaftermath ofthese horrors, the word “war” has been invoked in commentaries and reporting. Comparisons have been drawn with Pearl Harbor. Certainly the scale of A Fine Field Howvery disheartening it was to read John Paxton’s “Odious Ballpark” letter (Forum, Aug. 21). It is hard to imagine the behavior Paxton must have demonstrated to have initiated the response of security personnel at Franklin CoveyField, to the point that the experience becameso negative for him. Weattend as many games as possible, and have been supporting the park and local teams since the Trappers, Gulls and Buzz years. Every time we visit Franklin Covey Field, I marvel at the fine quality of this facility, which we are so lucky to have here in Salt Lake City. The view from, the seats alone is enough to make the trip worthwhile. The mountain panorama takes my breath away. Bring an out-6f-state visitor, they are completely wowed by the incredible sight. Fromthe enthusiastic and friendly older gentlemen whotake your ticket at the entrance, to the long-suffering g Sept. 11, 2001. So, they now will give international terre: i there isoutrage. Yes, there is profound sadness. There is a primal need for revenge. The nation will move collectively through the psychological stages of grieving. But during that process,the people oftheUnited States must bepatient with themselves and ons eae pane ", "parent": 27847048, "version": 1739896098712977408}, {"id": 27847067, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/21/53/215336bb6f587443e0a66f5583af4c54b7a18572.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/ba/6b/ba6bb777bb9340e7844a2338095653f0dda9d538.pdf", "page": 19, "ocr": "The Salt Lake Tribune OPINION dinesday, 12, 2001 + Al19 State of WarExists Between America and Those Who Oppose Our Values CAL THOMAS Islamic Association for Palestine eeeee rem renecerene Former Secretary of Defense Casper Weinberger told Fox News that an attack ofthis kindwas notbelieved side a light bulb and placed on a subway track could also lead to massive deaths in New YorkCity with far less allowed them to come here. The first obligation of any presidentis to preserve, and defend to define what that means in light of this act ofwar. He mustrally and unite the nation. What those responsible do not understand is that acts like this can bring the country r in waysthatnothing else can. ' LOS ANGELES TIMES SYNDICATE It may be more than coincidental that on the dayofthe terrorist attacks, the official Palestinian Authority daily said, “The suicide bombers of today are the noble successors of their noble predecessors . « . the Lebanese single retaliatory strike will not suffice. There needs to be a decision by nations everywhere to rid the suicide bombers, who taught the U.S. tay actionscotempatedor aken FBI led. joint task force on Sept. 6 which raided an office building in Ri‘Tough words will not be enough. A The building houses Arabic Web sites. Among them is the site for the solely trotters from within this country. Those people should be found, arrested and prosecuted, their organizations forcibly disbanded and their members i all Japanese-Americans ing Pearl Harbor. Most ofthe 6 million Muslims in America are law-abiding citizens. But some aren’t and they have successfully used the freedoms that are nearly unique to America to undermine the very government that Marines a tough lesson in [Lebanon] . and then, with no preconditions, they threw the last. of the remaining enemy[Israeli] soldiers outofthe [se- curity] zone. These suicide bombers are thesalt ofthe earth, the engines of history . . . They are the most honorable people among us.” Anyresponse to this day of infamy should begin with peoplelikethis. Issue of Asylum for Women Raises the Immigration Stakes Even Higher ANNA QUINDLEN WASHINGTON POST WRITERS GROUP violence that:has long been inflicted on one part of the population by another as a matter of course. Rodi Alher,tried to abort one oftheir children bebeots Beat and hit her until she ‘But the issue of asylum for women raises the stakes even higher, because itiines unwelcome light on the was a private matter, that the police would not arrest her husband. In May 1995 she fled for her life to the United States. She arrived here at a momentof great promise and great confusion. Standards created half a century ago extend asylum to those persecuted because of race, religion, nationality, membership in a social group or po- immigration authorities not to deport litical opinions. One category glar- her, and the panel lambasted her naingly missing from thatlist, ofcourse, tive country, Mexico,forits “tacit apis gender. Asylum standards have re- proval ofa certain measure ofabuse.” mained frozen in the amberof a time But an immigration judge in Chicago when silence about gender politics recently denied an asylum claim by an prevailed and asylum was understood Indian woman who says her abusive as a remedyfor unpopular views, not husband,after beating her so severely devalued human status. that she needed to have a hysterecto-' As a result, women who seek asy- my,was let go by police because of the lum because of sex-based persecution intervention of her own father, who the marriage. seek it under the rubric of member- had ship in a social group, as though genOpposition to this sort of asylum derwere somehow less definitive than claim relies on the old floodgates arrace, religion or nationality instead of gument that has been used over the more so. And they have made some years to try to curtail admission ofeveryone from the Irish to the Vietnamprogress. Karen Musalo, the director of the ese. Butit also covertly minimizes soCenter for Gender and Refugee Stud- cietally- permissible persecution of ies at the University of California’s women. One anti-immigration activist Hastings College of Law, whois rep- in California, Barbara Coe, charmresenting Rodi Alvarado, was respon- ingly describes these asylum claimsas sible for a major victory in 1996 in the “You get a punch in the mouth, and successful asylum claim ofan African you're home free.” Coe is not only glib woman who would have faced tradi- but, by the numbers, wrong. Only tional genital mutilation back home. about1,100 ofthe 55,000 asylum claims But cases involving domestic violence in 1999 were from women claiming have been more equivocal. genderbias. Musalo is also keeping tabs on the The numbers in Canada are simicase of Rosalba , rvantes, lar, which is signjficant because the who claimed asylum based on life- Canadian Immigration and Refugee time of beatings by her father. A fed- Board has adopted progressive guideeral - appeals court ordered lines for asylum claims that urge officials to consider the “subordinate status” of women in manycountries. Asylum standards, according to the board, were based on “the experiences of male claimants” and ignored the special conditions of women around the world, ranging from compulsory sterilization to honor killings. Canada wasin an excellent position to do the right thing, both politically and legally. Unlike the United States, it has a Constitution that expressly prohibits discrimination on the basis of gender. This situation cries out for the simple: common-sensical remedy of adding genderto thelist of categories that constitute reasonable asylum claims. Countries that permit the abuse, sexual assault, even murder of women are as guilty of a form of systemic persecution as those that make life unlivable for members of a hated religion or political movement. In one asylum case involving a Haitian man, an appeals-court panelrecognized that the issue was the “relationship of the weak to the powerful.” Clearly that is true of Rodi Alvarado Pena andthose other women who hope the United States will offer a safe havenfrom lands in which simply being female is reason enough for torture. ", "parent": 27847048, "version": 1739897360975134720}, {"id": 27847068, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/ac/0c/ac0c166a5476201fe7a20ecf37deda8236f49b92.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/50/d2/50d2a9fc7d65765874308d617ab568aac744f405.pdf", "page": 20, "ocr": "0 OVeTmMen he 2 POS Sa ake bun WORLD JOM bout 18 08 took off, the te : MSCRea 0 Aus eee eM mREMCe BYTE ASR a SETHETH Newspaper Scrapbook Contest Entry Form heGaltLakeTribune (A) Deseret Entry Age Level: Ages 12 and under Ages 13-18\" __Ages 19 and over Name (Clearly print your first and last name as you would like it to appear published) City *Parent Name State Work Phone Zip E-mail Address Iperebygv parson te NetpaperAgency Corporation (Te Salt ato Tibune wad Desert News) and HEADLINE MEMORIES\",to pubteh repr ‘such Newspaper Agency Corporation Published,| will receive recognition next to the published piece. Your Signature “Parent/Guardian Signature This permission ", "parent": 27847048, "version": 1739897455181299712}, {"id": 27847069, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/28/74/28745d9366800d573acecc3349eb36d68f3f9c1d.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/06/9f/069f4cb8744d31ada456bd12c664db269a1a761b.pdf", "page": 21, "ocr": "@ CLASSIFIEDS GORDON MONSON B-7 e- Sports Fields Sit Silent Gamescalled off following attacks FresnoState Can Upset * Go Bulldogs. Tvebeoome‘what— a who is Not, tena in the traditional sense, All the homers outthere who professional and college prac- tices halted, France thatbaseball wiped out a whole day of regular-season “In the interest of security BY RONALD BLUM dropped it films and sharia Sports came to a standstill Tuesdayin the wakeof terrorist Baseball schedule postponing of a stoppages, it was the first time since the Allied invasion of play. THE ASSOCIATED PRESS attacks in New York and Washington, with Major League BCS Facade SEPTEMBER12, 2001 full Baseball, with just 24% weeks remaining in its pennant races “season: and teams fighting for playoff games forthe first time since DDayin 1944. The daily grind of berths, was the most immediately affected of the major sports. Aside from work been baseball commissioner Bud Selig said. The NFL, criticized for playing after President Kennedy's a David J. Phillip/The Associated Press assassination in 1963, said it wasn't sure whetherto play this See SPORTS,Page D-3 EnronField, home of the HoustonAstros,sits empty Tuesday. Major League Baseball postponed its entire schedule. NCAA Schedule Uncertain JORDAN 3, BRIGHTON 2 cover teams and not so opaquely root for them to win — or, for that matter, lose — can andshould stick their credentials in their ears. There is no place for either fundamentally premature position, alped they exist almost every- wat evenfor columnists, who are bythalonper from Mertonoat ied ir parameters alemer for, actually requiring, a pointofview attendant with commentary.Ifthat view is bent by monolithic, built-in bias, by oe or Conferences will decide today how to proceed in hate, from before jumpstreet, ji then, =role is skewed, the standard low- wakeofterrorist attacks ord Bulldogs. Vil neverforget tis day Leawa beatwriter from a Salt Lake City THE SALT LAKE TRIBUNE newspaper run onto thefield followeeecon porter covered The Mountain West Conference will decide today whether to cancel its schools’ sporting events for the rest of the week, in the wake of Tuesday’s catastrophic attacks on the World Trade Center and the Pentagon. coach. Next moetonbond viet With the Federal Aviation Adminis- tetany hil tora blas tut : tration having grounded all flights throughoutthe country until at least 10 a.m. MDT today,leagueofficials are un- id not belaing. Go Bulldogs. I reallydon’t care about Fresno State, att its football team, about its players and coaches. Other than quarterback David Carr,I don’t know much about them. I know — acity I have visited, is nota where I would like to live. No Pullin bias, Ijust dislike the town. certain whetherathletes, fans,officials and others involved in the events will be able to reach thesites. They also are considering the propriety of playing games, “We'll play the games if it’s appro- priate,” Mountain West commissioner Craig Thompson said. “They’re just games.” Already, the Brigham Young women's volleyball team had to postpone a trip to Hawaii. The Cougars were eqi scheduled to leave for a weekend tour- They come c from the Western Athletic Conference, a league the com- nament Tuesday morning. Commissioners from all of the major college athletic conferences are scheduled to hold a conference call today and could postpone all of the weekend's sporting events, not just those in the missioi like the Mountain West, has no easy, or automatic invitation to the biggest postseason bowls because those commissioners and businessmen whorun the BCS want their postseason money divided and shared among their designated few. Nametytn teams from certain predeter- Mountain West. “I’m for whatever the leadership of the country is for,” UNLV football coach John Robinsonsaid. San Diego State’s gameat Ohio State was postponed until Oct. 20. The BYU football team is scheduled to play Mississippi State in Starkville, Miss., on Saturday, and Utah has a game From the beginning, the BCS was acounterfeitfor a true playoff, an at the Air Force Academy in Colorado overdue idea that, like in every other NCAA sport andin Division IIfand II,is doable. Not only is it doable, it would generate enor- mous amounts of money. The problem arises in how that money would be divided. The powerconferences would rather have a lower total take, as long as the profits are tidily _ grubbed among themselves. Fresno State is possibly en route to goofthings up. Brea Nae way the BCS is stacked against the Ryan Gatbraith/TheSalt Lake Tribune Brighton's Ryann Scrafford leaps over Jordan's's Amanda Feigt. It was the Beetdiggers who leaped overthe Bengals to take over the top spot in 5-A soccerwith a win Tuesday afternoon. Jordan Is New No. ference officials. The Ute football team practiced Tuesday in part, coach Ron. McBride said, because they didn’t know whatelse to do. “This is a new experience. What's the right thing? You don’t know what the appropriate thing is because nothing like this has ever happened,” said teams from smaller conferences, FSU, ifranked high enough at regu: lar season's end,will have tobe in- BY PETER RICHINS behind the defense of Jennie Haertel. ‘THE SALT LAKE TRIBUNE coach Jesus Goyzueta said. “She SANDY — Jordan and Brighton each “She was the hero of the game,” Jordan stopped everyone in the back. To me, she’sthe best defenderin the state.” Haertel was putto the test against Brighton’s speedy striker, Liz Bogus, Brigham puto itself in a similar role. 24 Cougars find a way to beat No.17 Mississippi State, on Saturday nightin Starkville, they also might mess with the BCS,if they keep winning. Go Dogs. Go Cats, Go all y'all, Whatever complicates the BCS machine,I’m for. ‘Two undefeated teams,one from the WAC, pe a the MWC,woe make for a sticky postseason scenario come December. Wouldn'tit bea to watch Southeastern Cinbneedtheiastion and BCS architect 4-sport star balancestime everybody eo whatis vs, what should between volleyball, tennis both teams. haul, way offfor » «it will. that some ing Bengals 3-2 in a back-and-forth match of 5-A’s two top-ranked teams, And as in that earlier match, the second-ranked winnerclaimed the No. 1 spot in TheSalt Lake Tribune's rankings. Jordan earned the No.1 ranking who was rendered ineffective despite aggressive attacks from the left wing late in the game. With Haertel marking her, Bogus took a shot that Jordan goalkeeper Kat Armstrong punched overthe crossbar. After the subsequent corner kick, Bogus centered the ball to Rachel Springs, Colo. The Utes haveoffered to drive to the gameif they cannotfly, Thompsonsaid, but nobody knowsif Air Force will want to hold the game. One of three major military academies, the Air Force campus was “on lockdown” Tuesday, according to con- McBride. The Utes will prepare as if Saturday’s PREP COVERAGE gameat Air Force will go on, but Mc- Soccer roundup,rankings B-2 Volleyball roundup B-2 Bride said he would certainly support a postponement..““Who knows what's go- ing on? We don’t even knowif[the threat is] all over,” McBride said. “You have to worry aboutsafety before anythingelse. Fillmore, but the shot spun just left of the goalpost. Brighton (7-1) “is a good team, no question,” Goyzueta said. “They have a lot of players with a lot of heart inside.” See JORDAN,Page B-2 Football doesn’t even register when you're talking about keeping your team and all the people safe.” Other coaches were uncertain about how to proceed. “It’s hard,” Colorado State football coach Sonny Lubick said. See NCAA,Page B-3 Mustangs’ ThatcherIs a Jack-of-All-Sports BY LYA WODRASKA ‘THE SALT LAKE TRIBUNE HYRUM — As soon as Mountain Crest’s volleyball and tennis schedules ere eeeae resi‘strategy. Not how she will beat her opponents, eee es en a ee ball in the winter and running track in “Butit’s a lot of fun to get to know so the spring. She is the two-time Class 4-A defending state champion in the 300 hur- manydifferent people, and I just love dies, and last year won the 200 and helped Mountain Crest win the 400 and 1,600 relays. She is busy throughout the year, but the fall is the craziesttimefor the 5-foot9 Thatcher, when she plays tennis and playing sports.” ‘Thatcher has been participatingiin volleyball, track and basketball since het shmanyear, but didn’t start play- Both teams play region matches on ‘Tuesdays and Thursdays, often at differenit schools, ing high school tennis until last year. ‘That was the sport she played the most growing up,joining several ofher 12 siblings who played. Before tennis was the family’s sport, it was‘baseball. Her father, Dave, played baseball at Weber State and her older brother, Aaron, was drafted by the Minnesota Twins as a pitcher in 1992 before injuries ended his TENNIS Tribune prepgirls rankings B-3 volleyball team in the afternoon,then stays to hit tennis balls with Swan, or with her younger brother, Alex, who also plays for Mountain Crest. “Tt was well worth some inconve- nience,” Swan said. “I lose a lot of good players to other sports, and to have Katie makes a huge difference to our team.” ‘Thatcher’stennis stroke is similar td ‘some of the movements she uses in volleyball, such as serving, so sometimes > one sport affects the other. See THATCHER,Page B-3 Z ma OBITUARIES B-5 ", "parent": 27847048, "version": 1739897323175018496}, {"id": 27847070, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/c6/41/c641f97260550a7bbd2d335e8683dffcbe8d338b.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/03/ff/03ffd92e0e98d963ce4fb16ed1212fe180e05c89.pdf", "page": 22, "ocr": "rata en beth ddim PREP VOLLEYBALL Hillcrest Stays on Top of Brighton Esiason’s Offices Destroyed In most cases, the Jazz would _have to add Quincy Lewis in a trade to balance salaries. were stroyed in Tuesday'sterroristattacks on the World Trade Cen- ees {All five employees never got “into the building and were safe, Boomer Esiason said. ‘The foundation’s offices were on the 101stfloor at1 World second wii leoi Wells had 24 assists now 1-1 in league. Ce- hig fag eT PLEA i i gee - et win. for lost Thursday to Yevgeny Kafelinov at the U.S. Open, 6-4, 6-0, 63. Ben Lomond 15-13, 15-7: At Tooele, the Scots took advantage ofa poor serving night by the Buffaloes to get the Region 11 win. fi Cam-' of the At Ben Lomond, ‘ Hunter o: At , Candice Soovtout for Oglen in egies 1. Hunter, Cami Beckstrom scored Stn maton tie Bear River 11, Grantsville 0: Taylorsville goaland CrystalCoon Each team hon and Stephanie Willis scored for Timpview in Region 6. At Bear River, Alicia Binggeli scored three goals and Magen ‘ Cottonwood 5, Kearns @: At Cottonwood, Lindsay Lauro Payson Spanish Fork rallied on goals from Brina Eyre and Cassie St. Joseph 5, Rowland Hall 1: At St. Joseph, Brianna Bauer is23in Region 3, _ Provo &, Springville 1: At Skyline 11, Granger 0: ‘At Provo, freshman Jana Davis ai Fenton scored scored twice. Both teamsare$1in of goals for Skyline (5-0) ina Region 6, Region 8overGranger (0-5). \" Spanish Fork 2, Payson 1: At Roberts two. Waterford 8, South Summit ©: At South Summit, Tricia Holmes scored five goals in Waterford’s Region 14 rout. “kept backing up and backing up Ashcraft tied things less than a and backing up, and then, she minute right side of the penalty box and a shot against the inside of the hiit the left side of the net in the right post. But Jordan quickly second half. “I just had this window of opportunity, and it was *Wesome,” Lofgren Rochelle said Jordan's stemmed from a take in the winner Hooverasaisted on the goe ther mis- Jordan got the first ereeaeee Lindsay Lofgren, the defense preteen defender Carlie midfielder sald the Beetdiggers (6-1) need when more preparation for the post- than attacking ‘evened the game when Hoover scored hersecond goal. Despite the win, Goyzueta minute, eee Set season,” Be Calendar . 18 Continued from B-1 = Brighton coach Kathy Kuhn i Mor dist. >. : (~TheSaltLake Tribune later. Rachel Fillmore scored Lofgren tookhershotfromthe after thebreak for Brighton = Tops Brighton scored it,” Kuhn said. za . i 0) | J rdan A 3858 over koa OO faloh cur Lehi 13, Carbon 0: AtCarbon, GermanakAngasinte Melissa Clayton and Marlee Holi Doel and Janae scored forSt. Joseph. HeHdiii2hd Meit HHifI‘ii i li(i#ml the’ ", "parent": 27847048, "version": 1739897289372073984}, {"id": 27847071, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/d4/85/d485f9f35708178757c9e725c589921cbcf8f0eb.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/e7/f6/e7f66ab87190cf89d7f3b7518af0520538d3f8f9.pdf", "page": 23, "ocr": "The Salt Lake Tribune SPORTS Wednesd McCaffrey Is Out for Season Seeees makes a ‘The NFL closed its offices after the terrorist attacks on the Word Trade Center. ' McCaffrey has more than one game in @ sea- linebackeror free safety. son during his 11-year career. fol- lowed by a quick and the third week with replacement aches and catch, then gets flattened by a cornerThe collisions Doctors at Swedish Medical Cen- _legduring a two-hour operation day. He is expected to be sidelined for six months. Despite strained and numerous other terplacedsteel rods in McCaffrey’s Itwasascenethe Denver Broncos and theirfans had witnessed many times before. cee renee or inevitable consequences, “Losing a guy like Eddie is a big for injury and hit to our team,” Broncos linebacker a brieftrip to the time, Bill Romanowski said. “He's one of officials. Glenn Decision Wil Wak decision on receiver Terry Glenn's effort to long suspension by the New England wil come later in the week. “We'll have to wait another day or our most valuable players day in two,” Glenn’s agent, James Gould, “the ground, clutching his left leg in “Itried thhelp him andoneof day out, year in and year out.”McCaf. replays showed _frey’s leg bent grotesquely after hit. ‘Tuesday's peseed. Inthe wake ofterrorist attacks in New York and Washington, the NFL the New York guys tohelphim .” Denver tight end said. “Youjust think he’s laid ting Williams’ thigh. Sixteen years earlier, Monday night viewers saw oesup. He sald, My weight nae. ken.’ He was calm about and I ee eee + Sheen legtapao NewYork ois tnmesant, rg league spokesman Greg Aiello said. asccond” McCaffrey, one ofthe NFL's most Association offices in were closed by midafterpersonnel were focusing _ A No Talks for Officials i L the oe the three years, will miss the rest ofthe season No talks are scheduled in the near future in the dispute between the NTE aie esc oficial. Vikings: Minnesota added tight end Matt Cercone to their roster and pgghrongaedfetacd ee ey oveea ton vex Gams ce Monday night. uled to this ’s games, the second week ofthe regular season _fensive line by signing tackle Tom Barndt. during Denver's31-20 vic- S C officials are sched- Jets: up. oe Bill Rose/The Associated Press Denver Broncos trainers help support the leg of wide receiver Ed McCaffrey after it was broken during a pass reception in the third quarter Monday. ‘AA rts ti = Hialt Postponed Sporting Events : ttomertwmatamce., _Sparts eventscanceled postponed because of Tuesday'sters attacks: possibility, but that would require extraordinary reschedulte volleyball match with Mesa State as scheduled in Ogden. Thursday’s home soccer game with Sie is alleos ekeDaas already postponed its event . 5externDele The Thunitend t soccer at tesone oy whether oe gardingae week’s events could WUtah State: The Big West Louisiana-Monroe was moved to SChedules May comertvnininewsven Monta. After Attacks Tasers ae Continued from Bet atl Gove acnay dg, Pau until Oct. 47. [Baseball — All 15 major league games scheduled and all minor league baseball lane The Giego Witte Ses. Yankees game @ Continued from B-1 “ pele eee College football commission- 1 College Football — Saturday's game between Miami and Washington has been eee 24. The Ohio and North Carina polonr earner dag gtg Lar ahead. It could come down toa < “It's difficult for all the coaches. decision by USU president KerThere’s no concentration level mit Hall. games, with a decision expected Diegoon Saturday. when there'sall this going on?” ers considered postponing the weekend's entire schedule of aseariyasfoley.re pene it three on ‘The PGA canceled ‘Thursday’s starts of the World GolfChampionship andtwoother Nationals one temporary rescheduled for Saturday. The Penn State-Viginia $ . Buffalo, UCLA B R € d eatrange through the weekend. The Aggies UNLV tonight, sires the play football independently, and Mountain West's decision’ re- Whatsoever. How can you be The Big West postponed the thinking aboutan off-tackle play pais netel emer e UG ursday) and Long If the MountainWestpost Bach State (Friday). Stillin ACC canceled eens ‘Saturday night'sArizona State-UCLAfootball ive to question are soccer matches season, their scheduled oppo- tion to cross country and golf have the same free dates. Extending the season is a W@ Weber State: The Wildcats played ‘Tuesday's women’s pones its games, it ee Bald or Thinning MEN/WOMEN WANTED - vers feu Tain, A Wt aa velo aes re wt tect eBOnt psn sore ond wea panes scheduled Tuesday and today. Southiand Conference canceled five volleyball and try to finda time to actually play against _ Delaware them: Although most teamshaye Wisconsin-Green Bay as part ofa an off week before theend of the tournament in Ogden, in addi- nee rare Iotabeeen a ages tbe examples ofthe Great jook we achieve for scheduledforTuesday. nents your hair restored to the way maiches Tuesday. All sports events in West Virginia and at Amherst and Limestone 1 Goll—The PGATourcanceledThursday's starts the World GolfChampionship feeteetGerona, Oe certainly won't meets. Bp lx (peaend byron pone frtoatka a dod at ‘St. Catharines, (Carling Huricanseta postponed stat of tainingee carp url Wedheedey.Ontario, Germany's = CROSSROADSofthe WEST GUN SH ee enee against playing a game (Horse Racing — ‘All live racing around the country. Calder Race Course, Lauirel Park and Pimlico Race Courseclosed at least today. Soccer — The U.S. Women's Cup doubleheader scheduled for Tuesday. Four aeeeen eaten hk Ge. ieee eyed em ‘z Hill e. E i ste g Ale 5 i E File E 3 E g BE & Yankees. Bullpen coach Art Kusnyer,outfor a morningstroll, looked down Fifth Avenue and stared at the cloud ofsmoke. “All of a sudden, the whole tower just collapsed,” he said. yoy ifyou ually,you will have bree wants look, for just the cost TT HAIR RESTORATION aad SOUT H TOWNE EXPO 9575 S. STATE, SANDY SAT 9 - 5, SUN9 - 4 SEPT 15 - 16adult Clip ad for $1 Discount - Limit one Call for information: 262-8870 150 Worldwide Since 1973 5525 South 900 East ° 315 ALUE “All those poor people. It was hard to watch.” st ett venta with four special Utah Jazz: mini-packages featuring the best teams in poles5carota We the same great seats for and if you buy more watgin ine, ne, evi have prety ist he pcs plvek you'll uaify for a spetial bon us.Peacareeiedne See eee startine AT JUST $9°° A SEAT Late (CL ary Thatcher Track Is Her Best Sport ‘@ Continued from B-1 “Some days,I can see her tennis swing in her ,” Karaghouli said. “It lribune Prep Tennis Rankings ‘Rank Schoo! (Comment 1, Stylin CLASS 5A Detending champ retums all ts singles plsyers 3. Viewmont 4, Hillcrest Davie favorin \"Huskies ‘Darts havea 1 havesomebite alm in ernis CLASS 4A Babi now at No. 1 1, Coat No.3: 2 Onm 3 West inS-A, now 4-Aheadache Sweptby Leopards, butdrt loseeasy 4, Plemaant Grove Vikings wore second a yearago, want more this tne ‘5. Mountain Crest Should be in prime form by state 1, Oboe Great chance of 2 Grantee &. Ogden twee in a row | as one of3-A's best ‘Hashighexpectations forstatelournamant 4, <hadge Wemwortel Boasts 25 playors on its tener 5 Pak Katie Thatcher {an most players you'vebeen Sauntthebon aod shotat winning region again.” * Ofall the is her best ‘Thatcher participates in, italy tobe hey focus in ealops.Se was ranked in the top ots Fa en an eee wa ight for Lo css2A 1. Watartord Ravn haveplorty of aotorp fortouth 2. Meet nevercanbecountedout 4 Win cigs ridth your op a aial eaeoch: an ea Stal, Yseand menage PMdon't feel alikeecm very mach ‘Thatchersaid her athletic achievements, “I Binawih mye ned certain things.’ ‘Shecarries a3.75grade-point averageand isa y “It’sfan meto watch her, butI know itcan be streseful at times,” said her mother, Kathy Thatcher. “Last year was her best academically, so I don't worry about that. It seems all thereally kidsdo: , because they don’t have a lotoftime to waste andgot righton their: work. I know she isn't wastinga lot oftime.” lwodraska@sltrib.com ‘ x y§ NOW ON SALE! Come On,get INtoit! call 325-2548 )? ", "parent": 27847048, "version": 1739896960684392448}, {"id": 27847072, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/8d/58/8d585c23aae3682548bad193a14d419d46803a1e.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/94/67/94673107765417a22962c20685e6ab356e7c5e43.pdf", "page": 24, "ocr": "™ : BA : oc Se ‘The Salt LakeTribune SPORTS Wednesday, September12,200t Somers erm tT i. ane # eaniiadinc. oc. oe MondaysGames Mariners Angeis 1 a fate . 4 : . : ; : ees —_—_— ‘ : z ; ie Dry,Pain 64°. pmtetaiees = i faeha ‘Atber 2 Homa, 62,7466 mate : One, ekUrnMa « ’ . a * ical | 2 Femento tamhe 4 Green Gua + ‘Seman1D : ‘ Manna2S Gemee 3 Ceara 3 = 2 ed am OP —tewhaie 1. LOB— ‘Beene (12, Onde ae Fomawies eH RE BS 8 3000 8 Vamsi m9 9923 room r4 4 Caper ‘opm dees. +att100 listional League EastDion WL Bet GB SS 225 5 Pumbie % 10021 NewYok ow ne SS a8te ‘Young Fist Fister, Second, Sarkcee; ‘Third, Culbrath, T—$:08.A—20,511 (45,050). (CentralDivision . Wil Pt a 4S 2 —an Rangers Lb 1 Se Rese ican: sue eee baat AT\" Wom 411 1 Ommd 4210 Pabugh Be 3 2 Kaied 4 02 0 Gambit 31 212 Medigae 4 00 ON 000 Fammoth $01 0.NGeme 6 121 Send 3:00 0BWmm 1 000 Nearer 3 00 etme 12) aint Sams Mowet 3 00 0lagt Magu 3°00 0 Tepmes Azone Seirmmaco ae 4011 ‘WestDiviaton wl Coorage 83 011 mee ; no Bames, Bngham, 2245. 12 Kem Hyman, Scone— 1, Vanei)3Ea i A NOS 17.2, @ © 47 18% West3,Bound2 President's Cup y-Chicage: Bouter France, rer. red Rouen ; fon Malone Sjong(6), Beljun. Schaken Netherands, det ALABAMA 8 4 wess a wD ‘Sarge Saysian, Ameria, det, Jule’ 8) 6464. wove WoL T PGF GA MichaelRussel,United 475 7 2B Croat, 789),68. 13:7 11:19 63 5 8 7 3 8 i H 6 seen R a NOTE:Threepointsvictory,onepotfor Marius United States, andTuomas Katola, Finland, 7-6 221102 ‘NowYor Toronto TampaBay ‘GROUPH . ‘kos (Greece), 4:45 Tae Earepeen Chmaplons League ee % 7 387 HM ee LokomatMoscow «0.01111 Be Los Angeles (Adams 12-6) at San Diego (Middlebrook0-0), 8:05 p.m. ee — Minnesota Chicago: KaosOy 5 7% 58 6 mm 54 8 WHITEHORSEaToh, NM, 7sn. Fonds ol ho Boge Bain Bash hl ‘Saturdayona5-HlometercourseatBogusBasin WoL Pet GB SiResortinidaho. — ‘Boys indiviqual Results — 1, Grad NOMREGION WASHING: 10 West 1% cain 1h a tation Roe 18 NohTexas 23% Green Sa Calfomia KANSASSTATE RUTGERS: 9 25% LouisianaTech FLORDASTATE 0 MANESOTA 10% GuoyiTieh Baye ie. 3% a By Central Michigan 4 8 SANJOSEST. Newlin fe s hahaa ‘Sunday a 1, Shine 2882, Taylrsvle 251.9, Cot INDANAPOUS - 3 4 : —e pai TDAERE ke Ona ‘68—vordan Bata, Skyine (won play; DETROTT se ke JeremyPack,Skyline;ChrisGresh,Cottonwood. ‘Coltonwood. 71—Dalon NasonSie: Mocaelien Tajo, he ‘Resultsofa Region § meetat Mountain Dell eTLT GrGARe Oo1221 001221 oorrid wwurtue 1% 24 {erwood 22.4; Hunter822.5, Granger 346.6, TAMPABAY 010120 Boavicta MARYLAND Results of a Rogion 2 meet at Rose Park oacame Favor |, ealMedi(Span)2 Bor. Dormund DynamoKiev 2 CEN. FLORIDA. = Monument WL TGFGAPS ASRoma NotreDame ‘Colorado: Fassia, del. Sander Groen, and Vadose Ula07(6),64.02 NEMEC \"Moscow(Russia) 1, Anderiacht 5&8 Sogn ‘WestDivision 104 400 722 Ce aes ‘Ramon aes 1 ng 208),735p.m. 0 8 30 % ConteDitisic Pet GB — x-Seatie Dpto ee % 7 so — — Batis curi Fate tonitety (Svein ct stepaieadiocss tal wwe 8 ey 8 oe SaTE (43,682). ‘South Alrica, and Jim Th ‘mas (2), United Stats, def. Paul Goldstein, R ER BB SO Myete me 6 3 We Te Petorsek 7-5, 6-1. det. vo Karfovic, 1% Kesticey 21 ‘sre 4 nec 3 Uh 2 8 Glaniuca Pozzi, aly, det. HarelLevy, isra-.. -MlamiOtio 44, 75,64. *) WAKEFOREST Mikhal NEBRASKA Youhny, Pussia, 75,57,63. oe Mitek ARKANSAS SO.CAROLINA i aaa Ou Reames atone (nk bee (12; STejada Ball sou, NO.CAROUNA PrrseunGe ‘ARFORCE oa FLORIDA — Fit sama tan MAMA, xGmiooo wksCy Te Ai The) BIRT Toms om om om-1 Cte oe m7 Ape(1).Tes1,and1 , LOBTras aut 15 Westem'rey < ee a Ss WoL T Pea GA ye - SST BS WY BOS eR Ss Sem 7HSASR 862 B28 = 5 (ContedDivtion ea on eae ee | 8) Ok Ses th Hae wns Sea ORS ee RY eluate coorenas Menechino> 300 0 MICHIGAN, Pao eeNoreae Tensis a bidieee ‘ 62 predicted winners in CAPITAL’ letter. Last ‘Aeexendre Simoni (6), Brazil, def. Nikola NEWYORK. CAROLINA 2% 3 GreenBay NewEngland OAKLAND SEATTLE. “M 3 Yok SEVOREMS Gy SenFanid ate 1,Enst318,2(ie)Maray,Bounitugta.4, uamtents a PTSBURGH 7 Woods Cites 382 5, Oympus341.6, Hinhand autyone — 46.7, West 362. MY Convsone bios tooncane 3000 ” The most WHENEVER minutes™ Neighborhood* ~ WHENEVER minutes™ 3000 7M 15-1061 ———aa THN ‘5853 SouthRedwoodRoad 71-9085, (Crossroads Mall,Food Court 399-2065 ale8 Riverdale Rend mom, ] Sere ‘Loge, 1433 North Main: Sede 110 TISASTS 4-888:STREAMS(787-3267)| voicestream.com = OcWoeless Se PowerHouse ‘Woreens Exc. anajonsm FredMeyer Co Business customers call 866-VSTR-B2B for details. arbitration provision, Offersubjecttochange earn Leeds tartean'd See OF prevent emergency calls. ", "parent": 27847048, "version": 1739897120638369792}, {"id": 27847073, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/13/ca/13ca29e2f26f07b4cf5eb1a2f1a8983f12d6d2a0.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/42/94/4294567c66155a89c54c5079fecaeede3a097f8a.pdf", "page": 25, "ocr": "' calli ; : . i nie f fe |i ifzi : ERE i! ‘ gf Ea LES 82 oF = : @ a8 a Eli gg EE | 8 25 ‘Sandy,son, Sep. 7, Cottonwood Hospital, Salt Lake City. Hospital, Salt P. a Bryce, West Valley City, Sept. 5 Valley Hospital, West Valley iu Btalte Fe i EF al? § if 2 &.. Frees: I ; f BS nae 4 ely was born on June Be passed away, on Septemt ‘TUTTLE, Kari and Ryan, South JorSandy. UDY,Jody and WOLFE, Lance, Salt dan, daughter, Sep. 8, Alta View Hospi- J. Ronald Garn WASHINGTON, -UT- Our beloved father, grandfather, and greatre ‘andfather re- children. They were sealed in the Salt Lake Temple on November 17, 1955, Annetta returned to the Lord October 21, 1964. Married LuRae Bradshaw Slack, a widow with five children, on November 16, 1966. to the Lord oe 20, 2000. Also pre- Wendy and Todd, Sandy, daughter, Sept. 7, LDS Hospital, Salt Lake City. ZAHARIAS, Dawntai and JOHNSON,Russell, West Valley City, daughter, Sep. 9, Cottonwood Hospital, Salt Lake City. and Michael, Sandy, dai i 7, Cottonwood Hospital, Salt Lake City. Jeremy Facundo Jeremy M. Focundo, age 22, passed away September 7, 2001. ther Danny both of Salt Lake; ‘entucky. and Lynda of Salt ceded in death by son, Mark, his par- in by sister great-grandparents Rose ‘and Marvel, Rose and Rena. Heta, Loa, Lani, Queenie, hep Saint ‘and was called to numerous positions. Daniel B. Spjut day, September 14 at Sauniatu serving for three years. lu is survived by his Lerten Jafeta Apelu from Fausaga Safata, Western Samoa and Moeuli Siliga from Leone, Ameri moa; sisters Burial will be in the Cemetery at 3:00 p.m. Udell Foster . 2001, after a short battle with complications from a swimming accident ot Deer Creek. Apelu attended Leififi ie School in Western Samoa from 1992-1995. ents, two brothers and one sister. Ron was a talented craftsman with many skills. He worked most of his life as a brick mason. Ron loved the church After his retirement, Ron and LuRae Francis, Salvation; brothers Simeona, mov fashington,. Utah. They Pepe, Alesana, Uelese.. Apereamo; a love of traveling, camping, on two ‘children ‘Solaita, ‘Leilani and shared y were Temple Workreceded in death by his son Apelu ‘and fishi ir. ge Temple Temple Presigency Pre: y \"1986,, Family viewing will be held on Fri- re Nggs In Memory of our loving son, brother and father Apelu |. Apelu 2 Peart Glissmeyer Johnson, 82, of Sandy. Ww: i, Lorraine and Salt Lake City, daughter, Sept. 7, LDS Hospital, Salt Lake City. Patricia and Jeffrey, Salt Lake City. i atattaEBizalti alee Glissmeyer = Johnson Raralee and Melvin, Lake City, son, Sept. 7, LDS Hospital, mooe ieee daughter, Sep. 10, Alta View Hospital Hospital, Murray. MONTIERTH, Annette and Ster‘ling, Sandy, daughter, Sep. 7, Cottonwood Hospital, Salt Lake City. NANCE, Jessica and Michael, Salt Ward,4 W. 5015 S., from 7-9 Me a ore fr Re ee Ron is survived. by sister, Janette Ward followed by burial at Redwood Memorial Estates, 6500 So. Redwood Gene (. ) Slack, Dar Slack, and Curtis eres randchildren; 24 great-grandi ildren, and closest friends, Don and jen ol , September Road. For further inquiries contact 955-7675. Dad was loved and admired by all him, and he i be missed. Ned Banks Dickson g%8°R oeofrasd dona QB el 7, SON, KAYSVILLE - Ned Banks Dickson, 89, passed away after an es Ed (Ernest-Ernie) O.Schloss Ed died peacefully i 3 2 3 zy iat Ponce Reeve Madden Our. darii Televisi National ences for his audio Emmy Award Winning programs, “The Price is, Right” “The $25,000 Pyramid”. married Nora Herl, later divorced; Elaine ter di- ry) Pe orn Fe, poned 7,200 Survived by her Dan was born November 13, 1962 in Salt Lake Ci Us tah. The vated | School. ard, the Army National Guard and the United States Marine ‘orp. His thirst for knowledge wos demonstrated in his pursuit of education. obtai hoenix. has spent several years researching and developing an online universityto service the criminal wstice profesel Park for several sional. years, always recounting his close calls Dan_was employed as a Sergeant on with bears. He worked for the origi- the South Salt Lake Police Force. nal Channel 4 Television Station of So. Salf along. with other stations, but his eatest love was his job. for C.B.S. felevision where he worked from He also served as DARE 1966-1992 when he retired. He ‘nd in the Community Oriented Policworked as an audio, technical engineer ing Program where gle joyed. workBarker on “The Price is Right” ng wi-children and residents face to “The Young and the face. Don married a friend of 23 years, Emmy Pamela Rae Gillespie, on February 1. ag g i ; fi 2328 aS Ha z ifag file te 2g e if ve ral i , Sr. Spl,38, passed away on September tate of New York, BS in Justice Ad ministration and Psychology. from Columbia College, MAEd specializing in At Risk and Gifted Youth from the = Albert \"Ab\" F. Albert “Ab” f+, 87, died Monday, September 8, 200) at the Draper fehab. ond Core Center, of cancer. e S3885552 if337i :i ten aitite z‘u peretpiedi nay $58 SOUTH SALT LAKE- Daniel Burrows on y at the Chapel one hout prior to services. Local arrange ments are under the direction Metcalf Mortuary, 435-673-4221. Re Bird; He was © candidate for Mayor of Lake and his \"Reside van ‘communi Night Out. vorced and Marylyne Stansbury, later Dennis s unity fonctionsther/Nefportocd divorced. He is survived by his sweetheart and fiance, Karen Knudsen, his daughter, itisse Splut, pi So. Salt_Lake;. brother, David Roy Beck, Y) Spiut, Kaysville; sister, Kristine Spjut (Keith) Morrill, Riverton. was preceded in death by, his mother, Abbie Yates Burrows Edwin) Allo. Golden. CO; Shitey Mike) Saxey, Sandy, UT; and Carol ral Services will be held Thursder, Las Vegas, NV. Also surviv- day, Sept. 2 noon in the So. Salt Lake Stake Center, 2280 iends and. ‘fom Melody (Tom) Lambros, Phoenix, AZ; his sons, D. Schloss, Phoeni: and Jeff Schloss, Cottage Grove, OR; his brother, Fred ogo —_— Heber , UT; his race nephe\\ by his porents, lo E. ond Rosa Schloss. Funeral services will be held Thurs- day, Sept. 13th at 1 p.m. at Veterans Memorial Park 1, 17111 South peter to servi be at Wasatch Lawn Memorial Park. Full honors will be provided bythe South Salt Lake City Police. Contributions to the family of Sgt. Spjut may be made at the So. Salt Lake office of Bank One, 2610 So. State Street. See next page isit our Showroom! « FREEEnergy Savings fe a 5 : ia i i g z eal i; 238 5 Faull rammab! le Thermostat with Installation the RIGHT FURNACE For Your Home. @Perands to choose From x Free in Home Estimate. == == Manwill = ", "parent": 27847048, "version": 1739897102758051840}, {"id": 27847074, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/97/d5/97d54604fb11eade6319b3d51751029143a6b93c.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/bc/bf/bcbf3f4bf731ad34f2a1359400b7904dcc4c2ab5.pdf", "page": 26, "ocr": ":f | ¥ | : 8 i dl. ee erwig iteie ge, e | eedee a ip a Gs ge,dl : gel fii ave fasanea piesae i :Ha ia iilip bits Hil = ree y iha i 28 ane bw teiih po neHeuli eit Hila fensailteBEL vitaiai e : ip 5 Besijn Te steRinagianlialpe ta ipsing ere ieHeHe EhiisHi Ure wien bi ie lt sitt ajor mie bo Ressit ied nll Bi 2 c 8 és “aff a ie BalHi ithi reettitl ee 8 3s : ie a s 2 3 r oags: am sie pelt Hom: ta a ea ha ie iF es nally ee liseHl iiee“di Hii sanecH) : aliarrhe mevat hehie aie EuUB f° 18aes baal Baip i REpLied snne Ort ii ieae iieee re ine lar ' Bee ap en ne Bstei REHle thet sit Me Hy ieea | : : i ve e Ba y Hsea stagedtaearina ae nee it ue i ; slit i= sgaggeesgy a i Hage aa a ihecarte Bi iat ieSee rl “as n eeienf(ial d eate udiipl ele fanaaie ileot rail ret fe oS. = laeHuGEle al) &5}a ceief iata a3 ic a ee tbillsHal, ie ihhitral S iBor Bt bisgsisheiea t t iataun dhl Bickfia 2 i eeat titi; zi sel Bal i ed et agPallyee i taal aeiai un, is ° ei! ey ° fi ‘ae| ipiletal iatemGiia aa ia Fitaeda earely SiaHi aa ip| sfiane ct ialsitali ai Wile eilindHe ett te ” HlnlLeet atte wezla nish iss i el' cee! galae1B uu op Sasare § 44 tt cehages pik: Hitnuite BiG llamaeteBeantHa gre et; aieata i battens,eae|2 of iee , a’ el a sect S159) iisiihe BET i pute Heil “osslHt usieeesi i el q Htfi TeulBeeeat Lt ae ae easilel hi ae inH ae Hiup nlysielif i ie ‘leadaby aei4niall Bethe feelin alll itt bi fils rndalils aunrie hyde Wan neil peti thi i i :: sllbetiaees ® anili ta iaaeie z LSeti ctidale. Niaeoh tele i i ‘ Ma i i fu ieSa atiee ms et Se nn i fea te if He Tituie ie me a fete, #0 tae onenee : ( ; Pereiets SR AI a are Reem ", "parent": 27847048, "version": 1739896787838173184}, {"id": 27847075, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/31/5d/315d2763d6b58c2d56bfd209291ccb319d4f9634.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/e1/c5/e1c52b654e96ed7691fc955ec5d3b31a63da4cc9.pdf", "page": 27, "ocr": "The Salt Lake Tribune B7 PLEASE CHECK ext Stow cube ACCOUNTANT ee sae 1827 wel Ave, Ogden NOW in Wendoveri INSURANCE COMPANY Rush 42, 2001 me isan fo.PORT9 Mescrised be erasported c Nepeyaay eat SALTabove UKE 'Y, UTAH. if one a DATED this 4th day of September, 2001. TITLE INS COMPANY (NOTICE OF TRUSTEE'S SALE Batgrcens iowtul crcera September 12, tes‘ottineoF WLS NO. Property,ideas 7786 Prospector Or. Salt Lake Tax WD No: 22-25-376-010 4 eo 9 ESCORTS 530-7200 NOTICE 01 1, ACCOUNTANT NOW HIRING 2seeoeso Ctugels TOW.645 S HWY 89 NO BMeavenly Bodies 359-6688 re COMPANIONS A ate ‘The current beneficiary of the TristDeed # Bonk, of ‘0. Utah ‘and oo aareenns Dated os of September 6, 2001. ur GOING TOW 955 W 500 S W Find andsecure the rightjob with our 88D, Open Mon.- Sat. 2AM, NOTICE ispecies 463-6969. Tl am-late hrs. Beepenntt 2. Models, Actors, Entertainers Wanted PRESUEIR.. & SONS 423 N 800 W W BOUNTIFUL Career Specialists STATES OF AMERICA, Plaintiff, IN UNITED STATES CURRENCY, Defendant. We serveprofessionals seeking 525,000 to $150,000. asaditte nated 473 (dealing in RUNNER’ TOW 1138 W 650 N © Tap into the “Hidden” Job Market * Connectwith Hiring Managers © Get More QualityInterviews © Negotiate a Better Salary © Get a Better Job Faster (UV rrtseneecncnees PM WETRO TOW #3 682 N 1250 W CENTERVILLE, ee intest TOW 1165 W 725 N ‘DATED this 20 day of July 2001. Ste eee ® fo Se oy September 6, 2001 FREE CareerandJob Search Evaluation ", "parent": 27847048, "version": 1739895916837470208}, {"id": 27847076, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/d3/8e/d38e77b58b3ee464e1ee5da729cb656a36c07169.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/df/23/df23362c32568c363814e1e100e86b3041695bbc.pdf", "page": 28, "ocr": "KARMAN KITCHENS at ek Si re ottRes CABINETRY WASATCH CABINET VieleBSF SISASRYCan: | seerete BTtr: | ‘customer, mith it Niemonn 486-7802 skati o Need money? Deliver a Newspaper route! ‘See our ad in today's classifieds. =la ut 208 South SC erotics. ¥ Wee or Gi ‘under Collections mean BANK, NA. or an a MB Live in’ ond hourly Must hove: ». Tol Free! i 866-521-5745. semebieeer, ga Reece Salt Loke exciuive Cadillac] {Wi2,,,Spprenticn. Hard RET, STE|Seekers ae ior, eatS| Som. quoranteed Kile Wege, based on exp. tues 1exp requ| TOD, Wooes, 401 a) wim|_Dave/bruce 295-5020 Shh eee|+] 30 PM. Sat 9Am-1PM.| pal Pald bonuses, John 972-2513. This is @ great ATONOME Teachers nec iy CallMust 572-1be. 18. Experienced auto help needed fo| Callcauer Howard’ 298-2784 ite. ROTOROTIVE YATE andy 239-0500, ‘AUTOMOTIVE TECHS nd 3-5 years @ \"Sook/year 947-8310 - | iMesh Flex. hours, Vern 255-2. ore Neca aoa | tog : Der dey read SeoAe wk AOE, et “Seperints390-7096\" ne AREGo Ure HEE | ——— eran ee ALTA'Sfete RUSTLER LODGE Hos \"raters \"H AG80 36, Mas ue cyral hotel fas 'shol03s088om postonPlease cal Fh Ml ec ‘| Sgn” Berber ©] g ores | | Vacation? basa 5 Ee ite 2p, oom | , Consider donating your Salt Lake a iad at s ‘fo: Atin Renee, (on) 255-0205 or eal (801) 870-0467. EOE -aveRrsTocKve wee oe eee Tribune-or-~ as Wages nego. 2. Nee, setaet a Eat levelpe we train. Musthave geodpeople roan Désetes Nowra Link's schools CLERICAL ni &beth ee] Web site, ele tur 6-1872. | Leon SaMiginPearong <r with nee inerciol worterk: Con wigs or raeeal . Homceor |] while you are.gone. ae 25-40 brs, Call Mon and Tues, 9-5 Office 801-313-1600 fi een Edo sven cal47354 rd, hve 24 tir Job Hotline 526-3737 T. EVANS 233-8677 Helen TATIVE Asst. $07 ‘277-0167 487-6164 4 ee Ha Catectioy. cgency wohed iy , OF, call (801) 237-2900°or CUENT SERVICES/ ‘esentigh| Ch Suspension | : ~. = natn, '800-862:9076 and tell-us hos, tome-|} YOU Support... win oor Bostorond.Kepenwbinies Newspapers In gre, oe ie presen ae 2 Biabeyons-t — Education ~ We ecto ey y ael beer pace on is, we core one fNA 4c sharing Please Scot at 888-540-2000 i It you're reody 3 i3 $$ § & 78s and click on taaestscgeees sits, , naa ' Conon aoe Part-time afternoons 20 hours per week Subscription Sales for the Newspaper, selling subscriptions at grocery stores, USED CAR SALESPERSON $11 per Hour. Commissions andBonuses willalso bepaid. questions about the paper Maintain positive public relations. Must be over 18 years old Must have all afternoons free between 2:00 and 7:00 ", "parent": 27847048, "version": 1739895916502974464}, {"id": 27847077, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/a0/54/a0546cebceefe96745525df51f13eafa709a8909.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/b7/46/b746487d31c969ff9a576158552d42cd693e8ad5.pdf", "page": 29, "ocr": "oA i SSI fied i td experience sones o ait ‘We ore c privately heid,| ‘tocolity: Mostar com Se,eeeedwoe 29e : \"SEedaptwallteSenge = ‘orees ot tae gneeeae Sait take 62102 per hour during| i exo ‘gi Bip ‘B12 Sis $5 Ke intrest ln20 solesbusines We offer 0 profesmat,2compettireSlsry anstomer ‘how offer trainBenefin mn eligibity Fox (801) Soo 524-2720 Email: employment@sinctoiroll.com ‘promot Oppornnitien eas Mt ‘DRIVERS needed.CDL ond mm or grates Teq. Eavol Opportunity Enplorer 50-1 asses 125 a jiate 2 Been crew needed comRedstone 420-5339 20339 Door Kitoler neededYorimmed. = o Abedute ten bet one’s soley ond \"ova, WS, HTML ond tobe st goin exSa new \" com WANTED. Sndexo,. ‘Statist, ” mathematics or M1801) 898-0607 oo aes WaterBy Spots Equement ‘67S Office Space Salo, Lense ae se Fetal Space Sale, Lease . ase ice 428 : a8 eee S17 chat Land 40 Cats 516 Dogs FB sisal Fh,Repties 518 Rentale Uvestock « . 500 Condominiums, Townhomes for Rent. 275 Pet Announcements su ioreg. 20 Pet Equipment and Service S31 Two and Fouplexes for Rent 280 Macellaneous 590 Fumished Aparttents 210 Pot Remembrances 532 Fumished Houses = x 510 Rabbis ‘519 Homes Lease Option 250 as Storage 380 Estate Events, Promotions lee ol Ral Estate information Senices 372 fara yQmomes ol Real Estate Wanted m4 mea tek ng RealEstate forTrade “Ces ee erent eotons ries Estate Mortgage Servces378 ag Real Estate Loans, 380 ‘oe an Ral Estate a2 oH Homes (lon Sorte 390 varw 301 tumury Homes WE! Wer Winter 2002 2002 Hous Housing Wanted. Avaable 302 pury Homes Open 291 ‘320 Gro House 305 New Homes (not alpha sorted) 398 Homes fr Sale Mtn en ae Condominiums, Towehomas Open... 425 Arneco eho aoe Corcoran, 430 ‘puto Accessories. 909 Mentmcheed Homes 433 “932 Mobile Homes 435 ‘auto Financing oi Mobile Home Fi 434 eae os Mobile Homes, Taler Space BT cepa es aeae = MEM SeniorLiving Mi eae = Campers 40 Farms, Acreage Property . : 442 Car Tiles ‘gee Property ‘444 Custom Vans 915 Income Property Financing 445 Domestic 00 tonnes Poveey “446 Folding Traders us Recreational Property 448 import Care on Lols fr Sale 450 Industrial, 931 State Land 4452 Limousines for Sale a6 and 454 Motoreycies 100) | rence isc gists on ‘Bwates of © Fare Ind von ‘Barat Lots, (oles Se ed fire to excel, #8 BBBE2E82 egenee SEReeeeneeess Baa 88 5 ‘has positions \"availablewho ore for unique individuals ilerested ond have the ae 50 710 ‘815 ‘£40 ‘S17 740 ‘550 mo $B) fo $2 “Bar Sto ‘25 7a 785 Tho = Bo Seq 790 ‘604 ‘600 1850 TNs! ‘872 +863. 864 865 “68 “680 srs Bezuge 3 y iZapa Ng [i Sas Call 237-2000 between 7 a.m. - 8 p.m. Monday through Thursday and 7 a.m: — 5 p.m. Friday. For callers outside the Salt Lake area, dial 1-800-662-9186 between 8 a.m. - 4 p.m. Monday through Friday. Thursday and Friday are our busiest days;so to receive the best Possible service, please call us early in the week with your classified ads. crew West foundations and’ ‘Clean driving i at, B560\"°Woen Sa rae Niaose ew oP: 7a) ener a you have successfully completed renng your, base antes ity. 347-7456. for our DARSHI our ben inch ude ‘Crew. 250-9600 Roney COUNTER TOP SHOP eigenee:at, of flexible Scheduling, paid troining, oor Teldec ining. ‘hess casual dr daily), healthond dental] its. Additional benefits include ‘product toms with allthe latest geor to proc. Felaxed and friendly work I] environment. if you have. ave =| music job, | 100-776-5173 2410. EOE. COOK/DISHWASHER Fut 30-7 Call 572-1766 ste Ran eer INSTALER freabecehsone:aa, level oF exp. Sh RPSYioee é ice ‘center experience: sic red typing skills (must be| ble We Nps at 25 WPM) Fal PC knowledge with ‘experience in Fle» PEWeu228 Sim ‘metro Park Job line:Business 978-5686 opt 6 ext Or on Line www. musiciansfriend.com mzumbr Equal one Y, ‘era 2401) Kon Pension Plan Poi facattions and Holidays 2457 to ‘ond ask \"to set ae eae sora ghee hen as for of in our Salt Lake People ite) skills,Is. micomputer computer Gowledge and ably | © work weekends. Previous ine 7 sde/outside, soles, collec fons ond telemarketing x. required. Own i ion a. must, Position offers Fox:(801) ‘ax: 321 -Saas he (on)521-0480 feShorty\" our wortores pee 3225 W lifornia, (1300 S) S127) 3 DATABASE Developer-You~ -| need the skills, ee cur ad in ions. College Coll ManondToes ont nly et MangTues (801) 313-1600 No computer '? No problem. We we also hiring instructors, If you are Take advantage of this free introductory a certified technical trainer for offer.from one of the most respected IT Microsoft, Cisco, Novell, Unix, or IBM we programs in the state, the University of -would like to hear from you, Utahnd PC Training West, and find out. www.aoce.utah.edu \\ + a q VdeactenfocniNfemmatere—ap alsin . qo Reltia* (881 S85'%148:| non-cbe Pr one oFtarry1 HeServices her * Bgaet x FREE* j Seeking nk-pete Bia if sk Get A+ or Web Design Training ary oatee aes CUSTOMER SERVICE yh5Election prion atRe. 118850 Mon-Fri wor UNIVERSITY OF UTAH mane an meV ee if a career in IT is for you. the ves thease RAIN GOTIER having 4 i ve excellent 10 key skills, previous balancing experience helpful. Please bring © recent fen key test oa Prema ee APPLICATORS: } gpeaeedis Yate. Cat: (801) 253-3478.EO CONSTRICTION——C work done 1855 Exp. necessary. 450-0867 at oeeet CONSTRUCTION i Ssey MUSIC? #1 “gtolog ondFriend, Internattheretailer falofue gearhot F1 ond Fohase ,Cail801-546-0687 for DATA ENTRY - Draft Procesing ist Do you prefer Your ‘ce Musicions peor needed Contact Brandon = Clare 3 fape sang, CUSTOMER SERVICE — ions avail. $7 fo start. in person, UTAH FUN IME. 4998 § 360 W. CUSTOMER SERVICE the Sori ce\"tangest trger wie wisely dis, buted “hetel‘choin, PASSIONATE ABOUT ocing“naHaidey eoTowne inter-Contnentl Per how during hour after toln io Fn ", "parent": 27847048, "version": 1739897187662299136}, {"id": 27847078, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/63/4c/634cfc6002e7160145a3b58096eb772ed1af0e26.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/b0/d9/b0d964387fa75ce76efb40ce65ad26c3224ba944.pdf", "page": 30, "ocr": "“JUMBLECLASBICSERIES -Toordec,sandyourname,addressard03.95 and ranio ‘heenpepebtsranetnaDervnen,PD,onSOSOrroge, O00SN . DAILY CRYPTOQUOTES — Here's how to work it: AXYDLBAAXR isLONGFELLOW One letter stands for another. In this sam;ee. A is used for the three L’s, X for the two O’s, etc. Single letters, apost es, the length andformation of the words are all hints. Each day the code letters are different. 9-12 CRYPTOQUOTE o LEZ FE. JGU FE RGFHNM SHVP IVAON. LEV _ EFJ O DU KFEFRU UEKNARG BVFYUVD Yesterday’s Cryptoquote: I WAS NEVER RUINED BUT TWICE: ONCE: WHEN I LOST A LAWSUIT, AND ONCE WHEN I WON. — VOLTAIRE : ‘with Cryptoquotes? Cail 7 ‘90¢ per minute, jtouch-tone/rotary phones. (18+ only). A KingFeatures Service, NYC. © 9AM tw Kinn Faatiran Sundicata. ine. ee i i a nel ti Ee il ithie598AHhia HS eae |B 0 Sn Ca ott ui Port tine. (B01) 255-2514 University Hospitals & Clinics Greenwood (7495 State St., Midvale) Redwood (1525 W. 2100 $., SLC) Redwood (1525 W. 2100 8., SLC) Redwood (1525 W. 2100 S., SLO) ‘Westridge (3730W. 4700S., West Valley) ", "parent": 27847048, "version": 1739896963807051777}, {"id": 27847079, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/20/46/204688acf62928ea78c716494e1c154dd6afa591.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/76/a0/76a00e107f89fd6c49fa73f87668466ce08e5abd.pdf", "page": 31, "ocr": "‘What wasthe ‘Aaswer__ 8. The Nazi for whom the rank of / peichsmarschall was especially created 1940. 9.Theonly Frenchcommandertohave ‘been made an hondrary fieldmarshal For over a decade, bridge tournaments featuring cash prizes = have been popular in Europe. ‘These tournaments are heldat the United States. Cash-prize tournaments are scheduled for Las Vegas, San Diego, Reno and Calif. For more inforSanta mation, : Bridge P.O.Box 9, Browne CA 95919. Imagine yourselfin the final Tound of a cash (the ed as an ace), and you respond _five spades to promise two of the five aces and the trump queen. He bids six hearts, and it is yours to play against the lead of the spade Faowas that one of the top prizes is at stake, how long will it take you to make your decision? Without peeking, what do you ‘South deals. Whatis your action? _ ffyou put up an honor, your -aqaussod se slam and your prize i money melt -s9y9'se y ayey ‘yduro-aad &es Joy away. East ruffs, and you must aur 3,71 ‘sqnjo shog :waMSNV concedeanother spade for one down.If you duck in dummy (a poor choice), East gets his ruff, but you avoid a second spade loser. Note that had East doubled for eens Seo ae an unusual lead, he would have \"xtarson'TX tsa endoahgs No scfadtkessed, tinned vou offto the winning’nlay, “\"Aicscerttke anestee ee Peose call Deb or Becky ‘at 277-9490 HERITAGE HOME CARE Please call Deb or Becky ‘at 277-9490 Pleore call, 801.978. 1 2012 FULL-TIME RN CASEMANAGERS SIGN-ON BONUS! POSIIONS AREAISOAVAL, Join or tanovative ‘professional team! For Interviews please coll ‘at 801-474-000 Fox resume (801-474-3775, Attn: HERITAGEBROOKSIDE HOME CARE PERFECT PART-TIME POSITIONS Easy to Learn Telephone Sales Building Circulation of Salt Lake Tribune and Deseret News Hours 9:00 am-1:00 pm & 5:00 pm-9:00. Perfect for Teanher. Retirees, Or Others ; Call 322-1010 or stop by our office at: 450 S 9900 E #260 ", "parent": 27847048, "version": 1739897661185589248}, {"id": 27847080, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/7c/e1/7ce1edb6a2bdecfd14abdbd7e5e8e6d80b915e07.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/ce/77/ce7797d78a0693d7fc07dcad07d61db689d55dda.pdf", "page": 32, "ocr": "hgaz S28 iHil ii fore Pie iy ETAT Bor lik FZ0 realcadie| ‘Come and direction. Make plans to spend againsick ‘Stars indicate how good your day will be: 5 stars - unstoppable; 4 stars - timefor new projects; 3 stars ¢ your efforts; 2 stars - don't rely on others; 1 star = avoid conflicts. EH s Hi; i i ieeioe Fl aitie ik i ae é 100—Help Wanted otrep COSTUME PRODUC TION |e, 1382 Seven ie food, Phone 30-234-0629 or Toll Free 1-877-785-0416 dentalinsurance. safety bonuses and 401 z Viimeaee |g GrSES-Eh01ereral | ‘Gnnairons@metvotitie.com Cee vyaelag ‘onrr ge energetic, Fak Messe epastnt ot Te Keyhole sacra Taker reasonBio \"overage Feed 1) ADDITIONAL SALES PROFESSIONAL Year Round, Full Tine/PT. 019653907 atm ‘Sherrie Apelyotwersare om RECEPTIONS commercial Ls FESTAURARN i! oorabe | Boe (Seecee ‘ence 0 must. Full-time. FOX © THE LARGEST COMMISSIONS © PAID TRAINING ET OE Ganz iac., a national leader in the gift industry, has outstanding opportunities on our sales team. \"peeLuenet North Salt Lake City ecae First Year Poteatial Earnlags :||$45,000-$90,000 corer 7| We offer excellent eariing opportunities including salary and commissions, and the chance ‘to advance to management. Ganz provides a comprehensive benefits package including expenses, medical / dental,.401(k), and ongoing ‘training. To apply, send / fax your resume to: Manager, Fax: 520-750-0825 Visit our website at wwrw.ganz.com GANZ)=== = OD ae USED VEHICLE et te) 43 DRIDERS CLUB SON ", "parent": 27847048, "version": 1739904176726474753}, {"id": 27847081, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/d8/18/d81895d04990cdb5fe3c800deebb089d9fe05543.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/ea/d7/ead74ce4ef6d87848fb9ab4994973ca9c6ff909d.pdf", "page": 33, "ocr": "baitries flay | the COPESY Resaree Year Round FT, Seasonal FT ‘ot www.snowbird.com Line 947-8240 AIRLINEATTITUDE Child Care NOTICE i snowbindyw oT FfBEi iei‘il i A JOB WORTH DOING! $10 HOUR AVG ", "parent": 27847048, "version": 1739897362793365504}, {"id": 27847082, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/d1/0c/d10c4056e9a910556357f18a87d5a19101d26fd9.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/59/74/5974f87765765ef78e098d52a0e7ed4086968fd6.pdf", "page": 34, "ocr": "—_Wedhesday,September12,2001 i s iiif Hyitgie s i ‘iHi fh ih yrs isane 14D TheSatLateTitune RGR ie aoe epee IL aE anaes imei Fabulous east ~~ ‘at Ext, MLB ond NFL on Por10 SHOP ai - 1530 51} OFACE Hater eRe eon sale = 377 5 SOE. 32-1576 : B2ls maCome Satta © 240-1852. a oe smoke /pets i SEBoven ots 1 bdrm. new decor, frple \"seas Samee P ‘AFFORDABLE TABSSS, CONE ON DOWN won MIDVALE | YOUUVEDHBE.. Sages HA aE bite, 0 katchen, remod. See . bare. | 70%Sagnlond 271948| $415 wo. 467-2581 180—Schools & Training 180—Schools & Training DEPOSIT* VIOVES YOU IN! for your Get free college and fe training school brochures The Salt Lake Tribune and Deseret News make it easy to get information on colleges and training schools to help you get the education you .want, Just go to i or and click on Jobs link. There, you'll find the College & School Brochure Directory, where you can learn about institutions and order more information on those. that in Gsco, Orade, CWA, MCSE, At, MCSD ond CIW’ llsraton {1}: © Typography rmsd fs cha 7=rena ses FcForth whoQuy, CarerlcaAcie, GlSatinanewCreerWow! EAGLE GATE COILEGE AerowmaPeroCourse 5980 South Fashion Blvd., Murray, UT 84107 80 rm EAGLEGATE COILEGE 68-9 interest you. BROOKWOOD wera* 2 Bdrms. Starting at $4 ASPEN VILLAGE 969-5951 3043West 3500 South Bdrm. Apts. Starting at $495 15 femorabsreedbhon GU On ha e er GARDEN pastof the reerDror,Deed(0) 137-2568 Salt LakeCity | Bountiful | Ogden | Provo 1-800-216-7224. ae ie!oO Bua ‘ y » ", "parent": 27847048, "version": 1739896791466246144}, {"id": 27847083, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/33/65/3365b22f4b3e98284f2cd568b35292241ae5122e.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/7e/32/7e32aae707318ace0618376446ef6d8b980db2de.pdf", "page": 35, "ocr": "okaNCL “Ge| eae tle seucesnte ba i, taone $430 sapernds ‘ond‘Sown,Bod.Open1 24/7 ma. Kou RENTTO.OWN ond 264-9475 Reolty Funding 9606697\" , a22 anaes Lee eer See TeaasO an y ehag8 REALTY 2} 201-4483 LOCH LOMOND, Town of Sor 7350 .N. }250 dep No pets 578-2369. 256 E. 3925+ dep. take, 3-4 jrokera, Tie Ont ee 706430. 2250 Wefest. $136,500. 561-178 WES-Jordan 3 berm. 2 or Sano down! lege opt 313 8. 4125 W. 963-95 bdrm/2 ba $134k 282-8806 rambler, 2600. sq.ft. 3 ‘i Soar Yer Babes, 4 berm128 ‘Searhary bes 3923 5. Bills Dr. 4 Bdrm, 2.5 Botts. $1,000 mares you in 8375 So. . Caraarse Peering 900 1521. $0, No pets, i a Je it Steve ot 977story, | both, 2 gas pon, er fenWoper, tor-suea 255- Me TAVe)0a HOMES| | ivi 2 bdrm. 1 bath, 1 witsUNI fiey10s > fee 8 Biteesd© WicdSoR:9643 ‘Boats/Trallers. Freeway access. S57 ‘Affordatile loca! no fob too small. 565-8019 ii na : i ‘or 231-3400 576-9176, 619 Wasfooele 435-843-9939 ti3z a ba, new ag -8 edt78647%7 mi] $500/dep. Down 446°7153 Ist ma. i 2000 N. 400 W.. Tooele 435-843-9939 COW} SPRINGS anor e eanaoe 5*8{ iEoeae f i ei 4 ; 801-766-5575 ‘CASTIEHILL 391 E. Traverse 553-1125\" Droper IR Realty 33 zaea seet” i fewtripod.com/e $1 KELLVINGROVE 1600 S. 1500 W, Springville Boras as es 539-7766 ifA E ifa \"ali cowie, g ALL teSew, base i arent Th ooh 9! I s frai aaa. \"BDRM. AND UP PxPRESS as 8 ‘oval ‘able Feb, Great loc. Call (801) 733-6771 hago. 532-2685 aa ay, Tee i & Fi 3 NadytoSecipy.SORTa = RENETO-OWN 3 . | te tite, 2 oor Wy it MARS a etree 1574 455 E ay. East. $525.| 486-6176. mo. a ins Hye) 2 ‘Utils, pald. 2 | bdrm, 1 ba. ‘choot, WaanfaryRackups Bad PE Sep ratitiocds- See garage, fenced. 385900. 2802198 VATEY Beregh2585089250. mel Nice Home, 4Bdrms.w/ex-'| ‘ras. $149,000. 250-2138 $1 1912 ", "parent": 27847048, "version": 1739903052511444993}, {"id": 27847084, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/31/6a/316ad9e3d66e7c1825f441d0fec1848ca221129c.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/e4/33/e433d5b10a634a86027cbef0eacd7383be5805cf.pdf", "page": 36, "ocr": "16h ToSTre Wet,Spent220 SRT Saeo a Td - fe meee 5 oe 8.1 Se KITTENS $5. 521-0140| bees Tease o reduced. een 1s] GRANTSVILLE View Lots aS SP I eCmada Fiat ch woman soto - Beer,Mane SampReaD NabeEFThos ifaacats.tina™ eearorenar : SEEE| coaurecree, eureka i in 01, $485,000. 277, 6K onnval BPO 72174 1 - 4 Units: 7% ; [pseceuss Sexueeweeweeeneerewncs) j-2 -f-- oer] FT” fics Dien i King cas litrePees Diener 10 meee Le ‘Supplies ore tinited! ", "parent": 27847048, "version": 1739896189165240320}, {"id": 27847085, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/67/d1/67d1f54fece9f42f80e507589e205b7bd822c507.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/88/ec/88ec0949668dff7c783c95f34db51db412e4b46d.pdf", "page": 37, "ocr": "The SaltLake Tribune B17 Atomotre vitor NOTICE wees $178 x 144 mon, ‘Any.195 OPEN BOW ‘va $18818/ $222 x 144 mes. “Jaoaan) $352 x 180 mas. NOPAYMENTSFOR 6MONTHS Siegeree DRAPER 98 E. 138000 Ss. 801-572-6720 Open 9:00 AM-6:00 ‘Mon thru Sot petensenmarine.com ~ FORMULASALE 475% - Reese 972-8411 [easnecsasesesnasey===— DaHuece> UTAH FUNDING ‘811 8,600WEST#101 I] BOUNTFUL298-5885 ‘ oy SANE 4: \"PRIVATELENDERS \\' ) ) ", "parent": 27847048, "version": 1739895538845745153}, {"id": 27847086, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/93/8e/938e2439e603e016c90d59bb0d147d3db63d564f.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/a1/4f/a14fe836055ace3402132e085e53d50536dc7497.pdf", "page": 38, "ocr": "Ps secaie [acts astones epee ere snxai7 GEL avae ereslea \"meas ! age ac weeae nr (RPE geet eee are selene: areas| AMG| GPosoeeD [SEPaar a wal (7749S LSNW NSITETS ea ai aaS| pe iat SsSe ee |r reteeeee eee ai2s] SESE, og ML a eet et meee careers| ening WIT APa47 etemeee SYeen sary se reee etaEr a |Set| MellWT fsSree are —- ey nus Ege] eeeee manSBEHae SR =|.|BPae Prey thea? “wodqos 04 Burrow 9 ae Beernaessu mom sojow ee oe aa WOW LZSZ-S5E WOW \"OS ODEL SUBGNS BPOAA SON HEREE SM ee ee eesrace ‘=o. ote| pNofi [ana[See Snxaiz meee sare, Pee Se Sie easee pnee Garo ow | aici 8 Seg “370 ‘oun JW vs Crees Fit GEESE oeSti |MTR, Searsounee ed re ot “oos's$ iL 1P LeL-6SE anse edhy OS ed |oesSa ae Se gin i eee =BAY ogSS, eres Sere rea ty, SEEO-TESOAOY ee 1S£9-996 ‘sa0/00g.4 anaes = eee Se pessoas Peeies| -2e| eee esc ee a ee 3 ee |foce_shsaama_0b Faeries ay Y zs ELOUIP BOVY-99T Blip quong eee eee opoen ToetNONSe eae ardeareateby edeSoiesth| 8 saaeee 0081# 30, ‘OSSS-Z9z OMIOMAL S66z1$ ieee aire eae felte eA Set =a are eeesles aeer eeemals Se cate ee 2 7Bes cares 3 een perentag ait ae searaver| muleeaar See Ie = fe see See = BLSSeton ve eat irs le Or42, “ny4 a heey meet Ps anaes Sle ie Snxat Sein |S wean a |ee, Seeee SUR|S hda h =eeek pana “ost goed Uae ae flee ore arpe tie Saree Fae ate oorzs men te ee eeaoe Gern tegare reeEG =ees MSs EEEDoe, Oy WEDLOUY PUD) me iisea ise Cfcages]OmgMle eK : = pad ee \"6089\" ar ewe Sees ania fee a Sete savers SRxaNianars mes 006\" es agsry pe eee pe Sona aes ", "parent": 27847048, "version": 1739902955344101377}, {"id": 27847087, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/79/b0/79b03ced7609f5543b636ebf7f64d49d2c746fe3.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/f6/f0/f6f0368cf86636fb4df115f7f15a70bc4fc963ba.pdf", "page": 39, "ocr": ": \"The Salt Lake Tribune B19 ", "parent": 27847048, "version": 1739897356822773760}, {"id": 27847088, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/49/5b/495b4aa544af717ec286487552f7a59e0776eb66.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/ff/00/ff005e138dcfc55868974b6f1f51805932c2d41f.pdf", "page": 40, "ocr": "TRUCK SALES PARTS & SERVICE MTAot oR TRUCK SALES, PARTS & SERVICE 801-627-1300 800-925-6087 Onno *WANDERER® BR's RV. INIRNETPRING ssaua Trailers Tonge Setecto¥in Hoot! Jroller Soles Sars on TERRYSRV | & Coalsete. == WEST VALLEYoxo om ora i AUTO FINANCING f YS Peos 969-8221 NOCREDIT- BADCREDIT-BANKRUPTCY-FIRSTTIMEBUYER ‘hakforGregRolfeorJoeHunter WY ee To Lower Coste, LowerInterest Rates, And On Everything In ", "parent": 27847048, "version": 1739897189050613760}, {"id": 27847089, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/d7/e7/d7e78d67e821aa68b9954eca90be5b01513aa990.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/1c/b5/1cb54948ce94eb806631f2e4b67e755098a0f006.pdf", "page": 41, "ocr": "‘THE ASSOCIATED PRESS. ATLANTA — If you suspect that one of your children is overweight, you're probably right. Centers for Disease Control and Prevention (CDC) figures show that the percentage at least 20 percent more than their ideal body re has more than doubled in the past 30 By GDCestimates: mote than § mil- lion,or 12.5 percent, of Americans be- wane 6 and 17 are seriously overweight. A ete? survey by the National Center for Health the United States — one outof every five — is overweight. Other studies show that 70 percent of those who are overweight between the ages of 10 and 13 are likely to remain overweight or obese as adults. CDC director Jeffrey Koplan says obesity in the United Stas tie teaeied epidemic proportions, and while the entire population is heavier, our convenience-laden,inactive lifestyle has its ere members most Koplan, a co-author of the study, says nothing short of a “comprehensive national effort” will affect our burgeoning tennenes One None of this is news to -elemen- tary _schoolteach- TRIM TREATS ers, who see their students. routinely throw away or Healthy recipes that kids will like G-2 trade healthy home-packed . lunches for sugar-laden, high-fat snack foods. Adele Giabbai, who has taught. first grade in Falmouth, Mass., for 30 years, says rarer not much teachers can do it it, “I. can't-count the numberof lunches eee throw away, especially ion school lunch was pizza orfish sticks. If they don’t like what they have, they'll throw it out or give it away, even if they have nothing else.to eat.” most children and adolescents (85 percent) is 34 to 35 percent fat, and more than 91 percent eat too much saturated fat. Only 20 percent eat the fiveer fruit and vegetable servings recom: mended ‘by the National Cancer Institute. Whatcan be done? Heavy onTradition Light on Fat - Taking the schmaltz out of Jewish holiday cuisine BY BEVERLY LEVITT. SPECIAL TO THE TRIBUNE ouldn’t you know it — 5762 — just-when we were getting used 5 to writing 5761. At sundown Monday, Jews around the world usherin the happiest day of our calendar, Rosh Hashanah,the Jewish New. Year. The holiday concludes 10 days later, on the holiest day of the year, Yom Kippur. This day is highly spiritual — we ‘wear white to symbolize purity and innocence, and we fast from sunset to sunset as we reflect on our deeds during thepast year and vow to make the new year the best year ever. Atthe endof the service, we wish each otherthe ultimate greeting for a bright future, “Next Year in Jerusalem.” And we knowit’s just a matter of ew until we can break our fast and . Feeling giddy with nina and lightheaded from our fast, we rush from temple with visions of chopped liver, lokshen kugel and cheese blintzes dancing in our heads. Lately, though, we have hadto rethink this. Though it’s a beloved family tradition to break the fast with our favorite Ashkenazi dishes,- we’ also know they contain Smoked Whitefish Salad 1 smoked whitefish, approximately 2 pounds, carefully boned* ¥-% cup mayonnaise (low-fat or regu- r) 1 bunch scallions, green part only, sliced thin Pulse all ingredients in food processor until just smooth. Refrigerate. Serve as appetizer with crackers or challah,oras first course with baby greensand tomato. . Serves8 to 10. *Smoked trout maybe substituted for the whitefish. — David Rubell ~ See HEALTHY,Page C-3 attis insulin levels are related to blood cholesterol levels, which are directly af- fected by diet. Photos byJulie Siegel Creative cooks are adapting traditional Jewish dishes into healthier fare, such as whitefish salad, above, and exotic frittata, below. Exotic Mushroom, Spinach & Roasted Pepper Frittata 1 cup Sweet onions, peeled and Ina large nonstick ovenproof diced skillet sauté onionsin butter until 8tablespoons butter slightly brown; add mushrooms % cup mushrooms,quartered ~ and peppers. Cook for 2 minutes (chanterelle, shiitake, crem- more; add spinach and tomato. ini) Cook another minute. Beat together iy cup roasted peppers, diced eggs, cream or half and half, salt 2cups fresh spinach, chopped and pepper; add to vegetable mix¥% cup tomatoes,diced ture. Stir in cheeses, nuts, and baeggs ¢ sil. ’\\% cup cream (or halfandhalf) Bakeat 350° for 15 minutes or Freshly ground salt and black _until firm. Removefrom pan on to pepperto taste cookie sheet and allow to cool. Vécups grated mozzarella Place in refrigerator. When ready cheese © * to serve, bake at 350° for 10 min% cup Parmesan cheese utes. Cut into wedges,frittatas are % cup pine nuts delicious hot, warm or at room tem% cupbasil, sliced thin perature. Serves 8 to 10. — David Rubell Hie g to Koplan, “Obesity and only to heart [as but traditional Jewish recipes =; from chef David “\"\" Rubell C3 ee Somme aay hae ible 5-year-olds to* become for health or-ethical rea- BY HILARY GROUTAGESMITH THE SALT LAKE TRIBUNE After a devastating divorce turned her personal life upside down, Utah's favorite angel, Roma Downey, searched bookstore shelves for a story that would help her young daughterunderstandthe form ofher new family. Downey, afterall, was raised by her father alone and knew all about single parenting from both sides. Love is the thread that holds families together, says Downey,notthe presence of a certain numberof men, women and children. But that turned outto be a difficult concept for young Reilly Marie. to understand. When Downey's searchfor a children’s book turned up nothing, she wrote one herself. Love is @ Family, with folksy illustra: she wantsa “real family,” more than just the two of them, Her mother, who bears a striking resemblance to Downey,sets out to remind Lily that families come in all forms. Eventually, mother and daughter attend a schoolfunction where Lily realizes that — indeed — families come in all shapes and sizes, including the comfortable, small one she and her mothercreate. Downey and former husband, movie diAtthe time, Downeyrefused to speak publicly aboutthe split. “T refused to speak in the press —1I mean, this was my daughter’s father and 1 love and respect her more than I was hurt,” she remembers. “But now,that feels like a lifetime ago.” Downeyhas done everything she can td keep things calm and positive for Reilly: Both she and her daughter have a “healthy” relationship with Anspaugh, she said. “She's very aware of David's presencé in her life,” Downey said in a recent See DOWNEY,Page C-6 )* a ", "parent": 27847048, "version": 1739896786404769792}, {"id": 27847090, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/d4/bc/d4bca21b66145be0a9a354a8cd1457fce8e19908.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/22/31/223174fd4d088e9c4d5e0e15fe25185ad7679474.pdf", "page": 42, "ocr": "femms SEND YOUR aySURE RAS | ‘THESALTLAKETRIBUNE Briet beewould not » complete without Yorkshire Pion Beaiie. Yorkshire takes its name from 0 ng, which countyof Ser ee The Salt Lake BEST ‘Tijuana Caesar Devesing ‘2-cups bottled Caesar dressing(oil- not creamy) \\¢cup rawpepita (pump- kin) seeds,finely “Tk ia mide from a better of [4 “quirescilantro, eggs, milk and flour and po hegeigteons until, puffy, ‘Darlene Davis sentin a recipeshereceivedalmost50years A serrano peppers (or 1 tojalapefios) ago from anEnglish co-worker. ents in a food processor The recipe brings back fond memories for Davis and her husband, who were newlyweds stationed at a the in San Francisco, when the friend first served it to them. Barbara: Struhs, Holladay, sent in her recipe for Beef Wellington. Struhs’ secret is to use dry sherry from the liquor store. “It has a richer, nuttier flavor,” said Struhs, who likes to; serve the pastry-wrapped beefwith a béarnaise sauce and fresh asparagus. ‘Ifthoserecipes are not satisfattory for Fred Stayrook, maybe he can visit the Arbor or blender. Puree until smooth. Chill well. Beserving, stir or shake well. Use sparwith let. tuce and other salad Restaurant in Layton, which *With their white hulls removed, pepitas are usually mediumdark green in. color. They are available in health-food stores and Mexican sometimes in the specialty i supermarkets. Serranos dishes on the a Dutcher Kaysville. -Finally, Don McCoinas, owner of Dos Serranos restau- Café Trang in Salt Lake City. Meee‘ZCMI, Era St bought is keeping the cookie recipes from the old bakeries a secret. Do readers have a version of ZCMI’s datefilled cookies or chocolate, chocolate chip cookies for Afton Prescott, or a chocolate mint brownierecipe for Emi Lundos? Pat Gull wants an “easy” sweet picklerelish recipe. The recipe for Mediterra: nean Chicken with Rosemary Orzo published in the Sept..5 Daybreak section included an ingredient taurantchain does not give out its recipes, so Kearny hopes readers will share similar recipes so he can enjoy the food between visits. Donna Ortar,Sandy,has lost an old-time recipe for chocolate cake with tomato soup. Oven ‘Fried’ Chicken Fingers With Honey-Mustard Dipping Sauce two beaten egg yolks and mix. Return this to sauce pan. * and stir until thickened. Serve over steak pastries. —Barbara Struhs cup . Yorkshire Pudding sifted flour ieee see iisepomaale from roast beef 1eup milk Mix Noe and Sat ee beater ° Forthe sauce: “|cup honey *, 4% cup spicy brown musye Forthe chicken: _Y pounds skinless, boneless chicken breast strips (tenders), about 16 pieces. ~ % cup low-fat buttermilk “ | Mediterranean Chicken With Rosemary Orzo strips . oregano, ; spread warm bean mixture evenly over chips. it mixture over bean mixture; top with cheese. Bake at 375°for 9minutes or until cheese melts. Remove ano,andablegoons eens. Top iheate cilant lespoons onions. Top with jalapefio pepper slices, if desired. Serve teamedathly. i Makes 9 servings (serving size: 5 loadedctitpe). ww.cookinglight.com CORRECTION Linch Preheat oven to 375°. Cook meat in a large nonstick skillet over medium-high heat until browned, stirring ’ to crumble.Stir in bell peppers, salt, tomatoes and garlic; cook for 8 minutes or until Bice ing secaaies pan. pan coated with cooking spray over medium arte Auten tablespoons cilantro and.2 green onions; cook 2 minutes or until thor- Pour hotroast drippings intoa hot shallow pantodepth of 1 inch. Pour the milk and flour in bake for 30 minutes. Serve with —DarleneDavis 1 pound boneless, skinless ne breast, cut into 4 cup coarsely crushed Y% cup seasoned breadcrumbs 1 tablespoon instant minced on 1 paprika \\ teaspoon dried thyme % teaspoon black pepper tal spoon dried rosemary soe . teaspoon 2 cloves garlic,finely 2 medium chopped. lengthwise into fourths, 4 cups uncooked orzo then cut crosswise into. pasta slices (1% cups) 14%-ounce can fat-free 3 plum tomatoes,cut into chicken broth fourths and sliced (1% %cup water cups) 1 tablespoon chopped fresh 1 medium green bell peprosemary leaves or 1 teai eee. Spray 10-inch skillet with cooking spray; heat over medium-high heat. Add chicken; stir-fry about 5 minutes or until brown.Stir in garlic, pasta and broth. Heat to boiling; reduce heat. Cover and simmer about 8 minutes or until mostofthe liquid is absorbed. in remaining ingredients. Heat to boiling; reduce heat. Cover and simmer about 5 minutes, stirring once, until bell pepper is crisp-tender andpasta is tender. Makes 4 servings. — Betty Crocker’s Eat and Lose Weight Guiltless Guacamole * 10-ounce box frozen sour cream baby peas, thawed ‘ripe avocado, chopped 4-ounce can chopped green chili peppers 3 tablespoons lime juice 2 tablespoons nonfat 1 teaspoon minced garlic Lteaspoori ground cumin 1 cup chopped tomatoes ¥% cup chopped red onions 2 tablespoons chopped fresh cilantro Salt and black pepper to thet as In a food processor or blender, combine peas, avocado, chili peppers, lime juice, sour cream, garlic and cumin. Process until smooth and transfer to a medium bowl. Stir in the tomatoes, onion and cilantro. Season to taste with salt and black pepper. Store covered in refrigerator for up to 3 days. Makes 3 cups. ‘ — The Health Guaranteed Codkbook THE HEBER VALLEY RAILROAD Christine Gundersen is pane for a recipe for deepfried zucchini with cucumber sauce, similar to an appetizer that used to be on the WEERBAY BARGAIN SAVE $5 ONTHE PROVO-CANYON LIMITEDSUNDAYTHROUGH THURSDAY Present this coupon atthe depot and SAVE! Expires Sepeembet 20th [Not valid with any other offer \\ Cll forservations435 654-5601 -SLC 80151-9900 - wecherberwllecang Tue Saut Lake Otympic CoMMITTEE, AND ‘TREEUTAN INVITE YOU'TO: Plant an Olym 1c Family ree Now through October 15th, youl receive up fo 50% OFF\" sélect trees, and for each tree sold we'll donate $1 to TreeUtah for planting and educational programs. Landscaping since 1980. Road, (Across 180 from the Factory Stores) * 4 eee eee ee en 435-649-6434 7earthcn, Whilespiat <r Se eee tase serves Makes 8 servings of 1 corn dog each. sree Place all the ingredi- ", "parent": 27847048, "version": 1739897711713320962}, {"id": 27847091, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/72/8b/728b4313f2da5d1f982050ed6c668708b37bf218.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/1c/bf/1cbfce34eead9dcc688870ef76b605d9f7482c26.pdf", "page": 43, "ocr": "The Salt Lake Tribune FOOD Wedr 12,2001 % > Bs : fe i !i ofa? Ge Etat ip 7 H Ht Chinese Seared Ahi Tuna Salad with Mango variations of cheap cuts of meat and starch. To impart flavor, according to Marks, they added copious: amounts of schmaltz, sugar and salt. Marks ‘cup soy sauce 1 wasabi 1s pounds, fresh ahi tuna % cup canola oil 1(1-pound) package won. sliced very thin 2 bunches green onion, green part sliced diagoa 2 mangoes, peeled and” 1 quart canola oil for frynoodles % (6-ounce) package saifun’ ordry bean thread noodies, brokenin half -4 cup toasted pine nuts ¥ cupdry roasted, salted cashews 1 head iceberg lettuce, sliced very thin % head Savoy cabbage, . 2 ounces pickled ginger “cup sugar ‘ bunch scallions, white only leup seasoned rice wine riety of salads, many of which combine fish with fruits and - cuts down the need for oil. Anotherbit of chopped liver wisdom comes from Selma Elaine Brown, food editor and com. She uses three ¥ cup Chinese sweet and sour sauce ‘Yweup soy sauce % cup toasted sesameoil Mix together soy s.luce and wasabi. Marinate tuna in mixture for 20 minutes. Sear tuna in hot, nonstick skillet with % cup oil approximately 1 minute per side. Refrigerate immediately after removing tuna from heat. Allow to coolat least a half hour before slicing for salad. Slice tuna into 1%-inch pieces, reserving oddsizes to incorporate into bodyofsalad. Slice won ton skins into thin julienne strips. Fry noodies in very hot oil in 3 separate batches, so as not to decrease oil temperature. Cook noodles approximately 1 minute, tossing constantly. Drain on paper towels: Bring oil back to temperature: Fry saifun noodle halves separately from each other as they expandrapidly upon hitting the oil. Turn once, remove from pot; drain on paper towel. Repeatuntil all noodles are fried. * For Dressing:Place all ingredients in blender and mix for 3 minutes. To Assemble: Reserving small handful of won ton noodles and nuts for garnish, toss with dressing, lettuce, cabbage, green onion, nuts, saifun and won ton noodles and odd pieces of tuna. Place on platter; arrange remaining slices oftuna and mangoes decoratively aroundsalad. Top with additional noodles andnuts. Serves 8 to 10. \" — David Rubell salt.” The pancakes may be Pancake batter: 3cups milk 1% cups all-purpose flour 5eggs 1 teaspoonsalt 1 tablespoon sugar % cup melted butter Filling: : 1 pound hoop cheese 1 poundpotor farmer cheese % teaspoon vanilla % cup sugar 1 teaspoon cinnamon Pinch of salt Berries: 2 cups sliced fresh straw; berries % cup brown sugar % teaspoon vanilla 1 cupfresh raspberries 1 cupfresh blueberries purchased -made in the produce section of the supermarket. To make pancakes: Add milk to flour, beating vigorously with wire’whisk. In separate bowl, whisk together eggs, salt and sugar; add butter, whisk ‘until smooth. Combine both mixtures. Beat until smooth. Put small amount of oil or butter on a paper towel. Lightly wipe surface ofan 8-inch nonstick pan. Pour 4 cup of batter into pan.Rotate pan until entire surface is thinly covered with batter. Over medium, cook until edges are slightly browned, turn over with spatula; cook for a minute on other side. Stack pancakes until ready to use. To makefilling: Using electric mixer or by hand, blend cheeses with vanilla, sugar, cinnamonandsalt. To makefruit topping: Combine strawberries, sugar and vanilla. Barely bring to boil; shut off flame. Transfer ‘to dish; allow to cool. Refrigerate until ready to use. Just before serving add raspberries andblueberries. To assemble blintzes: Place pancake on dish; put 2 heapingtablespoons offilling on bottom half; fold edge of pancakeoverfilling; tuck in sides so thatit’s trapped and roll up into a slim roll. Sauté in lightly buttered non-stick skillet until golden brown. Transfer to baking dish; cover with plastic wrap and refrigerate. When ready to serve, remove wrap,heatin oven at 350° for 10 to 15 minutes. Top with berry compote. If desired, sprinkle with powdered sugar. Yield: 20 to 24 full-size blintzes. onions in olive oil separately until they are a rich, caramelized dark brown andtheir natural sugars are at their height. ’ This recipe is from David Rubell’s beloved Nana ; told him, “With every bit of sugar, youneedapinchof - Jewish recipe / i | i Holiday Cheese Blintzes Topped With a Trio of Fresh Berries Nana (grandma) Willner. “On Yom Kippur, she’d shine. Because-she knew she’d be in She drains off all the fat before schul [temple] all day, and excombining them with the liver hausted when she got home, and never uses schmaitz, only she developed a technique that olive oil. I, asa caterer, use to this day,” Since we're trying to modify hesays. “Nana was meticulously ortradition, not break it, instead of asking a Jewish matriarch ganized. The day before Yom for a Break the Fast menu, we Kippur, she’d assemble her inqueried premier chef and ca- gredients, then slice, dice, and, kenazi delicacies, which nour- terer David Rubell. Although in somecases, i cook, ish our souls more than our Rubell has catered the Gover- then refrigerate the dishes, bodies, Marks substitutes yo- nor’s Ball at the Academy Whenshe got home from temis his dinner party ple, she'd finish each recipe gurt for sour cream in blintzes, and it, and uses clients are among the most, ‘and have it on the table — pipolive oil instead of schmaltz for ~ stellar in Hollywood, perhaps ing hot or ice cold — almost chopped liver — or even elimi- his favorite meal of the year is instantly. Nothing ever tasted the Break the Fast dinner he like it had beensitting in the prepares’ for Rabbi David fridge all night. Everything Baron of Temple Shalom for was alwaysdelicious. the Arts>. “I learned another lesson from Nana,” Rubell continues, from the old country” from the slyly. “Seltzer water in matzoh closest person to him — his balls. Nana loved sharing her secrets. ‘Most people use fat, eggs and too much matzo meal,’ she'd scoff, in her inimitable Russian-Brooklyn accent. ‘And they handle them too much. Of course, they’re likelead,’ 4 “Not my Nana’s,” he smiles. “Hers were always light as a feather..I- used to laugh; because we'd eat at my other grandma’s, Nana Rubell, her matzoh balls were like sinkers. We never told her our secret. “When Nana madeblintzes for Yom Kippur, she'd insist on filling them with pot cheese. When she couldn’t find it, she’d substitute Farmer’s. Of course, she’d grouse every time. The mystery ingredient in her sweet blintzes wassalt. Just like the infamous spoonful of sugar, ‘a pinch ofsalt makes us remember who we Rubell learned about “food — David Rubell are and where we camefrom,’ she'd tell me. ‘Life is not all sweetness and honey. Neve! forget that!’ = “This is especially relevant on Yom Kippur, which is all aboutthatlittle dose of reality,” Rubell muses. As Rubell grew older and started working as a professional chef, his beloved grandma took sick with pancreatic cancer. He trudged down to Florida and cooked herall of her favorite meals. “That meant more to her than anything,” he says, his eyes welling up. It made him stayt thinking aboutlightening. the traditional Jewish foods he had grown up with. Today when he is doing a menu, he starts with the dishes she had taught him, and then replaces them with healthier variations. For our Break the Fast, Rubell replaces the customary sour cream topping for the blintzes with fresh berry compote. Tuna salad with gobs of mayo is a staple on many Break the Fast buffets. Rubell invented the savory Chinese Seared Ahi Tuna Salad. Instead of the traditional sweet, heavy kugel, he will serve a vegetablefrittata. According to Rubell, “We never forget our cultural traditions, but we're reinterpreting them for today’s healthier lifestyles.” Beverly Levitt is a food writer and screenwriter living in Los Angeles. and Friday get Dutch ovenrecipes. All pre-register by calling (801) 768-4950. entertainment, children’s activities Kat Your Veggies reservea seat by calling (801) 964-8226. Qa \"Soe niques.for canning, freezing, drying and preserving your fall harvest.Cost for this class is $5 per person. able from 10 a.m. to 6 p.m. Buses are available to transport guests who park at the Cottonwood Mall, Holladay Pharmacy, Holladay PostOffice, Holladay Village shopping area or at a lot on 6200 South and Highland Drive. Ree trying to make it easier to eat your fruits and vegetables. On Tuesday, from 11:30 a.m. to 1:30 p.m. at the Gallivan Center in downtown Salt Lake City, a Nice ae ss prepare easy dishes usi jits and vegeta- . andothersales benefit the monastery. sample the° food and receive the NIBBLES Be BITS tecccussestesinattp:m aduitscan On Saturday, learn the latest tech- and handcrafied items will be avail- ‘The §-a Day Association of Utah is Lunch, Canning Ideas cooking - Find new ideas for brown-bag lunches Thursday at the Thanksgiving Point Institute in Lehi. The twohour class begins at 7 p.m. Costis $15 per person. Participants must Q Carmelite Fair The annual Carmelite Fair will be held Sunday at the Carmelite Monastety, 5714 Holladay Blvd. Food, Admissionis free. Proceeds from food - les. Thosewho visit the free eventcan Q recipes. SALE Come to our NEW LOCATIONat 0:3, EVERYTHING! | SALE ENDS SATURDAY! Admission is FREE the SOUTH TOWNE EXPOSITION CENTER to save on overstocks, discontinued items and returns. Plus, Daily Manager's Specials! Hurry in beforeit’s all gone. Limited to stock on hand. Find our Eddie Bauer Warehouse Sale at South Towne Exposition Center, ; 9575 South State St., Sandy, UT 84070. From Salt Lake City: Take 1-15 south to. State Rt. 209 (9000 S) exit and go east. Take a right (south) turn'on StateStreet (US-89) and go straight 4 blocks. is Re / _ ae \\ For mote information, call (800) 207-8501. Shop Monday-Friday 10 a. 1-9 pm. and:Saturday 10 a.m.-6 p.m. eats tak ‘a be CAT : : : \\y Wi ma Ls | ", "parent": 27847048, "version": 1739902975435866112}, {"id": 27847092, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/20/8b/208b0a77574c6072dfb26c70947bae81db1d76fe.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/12/26/1226dbbd4183b1707672c167abe0b759778e84ad.pdf", "page": 44, "ocr": "~The SaltLakeTribune COMICS Weanesday, Septemberia: oO ‘ az ea yf ~liu S BALDO ISREKR Wisig | K]KA 2 j > ‘1 ox f P s , Rie) 7 vd a 7 a i > . % BaeraaN ", "parent": 27847048, "version": 1739896968000307201}, {"id": 27847093, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/e6/81/e6818fce808e2d18cb4189f1693b5e95ad6690e9.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/d0/a9/d0a964288272f2e6b4866a1b6762fb6f7e279c5c.pdf", "page": 45, "ocr": "12, 2001 cs Ss —_-—_——_ for Instant News, But Anchors Ignore Own Advice Today is Wednesday, Sept. 12, the 255th day of2001. There are 110 days left in the year. Gov. Mike Leavitt, before sending it back to the affiliates respective national news organizations. At Ch. 13 (KSTU), anchor Bob 9:00 In 1609, English explorer Henry Hudsonsailed into the river that now bears his name. In 1880, author and journalist HL. Mencken was born in Baltimore. In 1938, AdolfHitler demanded self-determination for the Sudeten Germans in Czechoslovakia. In 1944, during World War I, U.S..Army troops entered Germanyforthefirst time, near Trier. Thetelevision. coverage also confirmed what weall knowto be true. Although we sometimes forget, there is nothing like a tragedy to pull Americans of all races, cultures andpolitical persuasions together. —Vince Horiuchi contributed to this column martyr@sltrib.com 10:00 In 1977, South African black student leader Steven Biko died while in police custody, triggering an international outcry. 10:30 11:00 11:30 ‘TVPG’ | [toronoem tnneersep youNevecobservice,poaenmakeouryourcathychesmw UNIQUE! OUTSTANDING! IT BELONGS IN A MUSEUM! .., AS THE WORST PIECE OF DRIVEL EVER PUT ON PAPER . ", "parent": 27847048, "version": 1739904071282720768}, {"id": 27847094, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/71/fd/71fd3499ff271b00d503cf8a3ff5aeddc5533174.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/f6/95/f6950af8568d07b54cfd92f7d049b967815de8b7.pdf", "page": 46, "ocr": "C6 The Salt Lake Tribune ENTERTAINMENT W September 12,2001 Rhythm Playersin S.L. Don’t Miss a Beat RYU TEMALLU ER the “1a;. venturous side ofhis personality. As for his two cohorts, there should be a bump upin record Asfor the muscular, tight rhythm section, Claudia ( Acufia provided vocals during openig performance of Jazz at the Sheraton. followed by Malone,alone for a strange combination medley of “How Deep Is Your Love” and “Heatherin the Hills.” Strange, Bee Gees and a folk tune,bufYt worked. Lome Malone said after- wre Malonethen introduced the smooth, warm } and beautifully understated Acuiia, whosang “Maria Maria” in her native Spanish. Thetrio used the same format in the second half of the concert, with Potter performing “Law Years” and “Sun King.” Malone followed with the original “Invisible Colors” and the rhythmic, energetic “Mandela,” which featured a driving, percussive refrain. The evening concluded with Acuiia’s “My Romance.” > . Downey’s own father, bie struggled with her 10-year- - her mother. @ Continued from C-1 “Talways looked bit [a interview on the Salt Lake City set ofthe CBSseries, “Touched by an And the book, while maintaining a whimsical tone, touches on issues faced by single parents every day. Ascene = ee ee hair myself,” she Sodio hegitiathe book’s illustration by Parisian Justine Gasquet, who creates hair on the girl that resembles something combed with anegg _beater. ‘As her mother’s work on - . , =F , familes ice fo birth to age 4UtahArtis af Son alt 89 East, 10:15 a.m; 463-9067 for + said that even though illustrations look little like us, weneeded to choose ano name. She chose Lily because ‘Sugar, pestet, 250 oo.BO she knew a girl named Lily in preschool,” Downeysaid. ‘The message of the book, ywney said,is tolerance, love and the need for parents to _read to their children. “I grew up.in ahouse full of books. My father was a school headmaster and we loved to read,” she said. Flour, bestet, 251 ose Peaches,pestYet, 29 ounce .......... in the hosted by Shane¢ Jackman; Junton Theater, 280 Jack he * teaefCpTea9.0 z “State Fair” 7 Grand Theatre at Salt Lake Community College South CeeLee aneDAE hae discount matinees; 957-3322. WEREA BRICKSHORT! HARMONS Tomato Sauce, sitetoneOe 81 Chill itawt59° Apple Juice, beste4ounee ..... ss 99° lhe Teese BestYet,2roll...93% BUY-A-BRICK oy he ce Rr PROGRAM — From nowuntilOctober visitany Harmons and Buy-A-Brick fora minimum donation of$L00 Proceeds will go to help build anewfadlty and fund BestYet, programs and shelter forAbused and Neglected ~ Women and Children. FEROS your neighborhood grocer sizes 25, 16-30count $1.00 re iV Gl@ YARD Ua 3200 § a MEMeer resets rites geibeiasice? * Kids of Divorce hairstyies after tie death ot story progressed, Reilly wanedenone thebook' main character after herself. Downey talked her outofit. sites where young Lily pre 9, Downey SBook ternicnrshinsrtryneto make pigtails comes from a Focuses on realilife experience with ", "parent": 27847048, "version": 1739895853434273792}, {"id": 27847095, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/d4/00/d400f9b6d5f65965dc42d2399d4e82269eceed81.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/0c/18/0c18ef58dd5f6fada6c948d1dc274870ff28474b.pdf", "page": 47, "ocr": "The SaltLake Tribune ENTERTAINMENT 12, 2001 Wednesday, > ihn Asks Doctor Right Questions After Reading.Lener to Ann, “pas ae vile how grateful youare that your ee ANN LANDERS eee er. Hear, hear!it's beautiful. ‘A few months price of you printed a letter from “Tim in Evansville, Ind.,” who said his newspaper. sary, and be kind when you do Q 80. ¢an solidify relationships. 7.Keep your bedroom, car roommates. Others may be getting new jobs and living with strangers as roommates. Both —— e, be generous Words of praise are music to the ears college and are living with ingin one foot. (A tumor impacting the bloodflow.) Docthe pr e m 6. Criticize your roommiate adults have recently left swell- lem, and when they found the wens Ann: Many young wife died ofovarian cancer. symptom can receive the help they need. extra for the ven tie setshserthe and clean and orderly,It will be noticed by oth‘ers, and you will be admired groups need to know whatit and respected. canper, itwastoolate.Iwant Thankyou, Ann, for to thank printing Tim’s letter May I offer some suggestions? get along so much better ifwe ask the right questions. has been set aside justfor you. to with another. person ~2. Clean the sink and the tub time you use them. every 7 yt siiaild Koop ener tet; tow * for writing to ee ea aree mention my doctor. Last summer,I began hav. ing problems with feet swelling. The left ankle and foot were more than the’ I went tomy e BS and giving me the courage I needed to : ee ete trie to iad ats wo word nae: 4. Pay your rent andutility bills on time or early. This will umn. When I went for my ex courage I needed to ask it will preventcostly late “Din teict Siow weeks included an ultrasound orpostit on therefrigerator. Thanks for writing.. ee , quately express my gratitude. Thank you, Ann,for printing am, took your column with did these simple things. — A Reader in Grand Rapids, Mich. Dear Grand Rapids: An: con who mata trace: AND CUPS, CHOCOLATE CHIPS, SUGAR FREE CHOCOLATE- WATCH FOR CHOCOLATE DEMOS! 2882 WILTON YEAR BOOK IM STOCK! BAKERS C&C INC. 487-3300 367 W. PAXTON (1170 SOUTH) wwwibakerscande.com someone else to remove. No- i are er appeared in your col- ‘Thanks, Ann. We wouldall 1. Pick up after yourself. _Don'tleave your belongings in the bathtub or around the sink unless space in the washer or dryer for I : takes tobe. good housemate. 3.Don’tleaveyour clothes ehthe didnot go MILK CHOCOLATE - 10LB -GUITTARD SIGNATURE OR NANTUCKET.__$18.89 VANIER ARDSLEY.gig89 Tim’sletter and giving methe Tightquestions.—Pamin Ohio charges. 5. Help out with routine inedesis your fair share, and whenever possible, do more.It will be ap- Dear Pam: Your letter was Beachcomber Hot Tubs & yo State Fair SPECIAL _not only improve your credit, \"Turn your backyard into a Home Holiday Resort” household chores.Do atleast EAL ee SCORE R 876 (Noon)(3: 5:30 8:00 10: 50 8:20 E900 S GALL 412-1824! ‘Stadium Seating 515 S. 700 ESait (MUSKETEER (PG-13) SDDS 4:30 7:15 9:45 ROCK STAR (R) DTS 5:00 7:30 10:00 RUSH HOUR 2 (PG-13) DOLBY 4:45 7:00 9:15 mee FoodCourt»3Stories of K-Mart ,No. MUSKETEER (PG-13) 4:45 7:10 9:30 PRINCESS DIARIES (G) 4:50 7:20 9:40 PORK TO Aas0945 ‘OpenDay4pm Sat. Noon Temessubjectto Rock Star derbor(PG-13) 7:40 CSICTES an CORELLI'S Hardball OF THE APES ec.) ‘StarTrek (PG) 11:35 4:309:10 the 215 opusccaatConestarginmates Showtimes Wed. Seen eeeMeeseeel Now-September16 tm Capitol Theatre - UTAH OPERA‘S 2001-2002 SEASON by Bizet Sungin French with English Supertitles Oct. 20-28, 2001 Oct. 30,2001 Val A. Browning Center in Ogden* Livesis a bird that no one can tame” proclaims Carmen. And indeed, love ‘often sails a turbulent and unpredictable course. In our 24th season, it veers along seemingly pre-destined paths towards bliss and calamity, Ourlives maybe subject to the fickle turns offate, but at every Utah Opera performance you can rely onthrilling, world-class artistry. Don't leave it to chance - as a subscriber, you'll enjoy guaranteed seating for our season of A LITTLE * NIGHT MUSIC by Sondheim Sung in English Jan. 26-Feb. 3, 2002 Special performance pared ale hh try Olympiad ofthe 5 wt 2002 Olympic ® 5 Winter Games Feb, 5, 2002\" sav Lake 200z RP “fateful attractions” UAI1IEBACKOS TRACEC908 meee ae + LPAGLIACCI / 1200290500 7:30 10009 (2024050071500 (26267.1500) amorous. fv904mocoU ipa CARMINA BURANA Sine Ewvers GeneralDirector For season tickets, call 355-ARTS (2787) or 1-888-451-ARTS tahopera.ong by Leoncavallo /Orff Sungin Italian and Latin with English Supertitles May18-26, 2002 * Openfor single ticket sales only ", "parent": 27847048, "version": 1739896944631742464}, {"id": 27847096, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/b7/e0/b7e06a0d830ccdc6db4cf30b830c23150087ee07.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/b2/10/b2108b8e44d52f18da5b3eef35ac15386957ef7f.pdf", "page": 48, "ocr": "AttaCat Dry Cat Food 161b. Bag. ; OULU ae mCU ein 1? SAVER COUPON SHAG CONS MAUD NMONT TT STAMP SAVER COUPON oe 24-32 oz. Frozen. Assorted varieties, 2 for 3 9.8-10.9 oz. Frozen, Assorted vrlties. Fe 2 ae i | | Mother's Cookies 5-16 Kraft American Singles ae ‘ 16-26.02, Ba. Assorted varieties. re 1 79 pore a. Assorted varieties, 2See = a $ a ae es $ lip and save more now through Saturday! 5 for 4 ", "parent": 27847048, "version": 1739894560539017216}, {"id": 27847097, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/29/87/298753ccf1a854728434cdbb0e830c6c894bb83c.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/33/a6/33a663844a2c47b26fc1629fddab280424a1ed74.pdf", "page": 49, "ocr": "heSaltLakeTribune ‘ & ' Yee Pore rasowner02 saysapproved MEFORTHE RECORD, D-2 WEBNESBAY MSTATEOFTHESTATE, D-3 MIWEATHER, D-8 Judge: Facility upgrade is not fully approved PAUL ROLLYand JOANN JACOBSEN-WELLS tional-use permit before remodeling the plant and adding three new gasfired turbine generators. Jody Burnett, a Salt Lake<a at- BY KRISTEN MOULTON THE SALT LAKE TRIBUNE Sali ion and council. City Council memberSteve Thomp- LOGAN — state-judge Tuesday sided with ‘residents of a southwest Logan neighborhood who want the oy to jump through more hoops bemodernizing an old dieselPoreereenreatlant. First District cae Clint Judkins ruled that Logan must. get a .condi- Mayor, Council Costlier Than Ex-Commission fe coi SEPTEMBER12, 2001 Logan Power Plant Hits Snag ROLLY & WELLS the newly ETO review permit, which considers only the outside cosmetic changes at the plant, but not more substantial issues concerning the modernization. The neighbors complained they had been shut outofthe decision-making by the _ City’s failure to follow its own ordi- nances. The dispute hinged on whether the son, who opposes the project, was plant’s modernization will be an ex- jubilant. “Tt should be a lesson to government to follow its own rules,”hesaid. Neighbors ofthe plantfiled suit last month after the city pushed ahead with the project under a design-and- pansion or extension — as the oppo- nents contend — or a simple modernization,as the city argued. The old power plant, which Logan has operated since 1927, is allowed in the residential zone as a “nonconform- EXAMINING THE LOGS Salt Lake ing use” because it was there before current zones were drawn.City ordinances and state statute require conditional-use permits, issued after scrutiny by the Planning Commission, before nonconforming uses can be expanded. . Burnett argued the new facility ac , tually will be smaller, since two attached buildings will be removed. “This is simply a modernization by replacing outmoded equipment with. state-of-the-art technology,” he said.’ Thecity wants to install new turSee LOGAN,Page D-4 Tillman’s Trial Petition Claims Rights WereViolated Whenan employee ofthe Salt Lake County Assessor’s Office compiled the salaries ofthe staff members ofMayor Nancy Workman andthe nine County Council members and passed herfindings to other county workers,County ~ Assessor Gardnergot a call. “They[the mayor’soffice] wanted to know whatI was going “to do aboutit,” Gardner confirmed to us Tuesday. “Itold them I would do nothing aboutit. She [the em- BY KEVIN CANTERA THE SALT LAKE TRIBUNE Condemned killer Elroy Tillman was unfairly sentenced to die nearly 20 years ago because a prosecutor withheld key evidence and improperly invoked LDSreligious doctrine during closing. arguments, lawyers said Tuesdayin a petition askingfor a newtrial. State attorneys disagree that a new murdertrial is warranted but concede that the issues raised by the petition should be heard in trial ployee] did it on her own time and it is all public information.” Here is why they are so sensitive: The research indicated the form ofgovernment costs in excess of$1 million more than the old County Commission. court. They have agreed toa stay of Q Try a Dancing Legislator Salt Lake City resident Michelle Suzuki wants to know whyLagoonhas included a drawing ofan African on a terrorride. Ina letter to Lagoon management, Suzuki wrote what while Se in line for the Photos by Tony Yapias Jill Bailey and her sons, Chase, Jed and Cord of Farmington,along with friend Mack Brady,in glasses, read entries from log thatvisitors to their cabin in Manti Canyon have been writing in for more than 50 years. The U.S.Forest saeis ee demolish the isolated structure, built.in 1949 by her pe ‘Terror Ride, she observed a “mu- ral depicting myriad ‘horrors,’ in- “Asa woman.ofcolor,I am appalled that you wouldincludea black tan on a mural depicting images.Please let me know what you intend to doto correct this obvious oversight.” Park spokesman Sheldon Killpack said, “It is unfortunate that the individual would takethis as something % owners have always have been involved in overcoming racial barriers.and have been involved in such organizations as the NAACP.” Killpack said theissue will be looked into when the owners arrive back in town in two weeks. Q Mr. Civilit Rep. Chris Cannon, R-Utah, was See tae tpeenbersof Congress ad ageplay high marks for his goal to get rid ofall . the awful bickering in Washington. But The Washington Post isn’t giving Cannon an “A”for Bush- like civility. ; Astory in the newspaper’s Monday edition'took aim at Cannon’s Web site discussion ofrecent Forest Service says Manti structure, andits 52. years of memories, must go BY MARK HAVNES THE SALT LAKE TRIBUNE MANTI — Hiddenbya forest of evergreen and aspen trees at the end ofa bumpyroad in Manti Canyonisa tiny J logcabinbuilt 52 years ago bya family that now is trying to saveit froma demolition‘orderby the U.S. Forest Service. “We have earned the right to keep the cabin in the family,” said Russell Nielson, whois leading efforts to preserve the cabin, which was built on landthe family leased undera 1920s Forest Service program to encourage people to use public woodlands, But now the cabin’s permit has expired and the agency wants thesite in the Manti-La Sal National Forestrestored to its natural state. If the family does not comply with the order, the Forest Service will tear the cabin down andbill the family. Nielson said his relatives, wholived in Mantiat the time,built the one-room cabin in the summerof 1949. Two years earlier, they tore down a cabin they had built in 1932, but which was determined to be too close to a natural spring and a road. In summer 1949, family members used hand saws and axes to fit together aspen logs for the walls. They hauled stones from nearby streams for the foundation andfireplace, and poured concrete for the floor and used it to bind logs and stones. The cement mixer was turned by a pulley See FAMILY, Page D-3 eeee Don and Jill Bailey enjoy a quiet moment atthe cabin. line Competition Act Would-Be Club Members Say | Hidden Valley Discriminated calling for America to be kicked offthe U.N. Human Rights Commission.” Q Need a Good Editor? In the recent University ofUtah BY ELIZABETH NEFF ‘THE SALT LAKE TRIBUNE Vivian Santilli, a native Guatemalan who runs a Salt Lake City technology investment company, contends the Hidden Valley Country Club refused hera membership because she is a Latina. “Tt never feels good to be excluded had cmt her husband, Joseph San“the information available to the club about Mr. Santilli caused us grave concerns about him enjoying the privileges at Hidden Valley,” said club attorney and former board member John A. Anderson.“The fact ofthe matter is, if a problem arises with a Seaeee re nave Ue Siete ee ” Joseph Santilli said he told the club Rolly and Wells welcomee-mail rolly&wells@sltrib.com. yi + up to be’a war between a deceitful, Sce DISCRIMINATION, Page D-4 execution for Tillman, who is ane to die bylethal injection Oct.1: “We see no reason. why[8rd District Judge Leslie Lewis] won’t sign the stay,” said Assistant Utah Attorney General Thomas Brunker. The judge is expected to sign the stay shortly, without holding a hearing. Lewis inherited the case from retired Judge Ernest Baldwin, whopresided over Tillman’s 1983 trial for capital homicide. ~ A commutation hearing sched: uled for Sept. 24 before the state’ Board of Pardons will be canceled.;Tillman, now 66, was sentenced. to die for the May26, 1982, murder ofMark Schoenfeld, who wasblud geoned with an ax andleft todie ii n a burning bed in his Salt Lake City” home. Tillman's accomplice, Carls Sagers, received immunity for heraAea nOnY against Tillman. artial transcripts of a police tes with Sagers — finally. lisclosed in May — are atthe heart ofthe petition filed by DeLand. > “The full substance ofthe inter= views is not known [but] Sagers was foundto be deceptive,” accord: ingto thepetition. Brunker admits the transcripts were notdisclosed ator before trial, despite prosecutor Michael Christensen’s,“open-file”policy, but said that “none of what [Sagers] said contradicts any ofher testimony.” The petition also accuses Christensen of making improper “subtle references to doctrine andritual”of The Church of Jesus Christ of Latter-day Saints while arguingfor the death penalty. “Christensen argued thatfailure to return a death verdict would amountto a violation of the sacred obligations ofLatter-day Saints and would be a mockery of God,” the petition reads. “Such argument violated Tillman’s dueprocess rights under the Eighth Amendment.” kcantera@sltrib.com ", "parent": 27847048, "version": 1739897275854880768}, {"id": 27847098, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/a3/be/a3be43dd8f5245cf682335b163d0af0430c1cd98.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/59/ac/59ac0c529514db0bdedc62b4e25d251c4bb9e129.pdf", "page": 50, "ocr": "Wednesday, September 12, 2091 PUBLIC SAFETY NEWS. POLYNICE ARRAIGNMENT SET allegedly punchingand spitting on another golfer during a July 23 altercation at the Old Mill Golf Course in. 2 — who - a HOMICIDE CHARGES UNLIKELY vestigators in Pleasant Grove do not believe they have company’s efforts to build an office complex near the retire, ment center. $ Q ’ AGGRESSIVE DRIVER CRACKDOWN Utah Highway Patrol troopers are warning would-be speeders to keep a light foot on the gas on Interstate 15. Troop+ ers will be out in force this week lookingfor aggressive drivers and speeders. Using both marked and unmarked vehicles, troopers also pledge to step. up enforcement ofhighoccupancy-vehicle (HOV) lanes and metered ramps, The cial enforcement is scheduled to run through Saturday. Languid Felines Put On _A Fair Show — Barely BY PAUL BEEBE ‘THE SALT LAKE TRIBUNE The lions and tigers -and Exotic and Endangered Cats - of the World show were in a languorous mood. An adobe fumace used to. southwest of Cedar City. iron ore is framed bythe beginnings ofanotherfumace at the old Iron City, about 20 miles site is poised to become part ofthe iron Mission State Park. Pioneer Venture to Live On in Park Early Mormonsettlers tried to create anew industry by mining iron ore BY THOMAS BURR ‘THE SALT LAKE TRIBUNE ard or any other big cat, pronounced himselfpleased. _ “Tt’s pretty cool, because they are doing all those tricks and jumping up on platforms,” the 12-year-old from Herriman said. It was, the first of four The Hoffmans say their shows the big cats would put Florida-based‘traveling show on at the Utah State Fair for the day. -___% ; spiel arges instead of dashing about, FAIR SCHEDULE “mixed. Boris, twins Cas- Don'tmissDaleMyr- cat” ex- sandra and Atlantis, Tigger berg the yo-yo man, at travaand a gaggle of other feline the Gazebo p-g eanzain predators sauntered around a the show ring cage as 150 cat lov. S world. ers and cat owners lookedon Their tours the “It’s catnappi » trainer Barbara Hof oe plained to the crowd. The audience wasn’t i tractor-trailer and does hun- dreds ofshows a year. The Hoffmans travel with 18 cats anda bird. Each cat is born in captivity and is A charcoalfumace rises out of the westem Utah desert at the site of the old Iron City, where early LDS pioneers attempted for a second time to mine and process iron ore.. -Bowman said the $100,000 in one-timefunds approved by the in the works, as is a parttime now position for a maintenance SUP worker whoalso will give tours maining lized and protect the site for future visitors. kiosks, perimeter fencing and possibly a paved road to the site are also The fair. The show continues for the run efthe fair. Sayincreased luminosity ruiningthe twinkle of the stars BY THOMAS BURR ‘THE SALT LAKE TRIBUNE. preveriting the loss of their nighttirne i CEDAR CITY — This southern. * Utah city shines a bit too much-in the “re eyes of two Southern Utah University No, they are not talking aboiil:the - . . \" The Salt Lake’ D Main Street in Cedar City shines in this time-exposed picture. Two Southem Utah University professors want to limit the amount of light in the city to preserve the nighttime sky and improve the visibility of the stars. said he is unsure how the council ", "parent": 27847048, "version": 1739895551505203200}, {"id": 27847099, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/27/91/27917f266211b12fc52368ed3db240f233fcc27e.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/4d/fe/4dfeb570c3f7b7c52871536c9182193446cb9a84.pdf", "page": 51, "ocr": "CEST TECSSUET EOE The Salt Lake Tribune COUNTIES MAKING NEWS Improvements = tive signs and Family Fights Zieroth said the Forest Service stopped issuing permits around 1960 and has begun ordering the removal of cabins like the Nielsons’ which is classified an “isolated cabin” because it is built outside specially designated areas for summer homes. In the 1950s the permit was made nontransferable, so it expired when Nielson’sfather, whose namewas onit, died in To Save Beloved Cabin @ Continued from D-1 ee Broject, Price, is this year’s site for obPublic Lands delays Aug. 1. Hales Sand & Gravel Co., of electricity and the outhouse plete the chip sealing ofthe hauled from Swen’s Spring overlay. Utah ee. Transportation officials weather prohibits the sealing by . that portion ofthe job will be put off ' :z BR rill LA 1999. serves. Water has to be iat 5 icesdairiesmile oy The medicine cabinet in the cabin reflects :its five decades of jin was open for use use. Items include old waterproofing oil and insect repellent. almost anyone who wanted f to use it since the day it was i Service issued a demolition ” said Nielson, who order giving the family until . issue special-use permit. Nielson Keller, The place at 10 a.m. along the state Highway 30 three-tenths ofa mile south from the town ‘Echo in northwestern Sum. mit County. The event will include a presentation by Joe the tion’s na‘executive The monument presented aril be ~ sioner by the Pony Express lives in Salt Lake City. “Back Jan. 31, 2002, to raze it. then, the cabin was not for The family is not giving up recreation, but as a place to withoutafight.Theyhaveralstay while the family collected lied Sanpete County residents, firewood and al including the mayor of Manti, Through the years, Nielson members of the County Comsaid, the cabin has been used mission and an assistant suby Boy Scout troops, church perintendent ofthe school disgroups and countless hunters. trict, to write U.S. Rep. Chris Tt also has been the site of mar- Cannon, R-Utah, asking his help in i the Forest reunions and shelterfor people: Service to issue a special-use caught in A journal permitfor the cabin. * contains the and Seventy-six students at experiences ofa half-century of Manti High School also wrote visitors whose entries have to Cannon, who sent his own beentypedupandcollectedina letter on Aug. 23tothe district itmake supervisor ofthe Manti-LaSal upthe cabin’s library. National Forest in Price. To Nielson and other family Pointing out the cabin’s hiseee eae Sa Se ae ae the mark in Sanpete ty, agency hasmadeexceptionsin they say the Forest the past for other condemned recognize itasahistor- cabins, Cannon concluded by ically significant structure. In asking the Forest Service to who helped build the cabin, said she is “devastated”by the prospect of losing it. She says the Forest Service could exercise someflexibility. “There’s a difference between laws andpolicy,” Keller said from her well-kept stone house in Manti. “A can be used at the discretion ofthe powers that be. This is not a law written and passed by Congress but a guideline.” For Elaine J. Zieroth, making thefinal decision is one of her more unpleasantduties as supervisorof the Manti-La Sal National Forest. “There is always a lot of emotion involved in these isee oeanaly eet to a cabin that a lot people have used,” she said. “On the other hand, there are people the county’s citizens January, however, the Forest reconsider its decision and tain who cannot have one.” —Hal Edwards feorePercs ning wheel ofa Jeep, minus its tire. ‘The cabin never has had Elsinore, contractorfor the job, has until Saturday to com- =$14,400federalgranttopur- . System powered by the spin- SUMMIT. ‘The Pony Express Trail Association will dedicate a granite Saturday commem‘Weber Station, one the stops along the mail route operated for in Association as a gift to who wanta cabin on the moun- Zieroth said the family has submitted a request for a permit renewal that is currently being evaluated forits benefit to the public. She said the Forest Service recently granted an exception for a cabin near Mayfield that was found to have value to the community. John Shochat, assistant special use coordinatorfor the Forest Service’s regional office in Ogden, says there are about 28 isolated cabins in the region, which includes Utah, Nevada, southern Idaho, southwestern Wyoming and the portion ofthe Manti-La Sal National Forest in Colorado. There also are 1,421 homes in special recreation districts that generally are granted permit extensions every 15 years. Don Bailey, who married a Nielson daughter27 years ago, said that when he asked his family. about where they wanted to go for a vacation recently, “the cabin” was the unanimous choice. “It's truly a landmark,” he said. “In many ways it has earned the right to continue its life.” COMLOIomm PeaulCael 6th Annual UTAH HISPANIC Friday, September 14 (5:p.m.- 10 p.m.) Saturday September 15 (10 a.m. - 10 p.m.) 2 ti tial | | j < z i iy iy a ie ails' = Admission: $5 per adult © Kids under 10 Free! Featuring... Hot Musical Talent! AMERICAN Authentic Hispanic Food! iFESTIVAL! Principal Artists: iSalsa-bration! Friday — Banda Campesino Saturday — Eddie Santiago & ifr | off 1300 South West Temple itt g u iis Bfih ih E it ty a fi i a 2if i | IrEiPE { i ieiti, Franklin Covey Field, Presented by: Kid’s Activity Tent! Arts & Crafts Mercado! Proceeds from this event benefit the Bill Garcia Memorial Fund for programs that support at-risk youth. ome FP A ee FN EEE coe. encmcoe QP Smits if, fn VION Eg Utah! Vete meet 2. @ woe Baw Fis BH Peeretnews George 8. and Dolores Doré Koctes Foundation Rico Mextcan Market Kalpene and Dinesh Patel Foundation Le Prensa Utah State Boneter Orrin G. Hatch Utah Food Services: Munde Hispenc: Eddie Serrato La thexicana KSVN 730 Information call (801) 301-5031 or e-mail: UHAFestival@aol.com CS PSHHO HEE OESHEOESE SE SESESEEE ESO SHE OH EEEEE OOS (y SOCSSSSHSSOSSOSTOSTO HOO STO STOO SOSTO LTO OHO ESOS HOHOOHSSHSOTO OOO SEOOSOOHOELOEES fo Catch a Little of Utah’s Hispanic-American Culture ", "parent": 27847048, "version": 1739896650650877952}, {"id": 27847100, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/64/83/6483cb5b261ab14fb87b30d0c67973ddda960451.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/78/4c/784c97188d0d0f73e669f812d714ee5f88e175da.pdf", "page": 52, "ocr": "The Salt Lake Tribune UTAH Wednesday, September 12, 2001 . or white Alleged in Suit Against Club women Someone's parents are?” asked attorney Mary for mem- first question we have to objected to the emissions and noise, particularly are nearby. But they expected thecity to shut down the power plant eventually, and rallied last Logan has said it wants to ensure it can meet future elec- bership, [does the club] Serhusband,endwhatex @ Continued from D-1 eee Vivian Santilli, a ateey of Utah student and mother of three who came to the United States in 1986, said she had looked forward to joining to help her business and enjoy Hidden Valley’s 27 holes ofgolf and new clubhouse with her family. Logan Lake ikattorney who represented the neighbors, said the judge was being sold “a pig ina PowerPlant poke.” Hits a Snag @ Continued from D-1 bines, add a new roof and reduce the number of exhaust stacks from five to three. The new turbines will be substantially less polluting and much quieter, he said. But Bruce Baird, the Salt It’s not clear, Baird argued, that reducing some pollutants while increasing others will be good. That is one reason the com3should scrutinize the project, he said. * There is no doubt that the project is an expansion, Baird said. “Tt quacks like a duck,” he Praegerfaalo it is parade this duck by the Planning eauaci oe ifthe commission salutes.” kmoulton@sltrib.com Fabulous, new condominiums loaded with amenities... PARK CiTy’s BEST VALUE! PRE-RENTED, INSTANT EQuity! MODELS OPEN, from $139,900! ¢Fabulous location at the foot of Utah Olympic Parl ¢ Incomparable amenities ¢Full-ownership One Bill ¢ Trails, hot tubs, clubhouse, Expanded Home Coverage *More than 60already sold! ae includes over 50 cities includes Nationwide Long Distance AT vi Qwes FHE SPORTS PARK PARK Corrs www.cresty iewparkc ity.com BROADBAND | INTERNET | MANAGED SERVICES | HOSTING | APPLICATIONS | TELECOMMUNICATIONS | WIRELESS Visit a Qwest store near you: ‘Sandy Salt Lake City 1152 East 2100South, Suite 4 (801) 466-0038 . Or one of our 1000+ Authorized Dealers 10450 South State Street, Suite 2106 (601) 571-5091 (at trfr ea oo Cane ca ed hin reer, dup 1 rat ns. yar ace coneiions fox monroe‘Nat val wth returnedhands. Senco rat enac 31ap ricnetaieo Bie emer otQueSermenatngeenme (atenareect wi 7/31/2002. Customer ray fies ta VA tyWh tbepexcheaneof» Hokin Handeetancl Owst Wrolons™ W eraprecam 6-10 wee cael. aseea 435-655-8870 ", "parent": 27847048, "version": 1739904421180997634}, {"id": 27847101, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/ba/6c/ba6cfea421c78bf5978e41b3490d24e3ea72f4b1.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/1d/77/1d77b85d93990653e1e05bf7666559ba03d61e16.pdf", "page": 53, "ocr": "The Salt Lake Tribune UTAH Wednesday, September 12, 2001 FamilyViolence Prevention Group Gives Utah a ‘D’for Its Lax Laws that progress is not reflected in the existence of laws in five areas, including whether states ae law prohibiting insur- OVER 50,000 DIFFERENT ITEMS HOBBY & CRAFT Superstores GUARANTEED LOW PRICES! Maes will beat any competitor's advertised price. ROAR ee et BEDaN SAVINGS from our, colored blooming 7 items in stock and 0% off the 7} selection of beautiful ates a domestic violence shelter, said states’ low grades on purchase ag y,thatitem. were - Q%ott nation isn’t doing enough for domestic violence victims,” she said. “And what we are doing, we aren't doing as well as ‘campaigns, policy reform and we could.” programs. The report scored states on aestes@sitrib.com 3 see = PUMPKIN CARVING KIT who ‘could have selected as many as three potential replacements subject to Leavitt’s er “She is going to represent that community very well,” said Nichole Adams, chairwoman ofthe Salt Lake County Democrats. “She has great knowledge of the issues .. . and there was a lot of support shown for her.” Suazo, 48, was unavailable for comment. A swearing-in ceremony,the last official step, could take place as early as Carvedetailed pum, using this easy kit. Includes 10 new patterns. os said Senate arti Senate eaterMike Dmiirichpret yaks the appointment. “She fought every step with Pete,” he said. “I expect she will keep onfighting.” Pete Suazo died Aug. 19in an ATVaccident. Alicia Suazo grew up in Tooele and has taught at Park View, Lincoln, Washington and Edison elementaries. Edison is the school her husband attended in Rose Park. gburton@sltrib.com 42” assembled. Colorful outdoor decoration. Hang on a99 orpost. re enenee NEW STUDY FOR PSORIASIS TREATMENT Weare testing a new oral ‘medication for ive cand) ly. Choose black or coppercolored. ‘Bi = lage © © © a7 YZ: OWEEN LIGHT SET . and scarecrow. rlipkylttaap Yj es tall. or outdooruse. treatmentofpsoriasis. To be eligible you mustbe 18 years or older, have moderate to severe plaquetype psoriasis, and be in good general health. Thereare 7 visits over a 20 week periodof time. For information or appointments,call 581-6477. Department of Dermatology Adda decorativeedge to any pi of paper. Greatfor scrap! University of Utah Health Sciences Center Li TIEMPERA PAINT + 8 oz. liquid paintin assorted colors.| Great for makingsigns and posters and window painting. Youre invited Ae pelaale ° FUSION bhree powerful recruibment media Choose from our huge selection of dried flowers ooeeoe rosSTOM PICTURE FRAMING GUARANTEED LOW PRICES! Over 1000different Frame Mouldings! Archival Quality, acid-/ree materials available. CUSTOM PICTURE FRAMING Place any new order now through 9/18/0! YOUREATINEORDER or nksemenpt etn re ES ce ‘notbe wel for48H cpto readyeae Framen. Goodthre: 774A0F UAL ] | ", "parent": 27847048, "version": 1739897467378335744}, {"id": 27847102, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/5f/59/5f593f01c8ebf2ca25934d1df4ec4f0574628aa8.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/a8/82/a8825b71857b97dcf87af01152c665413fd9e860.pdf", "page": 54, "ocr": "Analysts fear investors will rush to sell once Wall Streetclosure is lifted BY LISA SINGHANIA UTAH REACTS ‘THE ASSOCIATED PRESS States was less immune from world political instability than é Stockbrokers urge clients not to panic NEW YORK — The nation’s securities mar- a7 kets shut down and New York’sfinancial district their returns from the U.S. stocks, further stim; at If the shutdown is brief, there might be some initial selling when Tesumes, Dickson sald, bt “things would tabs pettygully” four est rates, Both effects would undercut the fragile economy. Eto a aelote ane fundamental market sat aS Bonar Piele,cautond against making too many assumptions, noting pried o bhibat Pegs: agg it’s never ‘seen anything like what just “If the markets were to open right now, we'd see a huge drop,” said Peter Navarro, an econoIrvine. tional dollar-denominated stocks and bonds out of fears that the United feared killed. “Tam broken up by this. I have lot offriends up there,” ” said Dickson, the Hilliard L; it otitis nycar = the altack on the caused chaos in New York's financial disiict. STUNNED IN SALT LAKE ae BF B ive e Leah Hogsten/The Salt Lake Tribune Wenbo Li of Saft Lake Ciy watches in disbelief news reports on the trot atiacks in New York and Weshinglon, D.C, at Sears department store on 900 South and State Street. He stopped at the store to watch the national news after hearing ofthe attacks. “I's very sad,” Li said. “Probably lot of people died.” eee ‘THR GALT LAKE TRIBUNE Dozens ofUtah companies put aside normakbusi- :e BY PAUL BEEBE and LORI BUTTARS !i Impactof Terrorist Assaults Disrupts Utah Businesses the “This is ° a major national di that will have some very long, inthe corporate worldand ournation asa whole,” said Dan fens Tuncay Wilk Conn travelingpopkenen tad Mabey, director of Utah’s Ini eee econ take citar oadegomeps i wake of coordinated terrorist attacks on New oS ee panne, OL “Everyone is trying to maki’ due: they: know where their loved ones are,” said Judith Development Office. Utahns. working at-Morgan Stanley, Merrill Lynch,” Card, Express and other companies based at the World Trade Center were sethomeTesiay io swatwordoftheofpone they have come to know as voices on the Towne den, Salt Lake City Old Navy and Starbuck’s outlets also closed their doors, as did fedpingsto as theNational WeatherServiceand moming’s terrorist See UTAH BUSINESSES, Page D-7 time the FAA closed all of the nation’s airports. Employers Should Be Prepared to Help Workers Vent Anxieties After Day of Terror ‘The devastation that occurred when terrorists crashed hijacked planes into is not unlike what occurs when a parent talks toa child about a nightmare. Getes reclinntin ton there and tet them\"he sald, “Thisis im bag gpAiacd gece offers these tips to conversations about workplace safety, said David the way to regain a sense ofcontrol of vee ancient md discussions, using 8 faciiitator or counselor i David Eccles Tonnies Gnges fo compen 20 taepdicion School ofBusiness at the University of “Things may have dismissed in the past become very salient to us,” Brittain said. “Managers’ who chooseto ignore employees’ concerns willfind theywon'tgo away.” ee he aM dipkauntan) ensootivenection ao attele bee - “But sHiould bea participative so mechanism. empl feel have some level of that people in the i\" said. “Doing an in- =a Maen ee cope te madteeing preceas My —- . E - Brittain, dean Even better is to create organized ona ifaR e agers may work with employees to ppdira dat hichis lar 4 Tuesdi i F as the situation.” tahoe’ ap certaintyyu eeer ene| ee Mided } : | Ralston, managing partner at Ralston & BY LISA CARRICABURU ———— ", "parent": 27847048, "version": 1739897658461388800}, {"id": 27847103, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/df/ae/dfae4c66470ba45867b4cd6cc266fc4898cad225.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/98/87/988704e26a746879546294305f86534f5213f321.pdf", "page": 55, "ocr": "_ TheSaltLakeTribune BUSINESS Wednesday, September 12, 2001 MarketsDive After Attacks and airlines, after hijacked passenger planes plowed into both towers ofthe World Trade Center. “It's a disaster. It throws the-whole SUVsScore Higher In Crash Tests Banks, insurers will fall the most — dex of leading rast shears igchint Arr taba fore recovering somewhat eeclose the yee reatre ak Reheat CAC 40 adatuocnted Shoots camer European insurance companies, some ofwhichwould facedamage claims hour later, employees at a Franklin Covey store in the Pentagon City Mall in suburban Virginia had arrived at work when-a third aircraft hit the Pentagon three blocks away, spokeswoman Debra Lund said. 2 “We are relieved to say that after too that they are safe and accounted for,” Lund said. seminars across the United States today, andfor the remainder ofthe week in New York and Washington. Many companies said the attacks left ‘traveling on business scrambling for other ways to reach their destnations. Some ; others was not shut market. ~« steve@sitrib.com two jetliners slammed into the Trade Center four blocks away. Less than an OPEC woul dis part to keep ol ee ee ee organization's ’ secretary general, Ali Rodriguez. “We will do everything possible, everything in ourpower, to maintain stability,” said said. poor after the driver’s side front end was run into a deformable barrier. The priceof gold was later fixed at $287 per troy ounce — a jump of $15.50 from Monday afternoon. Werner Heid, chief executive of Roybased storage device maker Iomega Corp., was expected to fly from Califorwere ee spokesman Che's Ro- moser sai aae executives, facing chit Chief Executive Jack Messman, had gathered at the Networld+Interop trade show in Atlanta to launch NetWare 6,the latest versionof its flagship network operating software system. _ Instead of a gala event, the launch quickly turned somberas news of the at- _ tacks swept through the convention center, Novell spokesman Bruce Lowry said. “The show's organizers have decided to close the show today,” Lowry said. He didn’t know when it would reopen. Employees at Christopherson Travel Group in Salt Lake City, which handles business travel for more than 600 companies in Utah, said some clients elected to rent cars and drive to their destinations rather than waiting to seewhen the nation’s airlines will resume flights. Few clients, however, canceled trips. “Most of our customers travel because they have to, not because they wantto,” said Mike Cameron,president. Tribune reporters Bob Mims and Lesley Mitchell contributed to this story. when the modified design is wailable. Quintiles to Lay Off 1,000 Workers RESEARCH TRIANGLE PARK, N.C. — Quintiles Transnational Corp. will lay off about1,000 workers,or 5.5 percent of its worldwide work force, as it consolidates data Management and clinicalmonitoring operations, the world’s largest _contractjee ae Tees The restructuring was geted to cut costs by 50 million out salespeople to the drug industry. + ta . fons commercial pe Vaart ssagtlidon agreed from San Francisc’, International Airport when news of the attacks arrived. Love and Benoy Tamang, vice president of corporate development, rented a car Se ne fee,0 ia, Spokes man Blake Stowell said. Caldera has employees in New Jersey and Massachusetts, where three of four jets that crashed Tuesday originated. Stowell said work was not disrupted in either location. WASHINGTON — Newer . Be el a 3 ¥5. te Ca tligl ~ rs In lieu of our regular newspaper ad, we dedicatethis space to the Americans wholost their lives in Tuesday's tragedy. We moum for them andpray fortheir families. May God bring peaceto this troubled world. ways am eingaaes ", "parent": 27847048, "version": 1739897734794575872}, {"id": 27847104, "paper": "Salt Lake Tribune", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/86/97/86975f3e03adc2e7643274a1f9e378bb52a33917.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/5a/10/5a101313553fca7bb66c731a7091aa186e62dc32.pdf", "page": 56, "ocr": "EESSEOSUESUGOSEUECautEgERSpagSaaaOnaaOgE IUHEEE% pani iuy iHU Sunrise Sunset Window Rock 83/36 Yellowstone 64/35 \\ i } | | | / | Fh FERRO RRR\" OR SEP SER CR? | a zB : as Weather(W): s-sunny, pe-partly cloudy, c-cloudy, sh-showers, t-thunderstorms,r-rain, sf-snowflurries, sn-snow,I-ice, Prep -precipitation, Tr- a : Ca SEQSRSEAEREEA ERERAIROBIGaR5 B°S*“ ‘Tucson SUSUEREEEHHgEEEEAENELITE *SS°R ESS Ro. | ogee pEreuge 2 R acageeteakccae 3 2 SaagenageSaggeeazeangs agtz| wee noguEersgeedgcegar-gug 102/64 s u SESSgTESSSERSSELSRTSSR GR | All maps, forecasts and data provided by AccuWeather, Inc. © 2001 nimbo.wrh.noaa.gov/saltiake saa nena HESRESSINEE ‘oath 3B B°R° ssSEER CSES°R SE Eo eo = 3 ebeaneneaae Weather 524-5133 ‘www.sitrib.com River Recreetion 539-1311 ‘Avalanche 364-1581 HOURLY UPDATES ON www.sitrib.com ai 50832022 2 BERR BRE’ om eygoeoenesy « 7:06 am 7:42 pm nents eachact Aedesattndnbaliaahmbehinlalbeh died oAdertedelid ; pidechara ace dl Ris bchnclsSeenatad ", "parent": 27847048, "version": 1739896993355923457}]}