{"numFound": 20, "start": 0, "numFoundExact": true, "docs": [{"id": 22653317, "paper": "Vernal Express", "type": "page", "date": "1997-04-16T00:00:00Z", "year": "1997", "month": "April", "day": "16", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/a2/31/a23108ccf88f7101a2c8128550d5fa69f148062e.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/44/1e/441e027c322ded69e0df28854bed8a5cf52019de.pdf", "page": 1, "ocr": "ICR HT FWSOh'I lf'--r  m 1 Wrm uiah KKtss Assorifi' dn iChepk t -  J J fffc J07 W ' S tssanv. 1 K Temple musical page 13 I \"--Tl  3!C, UT S4KU A7J Inside Ouray open house page 3 I X  C .VTA I y l I A Mock trial page 7 I feLL  Ir3 y 7T?TC :- m  Single Copy 50$ y  WEDNESDAY, April 16, 1997 Vernal, Utah 84078  105th Year No. 16 20 Pages,-  Contfigyiratiiioin)  quesftiomiedl  by board  by Kathleen Irving  Staff Writer  Saying the School Board's first  priority should be to regain parental  trust and support, newly elected  board vice president John Busch  has again questioned the current  elementary school configuration.  His remarks were made as Maeser  Elementary Principal Dr. Larry  Klein made a requested report to the  Board last Tuesday evening.  Busch asked that some type of  parent survey be conducted so  Board members could gain an  understanding of how parents feel  about this attendance system versus  neighborhood (K-5) schools.  Dr. Klein and the three board  members who were involved in the  schools debate two years ago tried  to explain the complexity of the  issue to Busch and Dave Murray,  both junior members of the board.  \"If you simply asked parents  which they like better, age-based  schools or neighborhood schools, of  course they are going to prefer  neighborhood schools,\" said Dr.  Klein. \"But if you give ihem  enough information about the  advantages of the reconfigured  structure, I believe they will make a  different decision.\"  Dr. Klein acknowledged the  downside of the current school system:  sys-tem: parental inconvenience with  bussing schedules and  parentteacher conferences. But he  also outlined what he and the other  four elementary school principals in  the District have seen as overriding  advantages to the education of children:  chil-dren: younger children not being  mixed with older children, more  curriculum focus, smaller class  sizes and lower financial outlay. In  addition, Klein reported continued  strong parental involvement and  support in all five elementary  schools.  Board member MaryAnn  McAllister told Busch that small  class sizes in the district are tied to  the reconfiguration.  \"It is detrimental to students to  raise class sizes,\" she said. \"Parents  need to understand that would happen  hap-pen if we return to neighborhood  schools. Small class size is not a  luxury, it is necessary for the education  educa-tion of the children.\"  Center opening  is anyone's guess  The contractor on the Jensen  Welcome Center has only one week  before completing the project and  still no date has been set to open the  facility.  When il opens, the welcome center  cen-ter on the east wing of the Utah  FiclJ House of Natural History will  move lo the Jensen facility.  According to Garth llcaton, executive  exec-utive director of the Dinosaurhmd  Travel Board, his staff is ready to  move in but there ore some budget  problems that need lo he resolved  first.  The welcome center was funded  by the Utah Department of  Transportation and it has pledged  funding to maintain the facility.  Heaton said he was hoping for an  early May opening of the facility.  The S2 million facility is located  on the northeast corner of the intersection  inter-section of Highway 40 and Slate  Road 149 whuh leads to Dinosaur  Quarry.  Wadswotlh Brothers of Salt Lake  City is the primary contractor on the  project. The contractor will be done  with the project after a week to tidy  some things up.  Prior to the reconfiguration,  Uintah School District officials  budgeted up to $350,000 annually  to pay the salaries of teachers they  were forced to hire in late summer,  or even after school had begun, to  deal with larger than expected  classes in certain schools.  Not only is that money no longer  available, but Klein characterized  the annual situation as a frenzy, a  constant shuffle of students and  teachers which resulted in consistently  consis-tently unbalanced classes throughout  through-out the District.  Not dissuaded, Busch and Murray  said trust and support were still  most important to them and seemed  to imply that those virtues were  inextricably tied to the school attendance  atten-dance configuration.  Said Murray, \"We have to do  what the people want - right or  wrong.\"  Other board members encouraged  a review of ever-tightening finances  and an information blitz before a  poll or survey is undertaken.  \"The community needs information  informa-tion so they can choose intelligently,\"  intelligent-ly,\" said past-Board Pres. Rob  Nelson.  Nelson especially wants parents to  understand that shifting back to the  old system would require more  money, resulting in either a tax  increase or a cutback in services  and higher class sizes.  Klein said a return to neighborhood  neighbor-hood schools would re-create either  unbalanced classes or constantly  changing school boundaries, situations  situa-tions that would also displease parents.  par-ents. '  He emphasized that the current  school configuration, which is similar  simi-lar to that employed in many communities  com-munities around the country, provides  pro-vides balanced, smaller classes and  improved curriculum focus, even  though the hidden cost may be  some parental inconvenience.  \"Before we do a poll, we need to  be sure parents understand the consequences  con-sequences of the options,\" said Dr.  Klein.  The debate was tabled until May,  when Board members will have  completed several budget workshops.  work-shops. However, no changes in  school configuration are expected  for the 1997-'98 school year.  The Dinosaurhmd Travel Board is  hoping for additional funding to  maintain the facility because it is a  stand alone facility.  Inside the facility is travel information  infor-mation for the area and the state of  Utah.  ' - ;;:r 1CL0SED1 \" : .. Wl  '\"I i 1 .j- .vmmim\"-'''-?' wuiiiimmii . , I  The nearly finished Jensen Welcome Center is currently closed. I!  by carry May.  Accident at 1500 West and 500 North Monday injured four teenagers. Traffic lights at the intersection  Department of Transportation, but conduit for the lights will be installed this summer in hopes that the  by UDOT.  Flood potential  by Steven Wallis  Express Editor  Snow survey reports jump sharply  upward this week as last week's  record breaking cold and snow were  reported in the accumulation of the  water content of the snowpack on  the mountain.  At the Chepeta reporting station  the snowpack is at 188 percent of  normal with 25.7 inches of water  compared with the 30-year average  of 11.6 inches. The snow levels at  the Chepeta station mainly drain  into the Whiterocks drainage.  In the Ashley drainage. Trout  Creek is at 155 percent of normal,  and Kings Cabin on the Brush  Creek drainage is at 153 percent of  normal.  Mosby Mountain on the  Whiterocks and Mosby drainage is  at 222 percent of normal. The average  aver-age snow water level for this time  Local television outage  caused by vandal's bullet  The past week's television reception  recep-tion in the Uintah Basin was interrupted  inter-rupted by the failure of a cable on  Tabby Mountain.  Joe LcBeau, 73, who has contracted  contract-ed with the county to maintain the  television system for the past 30  years, went to Tabby Mountain to  take care of the problem. After  fighting blizzard conditions and  over eight feet of snow. LcBeau  began to troubleshoot the problem.  After two days of inspecting the  most probable causes of the outage  and being dumped on with two feet  of snow, LcBeau narrowed the  problem to a span of cubic between  two poles (hat crossed a deep  ravine.  After taking the wire off of several  sever-al spuns between poles so the cubic  would come down to where they  Chart reflects recent increase  in the snowpack over last year  and the 30-year average.  of year at the Mosby station is 1 1.6  inches. Currently there are 25.7  inches.  Tuesday Uintah County received  the necessary permitting to continue  flood control measures along  could work on it, LcBeau discovered  discov-ered that the cable had been shot by  a rifle. The cable was probably shot  last fall and the bullet did not completely  com-pletely sever the cable. After a winter  win-ter of blizzards the cable finally  failed.  LcBeau was able to splice the  cable and muke the necessary  repairs in order to have the translator  transla-tor operating by Sunday evening.  The Tabby transmitter not only  feeds four television channels to the  Vernal area, but also the West side  of Uintah County ond Duchesne  County.  While on Tabby Mountain another  anoth-er problem developed on Blue  Mountain, east of Jensen. LcBeau  went to Blue Mountain Tuesday  and was able to repair the problem.  \"It's too bad that people have to  It hoped it will open lo the public  increases  Ashley Creek. The county has a  $200,000 flood control fund and  last week the Uintah Special  Service District awarded $43,000 to  do 16 projects along the creek.  In order of importance, the projects  pro-jects are Massey Bridge in Jensen,  Sadlier Bridge, 500 East Bridge,  McConkie Bridge in Dry Fork,  Upstream Settlement Bridge in Dry  Fork, Johnson City Waterline,  Merkley Park Waterline, Golf  Course sections, the apartments on  north Vernal Avenue, Remember  the Maine, Steinaker Ditch  Diversion, Dry Fork Diversion,  Union Canal, and lower Ashley  Creek.  County equipment has already  removed wood from the creek at  500 North to 500 East bridges. Dan  Richens property. Gas Company, at  the golf course, at 700 West, at the  Upper diversion, McConkie Bridge  and Dry Fork Bridge.  shoot at the translators and cables.\"  said LeBeau. \"They just don't realize  real-ize how many people it affects and  the problems it causes.\"  LcBeau said in the 30 years he  has been maintaining the county  television system, this weekend was  the longest time it has been down.  \"It was the toughest time I have  ever experienced in fixing the system,\"  sys-tem,\" he said.  Uintah County contracts to main-lain  main-lain the translators in order to provide  pro-vide television services to the residents  resi-dents of the county. The funding for  the television comes from the  Recreation District. Because the  translators need to be on top of the  mountain, they are subject to some  of the worst weather in the state,  olong with some of the worst treatment  treat-ment by inconsiderate people.  Concern about the television  should be directed to 781-5486.  Sawmill approvedjridell  residents concerned  The relocation of a lumber mill to  Tridcll was opproved by Uintah  County Commissioners Tuesday.  March 19 the Uintah County  Planning Commission granted  Frontier Lumber Inc. a conditional  Use permit if the company adhered  to traffic and access stipulations and  adhered to state and local requirements.  require-ments. Last summer Frontier Lumber'  sawmill was destroyed by fire.  Wanting to start over in a location  whkh will allow more room for  growth. Kelly Young, owner is  planning to lease property in Tridcll.  Thirty-two residents in the Tridcll  \" -- .  have not been approved the Utah  lights will someday be warranted  Ashley Creek River  Commissioner Joe Hacking said;  there is the potential for a repeat of  the floods of 1983, but it will  depend on the heat.  \"We are behind 83's snow levels  which were at 300 to 400 percent of  normal, said Hacking. \"But this  year is similar to 83 in that most of  the water came in April and May.\"  Hacking said he believes the  Mosby Mountain snow report is &.  good indication of amount of water  on the Dry Fork. At 222 percent of  normal, Mosby is one of the sites  reporting the highest snow water  content.  Normal spring run off is expected  around May 10 and will continue  for 30 days.  School  revenue  drops  The Uintah School District should  plan for a $144,000 drop in revenue  for the upcoming school year, says  District Business Administrator  Scott Ruppe.  Ruppe delivered the bad news to  Board members during their business  busi-ness meeting last Tuesday.  The bulk of the preliminary  decrease is attributed to District  projections showing a decline in  student enrollment. Officials estimate  esti-mate 120 to 150 fewer students will  attend Uintah schools during (he  I997--98 school year.  Ruppe says fewer students will  require fewer teachers at least five  positions should be eliminated but  that will be taken care of through  attrition. The District has already  accepted a number of rciirement  Set Revtnut on pagt 7  area requested an appeal of the  Planning Commission's decision.  Tuesday, commissioners heard the  concerns of the residents of the area.  Bob Simmons, who lives about  mile south of the proposed mill said  he didn't believe the water issues  for fire suppression had been adequately  ade-quately resolved.  ftcth Simmons said she was concerned  con-cerned with the substance abuse of  some of the employees of the com  pany.  \"I don't think we need any more  than what we have,\" she said.  would he sad lo lose child to  Set Sawmill on ptg I  iff ,  v.  '!  POOR COPYl  i", "parent": 22653316, "version": 1739887459778428929}, {"id": 22653318, "paper": "Vernal Express", "type": "page", "date": "1997-04-16T00:00:00Z", "year": "1997", "month": "April", "day": "16", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/bc/bb/bcbbc58c2a4486f0b3302109d02b8687b8d8e50f.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/e1/cd/e1cd82c6cc666498d45b55e93c0147fe5fd9e0fd.pdf", "page": 2, "ocr": "Opinion and Commentary  2 Vernal Express Wednesday, April 16, 1997  JACK-STRAWS  by JackWallis  Health reminders  cent.  The Blue Cross and Blue Shield of Utah Official  Grapevine publication for April had some good information  infor-mation concerning health research.  Researchers have added a few more risks from  smoking cigarettes. Did you know smoking...  Is a vitamin drain. Smoking depletes vitamin C  from the body, so smokers need 100 mg of C a day,  compared to non-smokers' 60 mg.  Causes painful backs. By cutting the supply of  oxygen and nutrients to the disks that cushion the  spine, cigarette smoking can quadruple the risk of  developing a bad back.  Can cloud your vision. Smoking doubles the risk  of developing cataracts.  Can slow recovery from illness. Smokers also  have a greater risk of complications from surgery,  including blood clots and pneumonia.  Can raise the risk of urinary incontinence.  Can increase your risk of a traffic accident.  Smokers have 50 percent more accidents and traffic  tickets, partly because of fumbling with cigarettes,  lighters and matches.  New research shows plain purple grape juice is better  bet-ter than aspirin or red wine in preventing heart  attacks. Research shows just 8 to 10 ounces of grape  juice has a potent effect on blood platelets, making  them less likely to form clots that can lead to heart  attacks.  The study at Uinversity of Wisconsin Medical  School experimented on 17 volunteers and found that  grape juice slows the activity of platelets by about 75  percent, while aspirin and red wine slow it by 45 per-  Sources of fiber comes from many other sources of  food other than breakfast cereals. They include:  Berries.  Dried or canned beans and canned chili.  Romaine lettuce or spinach for your salad instead  of iceberg lettuce.  100 percent whole wheat or whole grain bread. A  dark color isn't enough, check the label for fiber content.  con-tent. Mix a high-fiber breakfast cereal with your regular  regu-lar brand.  Brown rice.  Eat the skins of potatoes, pears and apples.  Look for crackers with at least 2 grams of fiber  per ounce.  Use whole wheat flour for baking.  Popcorn.  Dried fruit, such as apricots, berries and prunes.  Home is where the health is. Scientists at the  University of Pittsburgh say more than a quarter of  the 600,000 Americans hospitalized for pneumonia  each year could be treated safely and effectively as  outpatients.  The researchers say that because physicians have no  set criteria for determining which pneumonia patients  should be hospitalized, too many are admitted.  PUBLIC FORUM  LETTERS TO THE  EDITOR  What is your opinion? The Express welcomes letters  let-ters from its readers concerning any subject pertinent  perti-nent to the Uintah Basin. There are no restrictions  as to contents, if not libelous or vindictive and of  reasonable length (two typewritten double spaced  pages). Letters must be submitted exclusively to the  Express and bear the writer's full name, signature,  phone number and address. Letters may be mailed,  faxed at 789-8690 or through e-mail at editoreas-ilink.com.  editoreas-ilink.com. The name or names of those submitting  letters must appear on all published letters. All letters  let-ters are subject to condensation. Letters express  the opinion of the writer and are not necessarily the  opinion of the Express Editor.  Elementary  organization  Dear Editor,  As there has been community discussion about the  organizational plan that groups kindergarten, first and  second grades, third and fourth grades, and fifth grade  together, elementary principals in the Ashley Valley  would like to share the following information.  Reorganizing the elementary schools in the Ashley  Valley has:  increased the efficiency of school budgets so that  additional large class sizes were avoided and teacher  salaries could be brought to state average.  allowed all grade levels to have equal numbers of  students avoiding having 18 in a class at one school  and 32 in a class in the same grade at another school.  ended the need to continually change boundaries  between schools in an attempt to balance class loads. In  the past, some families have had to switch to new  schools because of boundary changes.  allowed each school to focus on their grade level  raising the quality of instruction, curriculum development,  develop-ment, special programs and media center collections.  caused student populations of different backgrounds  back-grounds to now be evenly balanced with common  expectations for curriculum and behavior.  allowed more choices for assigning students to  tcacher'i.  allowed for budgeting efficiencies because purchases  pur-chases arc concentrated on a smaller number of grades.  allowed the primary grade schtxils to offer a pre-kindergarten  pre-kindergarten und pre-first grade class which was not  possible in the K-5 schools.  not greatly changed neighborhood schools except  for students living very close to a school.  Neighborhood schools did not exist for a majority of  students More the present organization plan as most  students were eligible to be bused. We now bus more  students mainly because students from our only walk-n  school. Central tlemcntary. ate now consolidated with  Exp  (ISSN 0892-1091)  the other schools. This saves the operating costs of one  elementary school. Some 'students do have a longer bus  ride, but none exceed the maximum ride time set by the  State School Transportation Office.  caused siblings to be separated. Most had very little  lit-tle contact with brothers and sisters during the school  day in the K-5 organization plant. Having students in  closer age groups has decreased teasing and harassment.  harass-ment. not affected test scores based on the evidence collected.  col-lected. It is unlikely that any single factor can be separated  sepa-rated to demonstrate its affect on test scores.  Observations by parents and school staff members can  be given as opinion. It is likely that other factors play a  much greater role in student achievement, (ie. teacher,  parent support and student attitude toward learning).  Regardless, test scores, if affected at all, will not be  reflected for several years. Most school improvement  models suggest a five-year implementation period to  verify observable results.  All Ashley Valley elementary principals invite parents  par-ents and interested community members to visit schools  or to call with any questions.  DIXIE ALLEN  LARRY D. KLEIN  SHERRILL LAMB  LYLE SOUTHAM  LEONARD SULLIVAN  Dog shooting  Dear Editor,  On my way home at 8 p.m. Wednesday, April 9,  1997, 1 was met with an awful sight: one of the dogs  that lived in the neighborhood was limping very badly  toward home. Finally, in the intersection he could go no  more. He stopped and sat down with his head hanging  down. Myself and some other concerned neighbors got  the injured dog off the street and after trying for 30  minutes, finally found the dog's owners.  They took him to the vet, very upset I might add. I  found out the next day that the poor dog died during the  night from three gunshot wounds. I have a couple of  things to say about that. Chicken is the first thing. If  you have a problem with a dog coming to your house to  visit, first call the dog's owner (it's not that hard to find  where a dog lives if you bother to look.) Call the owners.  own-ers. Second, did you ever stop to think that the dog is  someone's pet? Slop to think how you'd feel if someone  some-one Uxk away one of your favorite friends (if you have  any). I know this dog and he wouldn't have hurt anybody.  any-body. He did get into garbage, but there are ways to  keep animals out of your garbage. One good way is to  cover it with tobasco sauce. They don't get in it again.  The only oilier reason I can think of lo sluxit a dog is  OH APRIL SHOWERS  KA AN rTAt- vrl ID WAV-  THEY BR1KJG FLOOD WATERS)  THAT COME IN MAY?  A.  for fun. Hopefully who ever did this is grown up and  smart enough to get their kicks off in another way.  JAMIE WHITING  Vernal  Putfid r-e'y Wlnw)ay tof 19 00 p yM in thcw9 t'M  v 1.10 em ye A 0 fo(0g ' 4Nn ! iJ SJ3 px yvat W  Ol ta U5 by V Vmil E ( PuWuhi9 CoWy. M  Noi Vem . Vnl. U t0t Pe\"0t'Wt pmgt pa4 M  Vnl Utah J0?t  POSTMASTER Se\"0 Vwt M VtHNAt IXPflESS. P0  Boa IOO0 Vet U4 1'0'S  jactft ( : Put  :py9i PI Wan t0 K5 C0 But  Ctlt Jp1 lWy AW  t' t Py 6fnyi Wt  M pny 4vrtnj  Wn Jacoy Jo\"p C'vwO'o\" I Cf)v'-d M  Vc. f ejl Pub Notees  ?B9 35 I FM Tt9 Mt e UW P As  American flag  Dear Editor,  Recently I have received numerous phone calls concerning  con-cerning the gold fringe, gold cord on the American flag  as well as the eagle atop the staff carrying the flag.  Through the National Headquarters of the Veterans of  Foreign Wars, I received from \"The Institute of  Heraldry\" United States Army, Ft. Belvcio, Virginia,  the following information:  The use of the eagle atop the staff carrying the  American flag has been an acceptable custom dating  back to 1835. The symbol it represents is strength and  courage.  The use of gold fringe and cord on flags in the United  States dates back 200 years. Fringe on the national flag  was used as early as 1835 and its official use by the  army dates from 1 895. There has never been any symbolism  sym-bolism ever associated with the gold fringe or gold  cord.  The eagle and gold fringe were added to enhance the  beauty of the American flag. The custom has been and  is that fringe flags be displayed in-doors except in  parades.  The use of flags with fringe and eagle extend from the  military, national, state and county government to civic  organizations and private homes. This includes court  rooms and commissioner chambers.  Over the many years, World War I, World War II,  Korea, Vietnam. Desert Storm, there were those who  tried their best to change that beautiful old flag. Thank  God there were multitudes of Americans who love the  flag and country enough to successfully raise up and  resist them.  Gold fringe, cord and eagle are here to stay.  DUANE HALL  Commander Veterans of Foreign War Vernal Post 5560  Education crossroads  Dear Editor,  We have watched with great interest the events affecting  affect-ing our Uintah School District over the past year. It has  been a year of much turmoil and change. Now, with a  complete and dedicated sch(xl board seated and in  place and with the announcement of the new superintendent,  superin-tendent, it seems we have reached a crossroads. We as  parents need to choose the direction we (parents) are  going to take from here.  We can choose to keep looking back to the \"good ol'  days\" when everything was familiar and we were all in  our cozy comfort zone going about educating our children  chil-dren the way it's always been done and raising a royal  ruckus every time anything comes up that may not be  convenient or comfortable, without regard to what may  be in the best interest of the \"quality\" education our  kids deserve and so desperately need.  Or we can choose, from this point forward, to help  move our kids into the future drawing upon the best  techniques, technologies, and the experience, information  informa-tion and dedication of a new superintendent and a  school board and staff anxious to learn to do everything  they can to give all of our kids the best education possible.  possi-ble. Being in a rural area, our children are faced with  many challenges. Geography can sometimes be a barrier  barri-er to opportunity. However, ingenuity and hard word  can often fill the gap. Worthwhile things are seldom  easy, and one of the most worthwhile things we can  give our children is a quality education.  We recognize and applaud the efforts that have been  made in this direction, while at the same time we realize  there is still a lot that needs to be done. We don't pretend  pre-tend to have all the answers, but we would like the challenge  chal-lenge everyone to stop at this crossroads, look forward  into the future, and see where we want our kids to be  when they reach the end of this educational road they  are on. Change and progress are inevitable, not only in  education, but in life. They are often difficult and  uncomfortable. We can choose to fight them at every  turn, or we can choose to learn, adjust and grow with  them.  If our children are going to be successful and able to  complete in that great big world out there, this is a valuable  valu-able lesson for them to learn. And example is often the  best teacher. It is our hope that we might all rally  behind a quality education and be willing to take which  ever road will get our children successfully there.  LORN and CINDY RUPPE  Jensen  Family pet  Dear Editor,  We wish it was not necessary to write this letter, for if  that were the case, our dog would still be alive.  Last Wednesday evening when all of our family was  away from home, a coward with no integrity shot an  innocent dog three limes with a .22 caliber gun. The  wounds did not kill our dog out right, but did cause  severe suffering. One of the bullets had lodged in his  neck. One had entered the hip and gone through the  pelvic bone. The last one entered through the front  See Pet on page 3  Mc\"y JW  D-oiMl Arfrti May 1 P \"  Cd Atvp-K Mrrttsf 4 pm  Voice of Business  Clinton budget scam  by Dr. Richard L Usher  president U.S. Chamber of Commerce  WASHINGTON-lf President Bill  Clinton and Vice President Al Gore were  h ilf as interested in reducing the federal  deficit as they are in raising money for  their political campaigns, there would be no need for  a Balanced Budget Amendment. Hie lame guyi who  have transformed the White Mouse into an upscale  version of Motel 6 should be able lo come up with  some creative ideas for balancing lite nation's checkbook  check-book without amending (he Constitution.  I'nfortunatcly. il appear Clinton and Gore have  invested most of their creative juices in political fund  raising ond very little in deficit reduction. The budget  they submitted to Congress for fiscal 1998 it a travesty  traves-ty of the political process a devious web of artful  dodges and scams so braen in its artifice that il is  impossible lo believe the Clinton administration actually  actu-ally thought il would be taken seriously by anyone.  President Clinton says his budget will lead lo a balanced  bal-anced budget by the year 2(()2. Of course, be will  lcac office in early 2(0I. Thus, il should come as no  surprise that 98 percent of the real budget cuts in his  budget arc scheduled to occur in ;wl2(m2. on  someone cle's watch.  The biggest obstacle to fiscal solvency is entitlement  entitle-ment spending which, if left unchecked, will eventually  eventu-ally drive the federal budget into meltdown. The president's  pres-ident's budget acknowledges this reality, but doesn't  deal with it. Social Security remains untouched and  the $100 billion allegedly saved from Medicare-based  Medicare-based on current baseline projections would be  squeezed from health care providers, not beneficiaries.  beneficia-ries. The Medicare proposals shift payment of home  health care from the Hospital Insurance trust fund  (Part A) lo the Supplementary Medical Insurance  trust fund (Part B). All Ihis means is that the Part A  trust fund would hemorrhage a little less while general  gener-al taxpayers, who pay for Part B. would carry a bigger  big-ger share of the Medicare burden.  While avoiding any serious budget cuts, President  Clinton proposed a truckload of new entitlement  spending: SIS billion in new Medicare benefits; SS  billion in new Medicaid benefits for children; $10 billion  bil-lion in health care benefits for unemployed adults; $4  billion in health tare benefits to children not receiv.  ing Medicaid, 16.2 billion in school construction and  other education spending; and $21.3 billion more for  ftmd stamps. SSI. employment and other welfare-reform  welfare-reform related benefits,  In sum, the Clinton administration's claim that its  budget would lead to a $17 billion surplus by the year  2X)2 is not credible. The Congressional Budget  Office says the true figure is more like $69 billion in  red ink. and ihut is assuming that whoever inhabits  the Oval Office then will make the difficult decisions  that Clinton refuses lo make now. Budget analysts al  The Heritage Foundation contend even that figure is  loo optimistic, and that the true deficit in 2U02 under  the Clinton budget would be $1 17 billion.  In fact. Heritage said the Clinton plan would generate  gener-ate a deficit $18 biilion higher than would happen if  no changes were made to current spending policies,  adding $718 billion to the national debt over five  years, or $132 billion more than current law.  President Clinton clearly wants balanced budget,  or at least he says he docs, but not to the point thai he  might actually have to make some difficult decisions  or recommend course of action thai could possibly  offend some of his constituents, His attitude reminds  me of the famous prayer of St, Augustine. \"Lord give  me continence, but not yet Clinton wants balanced  budget based on spending tuts -hit not until he's  back in Arkansas.  1", "parent": 22653316, "version": 1739885216383631361}, {"id": 22653319, "paper": "Vernal Express", "type": "page", "date": "1997-04-16T00:00:00Z", "year": "1997", "month": "April", "day": "16", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/11/a4/11a41bc61c503bdf227fa82e6fe18cb5ee847028.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/f9/9c/f99cea8ce16d6a0491b91a955928b90dbdb6389a.pdf", "page": 3, "ocr": "Female Lazuli bunting, one of the many birds that can be viewed at  the Ouray Wildlife Refuge.  Ouray open house slated  The third annual Ouray National  Wildlife Refuge Open House has  been scheduled for Saturday, April  26. Residents throughout the Uintah  Basin are invited to attend this popular  pop-ular event, which runs from 7:30  a.m. until 1 p.m. at the Refuge site.  Guided songbird tours will be  available, as will tours of the hatchery  hatch-ery for endangered fish species.  Live hawks will be featured, and  hands-on activity booths and displays  dis-plays about plants, wetland insects,  ducks, herons and other wildlife are  also planned.  According to organizer Kelli  Stone, over two hundred visitors attended  at-tended the open house last spring,  in spite of strong winds which curtailed  cur-tailed the variety of activities. She  CAVMC recognized for  excellence at conference  Columbia Ashley Valley Medical  Center in Vernal is recognized for  excellence in a number of areas at  recent national leadership conference  confer-ence sponsored by ColumbiaHCA  Healthcare Corporation.  Columbia Ashley Valley Medical  Center is perhaps the smallest hospital  hos-pital among the nearly 350 hospitals  hospi-tals which belong to the nation's  largest healthcare provider,  ColumbiaHCA Healthcare  Corporation. However, that doesn't  stop Ashley Valley from being a  top performer. The hospital was  recognized for excellence in the  following areas:  Teamwork Excellence 1996  Employee Survey Leader  Western Group Excellence  Award Supply Compliance 1996  Western Group Excellence  Award, Build the Network 1996  \"We feel fortunate to be part of a  healthcare system that strives for  'Real  Estate  Corner7  by'  Pat  Harrell  BUYING TO SELL  If you want to buy a  house, fix It up and sell It at  a profit, here are some  guidelines for a more  profitable project.  Ask your real estate  broker to help you select a  neighborhood with a recent  history of Increasing  property values. Also looK  for a house that's been on  the market for a long time;  the seller may be ready to  deal. The house 6houid be  comparable In size to its  neighbors, structurally  sound, but In need of  modernization.  Start with the  landscaping and the home's  exterior. This is what the  buyers see first. Next,  concentrate on the 'hot  spots of buyer appeal - a  bright kitchen and modern  baths. And look for low  cost ways to increase closet  and Cabinet Space.  Pat Kartell  Cotdwell Banker  Aspen Brook Realty  She can be ttach&J at  789-7555 8285063  789238  y yr  hopes for an even larger turn out  this year.  \"The refuge is open seven days a  week year round,\" said Stone. \"On  this special day, however, there will  be biologists and volunteers avail-,  able to answer questions and help  identify wildlife. If you have ever  wondered what 'that bird refuge' is  all about, this is the day to come  and find out.\"  Since the event is planned during  the early hours of the day to avoid  possibly poor afternoon weather.  Boy Scout Troop 234 will provide  breakfast foods at a minimal cost  from 7:30 a.m. - 9:30 a.m.  The Refuge can be reached by  taking the marked turnoff from  Highway 40, approximately 14  miles west of Vernal.  quality and satisfaction from employees  em-ployees and those who choose to  receive healthcare from our facilities,\"  facili-ties,\" said Ron Perry, CEO of  Columbia Ashley Valley Medical  Center. \"As a community hospital  we are always striving to make sure  our service reflects both quality and  patient satisfaction. And, as was  noted at the leadership conference,  employee satisfaction drives patient  satisfaction. So it was with pride  that we accept an award that reflects  re-flects the satisfaction of our employees.\"  em-ployees.\" Columbia is the nation's largest  provider of healthcare services with  more than 340 hospitals, 130  surgery centers and 500 home  health locations in 37 states,  England and Switzerland. In Utah,  ColumbiaHCA serves 82 percent  of the population with seven hospitals,  hospi-tals, one surgery center and nine  clinics, and home health agencies  statewide.  Board  approves  contract  The Uintah School Board and the  Uintah Basin Applied Technology  Center (UBATC) have finalized a  contract which allows the UBATC  to establish a satellite campus near  Uintah High School.  UBATC plans to install four modular  mod-ular buildings north of the LDS  Seminary building and just east of  UHS. The new classrooms will provide  pro-vide Uintah students with improved  access (o technology education  which will be similar to the tech  program currently in place for  Union High students in Roosevelt,  The contract calls for a token $10  monthly lease of the school district  property and makes the UBATC re-sponsible  re-sponsible for the care and  maintenance of the structures.  The modular buildings were constructed  con-structed as part of the building  trades class at the Roosevelt  UBATC campus. They should be in  place and operational by August,  LDUITF\".  X.  IOSEIO LOS  2, IN 3 DAYS  MIWH l-U I t  PUBLIC FORUM  LETTERS TO THE EDITOR  What is your opinion? The Express welcomes letters from its readers  concerning any subject pertinent to the Uintah Basin. There are no  restrictions as to contents, if not libelous or vindictive and of reasonable  length (two typewritten double spaced pages). Letters must be submitted  submit-ted exclusively to the Express and bear the writer's full name, signature,  signa-ture, phone number and address. Letters may be mailed, faxed at 789-8690  789-8690 or through e-mail at editoreasilink.com. The name or names of  those submitting letters must appear on all published letters. All letters  are subject to condensation. Letters express the opinion of the writer  and are not necessarily the opinion of the Express Editor.  Pet...  Continued from page 2  shoulder and exited the other side.  He was able to make it within two  houses of our home. Thanks to kind  and caring neighbors, we were  located and told that our dog was  severely wounded. One of our  neighbors sat with our pet until we  arrived to take him to the vet.  He was operated on and given a  5050 chance of surviving. Dr.  Mathis indicated there had been a  great deal of damage and that a  stroke or blood clot was a possibility.  possibili-ty. At four the next morning he  passed away.  We would like to say to this coward  cow-ard that \"your deed was done.\" A  harmless family pet is now off the  streets. You can rest easy. We wish  you had been the one to tell our son  that his dog did not live. What  would you have said to him?  Would you have said that you were  protecting your rights? When you  choose an action such as this, you  are not protecting your rights, you  are taking away the rights of another  anoth-er individual. After talking to the  county, we were told that the only  time it is lawful to shoot a dog is if  the dog is endangering human life  or livestock. Neither was the case  with our pet. We are not writing  this letter to defend the actions of  dogs. We have had our own com  Buy a new kitchen, pay  college tuition or get something  some-thing you've always wanted  want-ed with our Home Kquity  Credit Line, and something  some-thing kind of strange  happens. Suddenly, your  name and genius are being  TV ifnnl wmIi iwnUtwt M,  twit m Sw H ik  Inm.in.ttl, una SI .TV tr,Ut  APS) tV wi'-w APS I\" !Vk , i\", u m to ,MWI tl Inn S9 hnl ,1 iim'h t tT imw hw th h w Ymm lm. fetal  tvn t foy lx mJR Vm....l tn (V kV A l!S,t,.f tV UnUku t t.Mi ikm (l I -00 II w4 1 ili\" n rW  Att int. Q b in tmA Tli nl'rt .lMf t Ym f-l.lv trt Iwln 1V\"Q A'M f-r ftwtrul vlMt tNrat l!MlW4t  plaints with neighborhood dogs.  What we would like to have our  community understand is that given  the time frame we were gone from  our home, our dog did not have  time to get out of a populated  neighborhood and back severely  wounded. Now by our calculations  the individual that shot our pet was  shooting in a highly populated are.  We have many children playing in  our neighborhood and at the time of  day he was shot there are people  traveling the road. If our dog was  hit three times, we are sure there  were more than three bullets fired.  Where did the other bullets go? Is it  going to take a child or someone  riding in their car getting shot to  put an end to these self-appointed  executioners?  If you have a complaint, a legitimate  legiti-mate complaint, why can't you go  to the dog owners first? Give them  the opportunity to right the wrong.  If they will not be responsible, call  the Animal Control Office. He was  very prompt in returning my call.  Not everyone that owns a pet is a  responsible owner, but they should  be. All we can hope is that they  become such or choose not to own  animals.  This is not the First incident of  shooting in the Davis area. We  know of a family that was new to  our neighborhood. This of course  meant their dog was also new. Let  out on the run for a few minutes  Open a Zions Bank  Home Equity Credit Line  AND PEOPLE will think  YOU'RE A FINANCIAL GENIUS.  SIX MOSTH APR ISTROIH XWR Y H-i TE VARIABLE APR W LOASTOVAI.l'F.  No Points  The smart way  mentioned in the same  sentence. See, any genius  worth their 1Q knows that  a line of credit that gives  you lax-deductible interest  and lets you access 100  of the equity you have in  your home is a very smart  ft JiV AwomI Katr I fHl tV t.ij  MW A t 4 1t th tt w .....!i  l ( h I 110 2.V APKt. ri wv  Vernal Express  while the owner washed his car, the  dog was later found on Highway 40.  His mouth had been tied shut and he  had been shot. There was also  another dog in the same condition  laying along side this dog.  We have had dogs shot that have  lived, but most do not. We are  appealing to the citizens of the  Davis area to take a good look at  this problem and the bigger problem  it can become if a human gets  injured or worse, loses their life.  We have a responsibility to look out  fpr one another's rights. If you  know of individuals committing this  sort of act, please notify the County  Sheriff. Please do not play ostrich  and stick your head in the sand pretending  pre-tending that it doesn't matter. You  may be the next victim.  We will get over our loss in time.  Even with our loss we would rather  be us than the dishonest coward that  took the life of a family pet. After  all, aren't humans suppose to be the  intelligent animals?  STEVE and CALEEN HULET  Vernal  Veterans  Dear Editor,  Duchesne County boasts a veteran  population in excess of 800, yet,  sadly, the majority would rather  reap the benefits of others efforts  than to get off their duffs and join a  service organization, thereby lending  lend-ing strength to other's efforts. I cannot  can-not speak for the other two service  organizations (DAV & VFW), but  the American Legion has a meager  membership of 2I5 (at present) in  Duchesne County, a mere 26 percent  per-cent of the veteran population.  I belong to John F. Young Post 6  of Fruitland, which is responsible  for all the Legion activities in the  west end of the county. As such, we  sponsor all Memorial Day activities.  Boys State and military funerals for  I No Fees  to borrow money.  way to borrow. Plus, for  the first six months after  you obtain your credit  line, we'll give you an  introductory 6.25 annual  percentage rate (APR).  And there are no origination  origina-tion fees, no appraisal fees,  .Mr ttt JI lW ifcnMfo tn)  4 mt Iwwi ik fm m h tfiA t  pi V nn r M'Hl SI W rT1  Wednesday, Apr! 16, 1997  Fruitland and TabionaHanna.  Veterans who never join do make  sure their survivors know that they  are eligible for a military funeral.  Again, sadly, since membership is  so small, getting funeral detail  together is extremely difficult, and  is primarily made up of WWII and  Korean War vets. All you  VietnamGulf War vets: Listen up.  We are getting older and one of  these days there won't be anyone  left to fight for your earned benefits,  bene-fits, or even to bury you, unless you  join and carry on for yourselves. Of  over 20 military funerals where I  have been the Honor Guard  Commander, only four have been  for a member of a service organization.  organiza-tion. There are WWII. Korean War,  Vietnam War and Gulf War vets  throughout the county who could  join and help out, but don't. It doesn't  does-n't embarrass me to ask: Why not,  guys, why not? But, does raising  your flag on Memorial Day or at a  funeral burying one of your own  when you could be helping out?  Come on, guys, support us and  yourselves: join some service organization  orga-nization or you're going to lose all  your old workhorses someday, and  then what will you do?  JOHN FARGASON  Fruitland  Express  54 North Vemal Ave. 798-3511  and no closing fees. To  find out more, simply eall  1-800-89-LOAN or stop  by any Zions Bank branch.  ZIONS BANK  ka tnn liwil im l  h tmm (Am ,WX fl h APil II m  111 J\" WHY. 1IIOT firm M M (I  Xggp \"ground-up  x a news", "parent": 22653316, "version": 1739895308886736898}, {"id": 22653320, "paper": "Vernal Express", "type": "page", "date": "1997-04-16T00:00:00Z", "year": "1997", "month": "April", "day": "16", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/5f/95/5f95c4f352fdd60e8b35d768fd27d77e74a0bbaf.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/da/07/da07c3a92eda735221eb673b5f645ca3797363f7.pdf", "page": 4, "ocr": "4 Vernal Express Wednesday. April 16, 1997  Obituaries  James W. Lewis  James Lewis  James Walter Lewis, 74, of  Vernal, died April 9, 1997 at the  Uintah Basin Medical Center in  Roosevelt, following a lingering illness.  ill-ness. He w as born Sept. 22, 1922 in  Toledo, Ohio to Walter James and  Rose Josephine Burger Lewis. He  married June Alice Stone on Dec.  22, 1940 in Vernal.  Jim was a member of the Catholic-Church  Catholic-Church and served his country during  dur-ing WWII. He loved to garden and  spend time with his children and  grandchildren.  Jim is survived by his wife, June,  of Vernal; two sons, Scott Lewis of  Canby, Ore., and Chris Lewis of  Salt Lake City; two daughters,  Michel Brantly of Woodbridge, Va.,  and Patricia Heerman of VanNuys,  Calif: four grandchildren and three  great-grandchildren.  He was preceded in death by a  sister. He'en Langendorfer.  Funeral mass was held Saturday,  April 12 at the St. James Catholic-Church  Catholic-Church under the direction of  Hullinger-Jolley Funeral Home.  Cold slows  spring farm  preparations  Last week\"s cold spell with occasional  occa-sional snow slowed spring preparations.  prepara-tions. Death loss of calves and  lambs were normal.  Spring grain seedings were spring  wheat 57 percent complete, barley  63 percent complete, and oats 28  percent complete, according to the  Utah Agricultural Statistics  Service. These crops were normal  to slightly behind normal for this  time of the season. Small grain  emergence was 16 percent for  spring wheat. 11 percent for barley,  and 6 percent for oats. These were  9 to 15 percentage points behind  normal. Cows calving was 70 percent  per-cent complete, while lambing on  the farm was 75 percent complete  and lambing on the range was 34  percent complete. Calving and  lambing were running between 4 to  S percentage points behind normal.  Sheep shearing on the farm was 65  percent complete, 4 percentage  points behind normal. Sheep shearing  shear-ing on the range was 40 percent  complete. 10 percentage points behind  be-hind normal. Cattlecalves and  sheeplambs conditions were fair to  excellent. Fall barley condition and  winter wheal condition were mostly  fair to excellent throughout the  state. Subsoil and topsoil moisture  were mostly adequate to surplus.  Twenty -one percent of pasture  and rangcland was rated poor or  very poor. 21 percent fair, and 58  percent good to excellent. There  were over 4 days suitable for field  work last week,  After Sity 'Three 'years  by 'Ikdyret Cv  he is not het to with me a bright good momma utter a good  nghts iUtp.  iu is not hert to help mat plans for the dau u a tat  ttrtiifjott.  he is not hert to point out how bnjht it is whit the tun  fvft comas up m tht morn in J  he is not hert to point out'the first tulips that raw their  heals in the spnna  he is not hert togo out in the orchard to see if the cherrvs  art getting npt.  $he is not hert to uanderm the garden and set if tht rasp-bernes  rasp-bernes art ready to r-w  fhe is not hert 'to point out a sunset tihen the tfeuls art a  bnght red color.  'Peart s bngnt smue is missing from the home and she has left  a vacant spot that cannot bit filled.  t hat had a hard time U'ntwg this because the tears hat  made it so t couid not set at times.  She is n,t hert but t no1 sht is uaumg for me in i mtuh  better c.t.  It utrfnot bt too (ong befoi ut  that pfact U-hei sht is batting.  4  .... W. ' - jf ' A.  Si.'  John Harrison  John Harrison  John Carlin Harrison, 76, of  Naples, died April 9, 1997 at his  home. He was born December 15,  1920 in Lapoint, a son of Jeremiah  Harrison and Elizabeth Nyberg  Harrison. He married Helen Marie  Bullock on Aug. 23, 1941 in Salt  Lake City. Their marriage was solemnized  sol-emnized in the Salt Lake LDS  Temple in 1991.  John was a carpenter and a veteran  veter-an of WWII. He was a member of  the Church of Jesus Christ of  Latter-day Saints, Naples 1st Ward,  and served as a home teacher. He  enjoyed hunting, fishing and the  great outdoors. He was a clock  maker and will be remembered for  his beautiful pieces of wood work  which were a work of art.  He is survived by his wife, Helen  Harrison of Naples; children, Gary  and Sandy Harrison of Sedro  Wooley, Wash., Joan and Robert  Janes of Vernal, Vivian and Larry  Colobella of North Salt Lake,  Janice and Richard Nylund of  Leeds; 15 grandchildren, 16 greatgrandchildren;  great-grandchildren; brothers and sisters,  Clinton Harrison of Lapoint,  Murray Harrison of Glendale,  Ariz., Hayden and Bud Harrison of  Lapoint, Janeal Holladay of  Mantua, Ann Birchell of Roosevelt,  and Ramona Hansen of Seattle,  Wash.  John will always be remembered  for his devotion and love for his  family and the true Good Samaritan  that he was.  Funeral services were held April  14 at the Naples 1st Ward LDS  Chapel under the direction of  Thomson's Vernal Mortuary with  Bishop Grant Hatch conducting.  Murray Harrison, brother, gave  the family prayer, and Norine  Merrell played the prelude and  postlude music.  Lora Cooper, granddaughter gave  the invocation, Bert Harrison,  grandson, gave the eulogy.  Speakers were Marcy McDonald,  granddaughter, Kirt Harrison,  grandson, and Dan Olsen. A presentation  presen-tation was given by the Colobella  grandchildren.  Daun DeJournette and Ron  Walker sang \"These Hands\" and  \"Springtime In The Rockies.\"  Bishop Grant Hatch offered remarks,  re-marks, and Gary Harrison, son,  gave the benediction.  Clinton Harrison, brother, dedicated  dedicat-ed the grave.  Pallbearers were Murray  Harrison, Hayden (Bud) Harrison,  Larry Colobella. Clinton Harrison.  Richard Nylund and Robert Janes.  Compassionate services were offered  of-fered by Naples 1st Ward Relief  Society.  Interment, with full military honors  hon-ors by the American Legion, was in  the Lapoint Cemetery under the direction  di-rection of Thomson's Vernal  Mortuary.  u u? be together aaatn w  DeMarr Dudley  Andrew DeMarr Dudley was born  in Jensen, May 6, 1901, the eldest  son of Andrew Dudley Jr. and Sina  Jensen Dudley, early pioneers of the  Uintah Basin. He w as born in a log  cabin and lived there until the four  room brick house was built by his  father in 1911. A love for reading  and learning was instilled early in  him by his mother who had been a  teacher before coming to Jensen.  DeMarr attended school at the local  Jensen school and the old Uintah  Academy in Vernal. He spent one  year at the Utah Agriculture  College, now Utah State University,  in Logan. He began teaching at  Jensen when he was 19 years old.  He taught in Jensen for two years,  one year as principal, and then  moved to Huntington, Emery  County, where he was principal for  one year.  DeMarr returned to the farm in  Jensen and started his poultry business.  busi-ness. For several years he raised  and marketed turkeys, and became  president of Turkey Growers of  Utah. Later he moved into the production  pro-duction of chickens and eggs. For  50 years, DeMarr operated the  Dudley Poultry Farm. At the peak  of operation the farm had 20,000  laying hens with a modern brooder  house, laying houses, and a well-equipped  well-equipped egg processing plant and  sales room. The eggs were marketed  market-ed in many outlets in Utah,  Colorado and Wyoming.  Besides his poultry business  DeMarr was active in community  affairs. He spearheaded efforts to  bring electric power and running  water to Jensen. He served on the  board of directors for Moon Lake  Electric for several years and as  president for one term. He modernized  modern-ized the Burns Bench Irrigation system  sys-tem and was president for six years.  In 1967, he and his cousin Curt  Dudley, started working on a  project to bring culinary water to  Jensen. The water was finally  turned into the pipes in the summer  of 1972. He served as president and  general manager of the Jensen  Water Improvement District until  January 1985. As a result of availability  avail-ability of water DeMarr was influential  influ-ential in the beautification and upgrading  up-grading of the Jensen Cemetery.  He was an active member of the  Uintah Farm Bureau and served as  president for several years. DeMarr  was also a member of the Vernal  Lions Club, Vernal Chamber of  Commerce and the Knife and Fork  Club.  When he was 65-years-old, he  learned to downhill ski, much to the  amazement and dismay of his wife  Dewain Davis  Dewain LeRoy Davis, 31, of  Vernal, died April 8, 1997 at the  Columbia Ashley Valley Medical  Center in Vernal. He was born Jan.  15, 1916 in Orem, a son of LeRoy  Norman Davis and Mary Park  Davis.  Dewain married Eleanore Norum  on April 14, 1945 in Provo. He  worked as a transport truck driver.  He was a member of the Church of  Jesus Christ of Latter-day Saints,  Vernal 6th Ward. He was a member  of Timpanogas Archery Club and  enjoyed hunting and fishing, and a  was a rock hound in his younger  years. He was also a former resident  of Orem.  Dewain is survived by his wife,  Eleanore of Vernal; children, Kerry  and Pamela Davis, and Kevin and  Diane Davis all of Vernal, Dix and  Marge Davis, Brent and Sonja  Davis, and Julie Davis all of  American Fork, Sherrie and Lynn  Rhoades of Good Spring, Ncv.; 22  grandchildren and many greatgrandchildren.  great-grandchildren. Funeral services were held April  11. 1997 at Thomson's Vernal  Mortuary with Bishop James R.  Jaussi conducting.  Kerry Davis gave the family  prayer, and Keith Pamsh provided  the prelude and postlude music.  Mike Fenton gave the invocation  and Pam Davis gave the obituary.  Keith Parrtsh plaved \"Beautiful  Savior.\"  Speakers were Gordon Sciu and  Bishop James R. Jaussi.  Brent Davts gave the benediction  and Dix Davis dedicated the grave.  Pallbearers were Joshua Davis,  Trrnprmlum  Cue High Lin Ptecip.  April i JS 20  April 9 45 33  April 10 40 23 .55  April II 34 !&  April 12 36 13  April 13 45 12  April 14 td la  A. DeMarr Dudley  and family. He also spent many  happy hours river running and  working on his rafts.  DeMarr was an active member of  the Mormon Church, and served on  a mission in the eastern states. He  converted to the Catholic Church in  1944. His wife and children also became  be-came members of the Catholic  Church at that time. He and his  wife, Mada, were among the original  origi-nal parishioners of St. James Parish  and remained very involved  throughout the years.  DeMarr married Mada Shelley of  American Fork in 1931. They have  five children, Sheldon DeMarr of  Taylorsville, Arlene Dudley Deneen  of Oroville, Calif., LaRae Dudley  Grosso of Walton, N.Y., Ruth  Dudley Stoddard of Cheyenne,  Wyo., and Lois Dudley Gotfredson  of Petaluma, Calif. They have 19  grandchildren and over 30 greatgrandchildren.  great-grandchildren. DeMarr was always  a devoted husband and loving father.  fa-ther. Funeral mass was held Monday,  April 14, at the St. James Catholic  Church under the direction of  Thomson's Vernal Mortuary with  Father Jan Bednarz and Father  Victor G. Bonnell officiating.  Carol Jackson and Janean Lekas,  accompanied by Amy Lube Allen,  sang \"Be Not Afraid,\" \"Ashes,\"  \"You Are Here,\" and \"On Eagles  Wings.\"  Readings were given by Anna  Maria Freeman, Janis Deneen,  Daun Stoddard and Janette McCall.  Pallbearers were Chris Deneen,  Stephen Grosso, Andrew Dudley,  Dan Zumbo, Dave Blackburn, Jim  Decklever.  Interment and Committal service  was in the Jensen Cemetery under  the direction of Thomson's Vernal  Mortuary.  Dewain Davis  Justin Davis, Kevin Davis, Jake  Davis, Joseph Davis and Kerry  Davis.  Honorary pallbearer was Adam  Davis.  Compassionate services were offered  of-fered by the Vernal 6th Ward Relief  Society.  Interment was in the Vernal  Memorial Park under the direction  of Thomson's Vernal Mortuary.  Looking for a  Home Equity Loan?  Advanced Funding can help.  To name a few benefits:  Several different term options  Home improvement, debt consolidation, etc.  Perfect or less than perfect credit  Self-employed programs  Full refinance programs  Call for your  FREE Credit  ft Analysis  TOLL FREE 1-888-571-HOME  (801)272-0600  I 2  Beatrice Bennion  Beatrice Bennion  Beatrice H. Murray Bennion  passed away Tuesday, April 8,  1997 at her home in Vernal. She  was born February 12, 1907 in  Vernal, Utah, the daughter of  William Ashby and Beatrice  Monellie Howarfh Murray.  Bea was raised by her Uncle  Dave and Aunt Lizzie Karren  where she was loved as one of the  family. She lived in Vernal all her  life and attended the schools in  Uintah County. She graduated from  Brigham Young University with a  normal teaching certificate. She  married Enos Leland Bennion Sr.  on Jan. 30, 1932 in Price. He died  March 11, 1962.  Beatrice was a member of the  Vernal 9th Ward. She was an avid  gardner, seamstress, teacher and  homemaker. Her family was very  important in her life; she enjoyed  spending time with her children and  grandchildren.  She is survived by one daughter,  Carol Lee and Francis Palmer of  Vernal; and two sons, David K. and  Susan Bennion of Boise, ID; and  Enos L. and Marilyn Bennion of  Brigham City; also a niece, Patty  Jane Eliason Barber of Auburn,  Wash.; 10 grandchildren, David,  Andy, Jeff and Leland Palmer,  Maralee Powley, Laralee  Davenport, Natalie and Leland  Bennion, Susan Johnsen and  Annette Whitaker; 10 great-grandchildren;  sisters, Clara Jenkins,  Winona Olsen, Buela Hall, Leatha  Mae Dean, Lorena Abplanalp and  Lu Feltch; and brother. Bill Murray.  Funeral services were held  Saturday, April 12, 1997 in the  Vernal 9th Ward Chapel under the  direction of Thomson's Vernal  Mortuary with Marland Stagg conducting.  con-ducting. Maureen Johnson played the prelude  pre-lude and postlude music, and  Kenneth C. Johnson, grandson,  gave the family prayer.  David B. Palmer, grandson, offered  of-fered the invocation and Marland  Stagg gave remarks and obituary.  Speaker was Enos L. Bennion,  son.  Beatrice's grandchildren, accompanied  accom-panied by Maureen Johnson, sang  \"I Often Go Walking\" and \"My  Heavenly Father Loves Me.\"  Susan Johnson, Natalie Bennion  and Andrew L. Palmer gave tributes  trib-utes to their grandmother.  Jeffery C. Palmer, grandson gave  the benediction, and Francis A.  Palmer, son-in-law dedicated the  grave.  Pallbearers were David B.  Palmer, Jeffery C. Palmer, Jim  Davenport. Andrew L. Palmer,  Leland C. Palmer and William  Powley.  Honorary pallbearers were Leland  D. Bennion, Kenneth C. Johnson  and Craig M. Whitaker.  Compassionate services were offered  of-fered by the Vernal 9th Ward Relief  Society.  Interment was in the Vernal  Memorial Park under the direction  of Thomson's Vernal Mortuary.  ADVANCED  FUNDING  HOME MORTGAGE LOANS  El  I  Luke D. Heiner  Luke D. Heiner  Luke Daniel Heiner of Vernal,  was bom July 2, 1980 in Murray, a  son of Daniel Glenn and Cathy  Anne Jones Heiner. He died of cardiac  car-diac arrest April 14, 1997 at the  University of Utah Medical Center  because of injuries suffered in an  automobile accident on April 10,  1997.  Luke is the fourth of five children.  He was a very kind, gentle young  man who had a great zest for life.  He spent most of his time with his  family and friends. He loved to hunt  and fish. He enjoyed basketball,  football, swimming and video  games.  He was in the 11th grade at  Uintah High School. He was always  very cheerful and he made the best  of everything. He was a Life Scout  and was very close to becoming an  Eagle Scout. He was a Priest in the  Vernal 1st Ward and was strongly  desirous of serving a mission for the  Church of Jesus Christ of Latter-day  Saints.  Luke is survived by his parents,  Dan and Cathy Heiner of Vernal;  sisters and brother, Christy,  Cammie, Alan and Lacey; his  grandmother, Maxine Heiner of  Bedford, Wyo.; seven uncles, six  aunts and their spouses; and 39  cousins.  Funeral services will be held  Friday, April 18, 1997, at 1 p.m. in  the Vernal 1st Ward LDS Chapel,  200 West 250 North, Vernal.  Friends may call at Thomson's  Vernal Mortuary ' on Thursday  evening, April 17, from 7 p.m. to 9  p.m., and on Friday at the Vernal 1st  Ward LDS Chapel from 1 1 a.m. until  un-til time for the services.  Burial will be in the Bedford  Cemetery, Bedford, Wyo., with  graveside services on Saturday,  April 19, at 2 p.m. under the direction  direc-tion of Thomson's Vernal Mortuary.  Class of 1947  Thank you for the  flowers and your  thoughtfulness  Ut K. Woelhf  & family  Place lour Ads  with Us for  Added  Itr our provisional  od staff crcatt somt  \"working\" soles mts  sagts for you . , . and  watch the results pile  up in profits!  Express  Call  789-3511  Right Now!  Cpurtwy q( Sky Writ Airiii", "parent": 22653316, "version": 1739885255699988480}, {"id": 22653321, "paper": "Vernal Express", "type": "page", "date": "1997-04-16T00:00:00Z", "year": "1997", "month": "April", "day": "16", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/84/fd/84fdb569b820a0cd7aec8affe00360f1f659a438.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/2d/21/2d2198443acd51ba654cca0055777bb57963c029.pdf", "page": 5, "ocr": "Riverdale early  settlers, John  and Caroline  John Thomas Chivers was born  Nov. 9, 1855 in Clintwell, Wales.  He, along with his parents and family,  fam-ily, immigrated to the United States,  when he was seven years old.  The Chivers came to Utah and  settled in Willard, Box Elder  County. In 1871 they moved to  Malad, Idaho, there John met and  courted Caroline Elizabeth Hunting.  Caroline was born Feb. 10, 1862  in Murray, Utah to Nathan and  Elizabeth Radmall Hunting. The  family moved to Malad, Idaho in  1867.  The Hunting family heard that the  Uintah Basin in Utah was a good  place to live and they decided to  leave Malad and go to the Basin.  John and Caroline were planning  to get married, so John went along  with the Hunting family. When they  got to Logan, John and Caroline  were married in the Logan Temple  Oct. 22, 1884.  The family spent the winter in  Springville, but sent two of their  sons, Nathan and John, ahead to  Vernal. When spring came, they returned  re-turned and helped the family move.  They arrived in the Uintah Basin  May 30, 1885.  At that time there was no water  on the bench, so the family settled  in Riverdale, now known as Jensen.  On Aug. 23, 1885, the Riverdale  Ward of the Church of Jesus Christ  of Latter-day Saints was organized  with Nathan Hunting as bishop and  John Chivers as his first counselor.  They held these positions until  March 8, 1891, when the ward was  divided.  John helped to bring the first  thrashing machine to Ashley Valley,  and worked on it for many years.  He supervised the building of the  canals built on the Ute Indian reservation  reser-vation and was also was one of the  first men to work on the Dyer Mine.  For many years John hauled  freight from Price. All groceries,  hardware, clothing, etc. had to be  hauled in. These were miserable  trips with no tent to sleep in and  scanty meals. Other teamsters tell  how John would stay up at night to  cook a pot of dry beans and bacon  so they would have something for  breakfast the next morning.  John was also a farmer and livestock  live-stock man. When the bad winter of  1917 hit, he had finally built up a  good herd He, like many of his  neighbors, watched their herds, to  the last animal, starve to death.  John was well known for his  square dance calling ability. He was  also in charge of many of the  dances and was very strict. The  young people liked to slip into a  corner and dance a little \"step,\"  which was not allowed. Another  rule was that no young lady could  leave the dance hall until the dance  was over.  Caroline and John had seven sons  and two daughters. All those overalls  over-alls and shirts, along with everything  every-thing else, had to be washed  without a washing machine.  Electricity didn't come to the  Chivers' home until 1916.  John was a charitable, kind man  with a great sense of humor. One  story he liked to tell was about the  first general election in the valley.  Voting was held in Old Ashley  Town north of Vernal. He and three  other men traveled over bad roads  by team and wagon from Riverdale  to cast their votes. It look almost a  full day to make the trip. On the  way home they disclosed how they  had votcd-two Democrat and two  Republican.  John died Nov. 14, 1922, and  Caroline died March 18, 1944.  They were buried in the Vernal  Memorial Park Cemetery.  Submitted by the Daughters of  Utah Pioneers  Uintah County ComHiny  THERE'S NOTHING  MIGHTIER THAN  THE SWORD  AMERICAN  SOCIETY  FOI MORC INF0MUT10N CAll  TOIL Mil 100 A&H4S  V? CANCER  V SOCIETY  Det. Keith Campbell conducts Rural Gang Update.  Law officers given  gang training  During a two-day Utah Gang  Update, last week on Salt Lake  City, members of the Uintah Basin  Gang unit were given valuable  instruction and they were given the  opportunity to impart what they  have learned.  The Uintah Gang Unit was established  estab-lished a year and a half ago with a  federal grant. There are three Uintah  County deputies, three Vernal City  officers and one Naples City officer  in the Unit.  Det. Keith Campbell, Uintah  County deputy, conducted a Rural  Gang Update both days of the Utah  BLM proposes changes  The Bureau of Land Management  has published a proposed rule  aimed at streamlining and revising  its cooperative agreement regulations  regula-tions dealing with tribal oil and gas  inspection and enforcement activities  activi-ties on Indian land. BLM Acting  Director Sylvia Baca said the proposal  pro-posal \"is another step forward in the  Federal Government's efforts to fulfill  ful-fill its trust responsibilities to  Native Americans.\"  Under the proposal, the BLM  would reimburse Indian tribes for  up to 100 percent of the cost of carrying  car-rying out oil and gas inspection and  enforcement activities on Tribal  lands, which are held in trust by the  Federal Government. The proposed  rule would increase the BLM's current  cur-rent level of reimbursement, which  is now 50 percent, and would bring  the BLM's reimbursement level in  line with that of the Minerals  Management Service.  The proposed rule, published in  UBIC 1997 event  announced  UBIC began 81 years ago as the  Uintah Basin Industrial Convention.  For the first 30 years, this event was  held at Ft. Duchesne. It began as a  week of learning the latest  technological advances in fanning  and included nightly entertainment.  It was one event where the Ute  Tribe, Uintah County, and  Duchesne County joined together  for education and fun.  After WWII, UBIC settled in  Roosevelt as a central meeting point  between the two counties. It remained  re-mained a joint education and entertainment  enter-tainment event. In the '60s, UBIC  became a strictly participation  event. Now it's pageants, talent  shows, baby shows, free swimming,  chiklrcns games and crafts, arts and  crafts show, cook oils, golf, archery,  softball, bowling, volleyball tournaments,  tourna-ments, where everyone participates.  The event was always held the first  full week-end in August and provided  pro-vided a parade and three nights of  free entertainment.  In 1991, UBIC changed it's name  to the Uintah Basin in Celebration  to accommodate it's week of celebration.  cele-bration. UBIC, however, remains a  strictly volunteer and donation organization.  or-ganization. This year all entertainment  entertain-ment at Constitution Park remains  free.  This year the UBIC committee  faces the challenge of providing a  quality event without having adequate  ade-quate funding. Expenses for this  event have ranged from $23,000 to  '$40,000. The goal h to raise enough  funds to pay for the 1997 UBIC. To  accomplish this, UBIC committee is  trying a new approach and has ere  ated a sponsorship program. The  committee feels this will give ev  cryone the opportunity of participat  Update. The current rural trend is  for three types of gang members to  be in rural Utah, Campbell said. The  three are transplants from metro  areas, kids who leave the area and  return with gang indoctrination and  local \"want a bes.\"  Rural gangs are more diversified  and as a rule have no set guidelines,  Campbell said.  Local Gang Unit efforts focus on  suppression and education. Officers  serve in the unit during off-duty  hours. Over 5,000 people have  received gang education from the  unit members.  the Federal Register, would also implement  im-plement a provision (Section 8 a)  of the Federal Oil and Gas Royalty  Simplification and Fairness Act of  1996. Through that law, Congress  in effect eliminated cooperative inspection  in-spection agreements on Federal  lands between the BLM and State  governments. However, under a  provision (Section 205) of the  Federal Oil and Gas Royalty  Management Act of 1982, the BLM  would be able to delegate oil and  gas inspection and enforcement actions  ac-tions on Federal lands to State governments.  gov-ernments. The BLM encourages all interested  interest-ed parties to comment on the proposed  pro-posed rule. Comments, which must  be submitted in writing, should be  sent no later than May 9, 1997, to  the following address: Director  (630), Bureau of Land  Management, Administrative  Record, Room 401 LS, 1849 C  Street, N.W., Washington, D. C.  20240.  ing in assuring the continuation of a  quality UBIC.  The levels of sponsorship arc as  follows:  Executive Partner - Front row  seating at evening programs, large  advertising sign on stage, full page  ad in program booklet, on stage appreciation  ap-preciation announcement, newspaper  newspa-per and radio acknowledgement,  tickets and executive scaling at  Queen Pageant, patron acknowledgement  acknowl-edgement in pageant book, executive  execu-tive seating at Mr. UBIC Pageant.  Associate Partner Special seating  seat-ing at evening programs, large advertising  ad-vertising sign on stage, one-half  page ad in program booklet, on  stage appreciation announcement,  newspaper and radio acknowledgement,  acknowledge-ment, four tickets and executive  seating at Queen Pageant, patron  acknowledgement in pageant book,  executive seating at Mr. UBIC  Pageant.  Sponsor Special seating at  evening programs, smalt advertising  sign on stage, one-quarter page ad  in program booklet, newspaper and  radio acknowledgement, two tickets  and sealing at Queen Pageant, patron  pa-tron acknowledgement in pageant  book.  Contributor Queen Pageant tickets  tick-ets (2), patron acknowledgement in  pageant book, program booklet acknowledgement.  ac-knowledgement. Supporter Acknowledgement in  program booklet.  Nowhere in Utah can you find  two counties and a Native  American tribe coming together as  friends with a week-long event.  Tor more information call Carolyn  Krissman at 722-3001.  Sawmill...  Continued from page 1  drugs.\"  Alice Larson, Tridell resident,  said she is concerned with the fire  hazard. \"What will happen if there  is a fire that destroys our property?\"  proper-ty?\" Uintah Fire Marshall John Baker  said the Lapoint Frontier Lumber  site catch fire when the area was  receiving winds up to 60 mph. \"No  amount of water or equipment  could stop a fire in those winds,\"  he said. Baker said that the mill's  owners had access to 3,800 gallons  of water and would install a dry  hydrant system at their own  expense.  \"It is the best solution with what  is available,\" Baker said.  Other residents in the Tridell area  welcomed the sawmill.  \"I encourage any industry that is  a benefit to the community,\" said  Vaughn McKee of Tridell. \"I urge  the county to approve the conditional  condi-tional use permit with the stipulations.\"  stipula-tions.\" The sawmill would employ 12  and two trucking companies would  bring in the wood and cut it.  Simmons said local dairy men  favor the mill because they can  receive free wood chips for cow  bedding. McKee said his dairy  operation is not dependent on the  wood chips.  County attorney JoAnn Strigham  advised the group that they could  appeal the commissioner's decision  in 8th District Court if their appeal  is filed within 30 days.  Flaming Gorge  group elects  new officers  The Flaming Gorge Natural  History Association held its annual  meeting March 27, at which officers  for the upcoming year were elected.  Mark Wilson, President of Red  Canyon Lodge, was elected  Chairman of the Board of Directors,  succeeding Rena Palleson. Richard  Millett, executive director of  Dinosaur Nature Association, was  elected vice-chairman, succeeding  David Whitman. Other members of  the Board of Directors are Fon  Slagowski, Ferl Briggs, and Henry  Chadcy.  Flaming Gorge Natural History  Association works in partnership  with the Forest Service in the  Ashley, Uinta, and Wasatch-Cache  National Forests, as well as with the  Bureau of Land Management in  Vernal and Brown's Park and the  Bureau of Reclamation at the  Flaming Gorge Dam. The  Association, which operates 12  bookstores, is completing a strategic  strate-gic planning process designed to  define its goals for the next 10  years.  \"NO\" is a word we learned  from our valued customers.  You see, wc have really  Ik'cii listening to them.  What wc have heard them  say is \"NO TO ALL IT.KS.'  Because wc were listening, the  \"zero fee\" special pre mint inn has now  become a \"zero fee\" POLICY!! For all new  Land Hank andor PCA loans, there arc no  application fees, no appraisal fees, and no  loan fees. Along with our lower rates and  reduced stock, this No Fees 1'oliiy Itcats the  socks off any cither game in tow n. Visit w ith  one of our loan officers today, and see why  Farm Credit is the only credit you need.  FARM CREDIT SERVICES OF UTAH  h2X (t'nti Phlmtt,nt?trln & slfnl I .m.1 iVml A.,.n,,t i.l,. IH At  At fiin Onfci, Achtiliiitr i, m a I Vjmvii. it nit IIikhvm'  South Jordan (801) 571 -9200 Spanish Fork (801) 798-7JM l,m (HOti m 2l4h  Richfield (801) 896 8407 Trcmonton (801) 257 0179  Evanslon (307) 789 9420 Roosevelt (80I ) 722 4076  Vemal Express  Conference planned  for USU in Roosevelt  Mrs. Jacalyn S. Leavitt, wife of  Governor Michael O. Leavitt, will  speak at the annual Governor's  Regional Family Conference,  \"Expanding your Horizons,\" on  Wednesday, April 23 at the Utah  State University Center in  Roosevelt. Concurrent sessions will  be offered in parenting, gardening,  home improvement, fitness, marriage,  mar-riage, outdoor recreation, family,  Internet, reading readiness, finance,  nutrition, character education, careers,  ca-reers, families and grief and other  topics.  Classes will be presented by Utah  State University Extension  Specialists as well as local educators,  educa-tors, and other individuals from  throughout the state.  Dr. H. Wallace Goddard, with the  Covey Leadership Institute, will be  the keynote speaker. He will speak  on \"Seven Habits of Highly  Effective Families.\"  Before coming to the Covey  Leadership Center, Goddard worked  as an associate professor in Human  Development and Family Studies at  Auburn University in Auburn, Ala.  He gained a national reputation for  parent program development and  training for his work on the  National Extension Parent  Education Model and for his development  devel-opment of Principles of Parenting.  Goddard also has extensive experience  expe-rience with teens. He developed  The Great Self Mystery to help  teens develop their gifts. He also  has conducted research with thou-  Chamber annual  meeting to be April 25  The Vernal Area Chamber of  Commerce will hold its 48th annual  meeting on Friday, April 25 at the  Western Park Convention Center  starting at 6:30 p.m. with a social  hour and dinner at 7 p.m.  The guest speaker will be Gerald  R. Sherratt, President of Southern  Utah University in St. George. An  annual report will be given, new  board members elected and  Businesses of the Year awards  presented. Reservations for the  meeting need to be made by calling  the chamber office at 789-1532, or  contacting members of the Board  of Directors before April 22.  Dr. James Allen, Dr. Rodney  Anderson, Scott Rhees and Miles  Weaver are seeking a second term  on the board of directors. Jo Jo  Gale is seeking a first term , replacing  replac-ing Max Haslem, who is ineligible  to run. Tonah Jackson was recently  \"We're saying  'NO' for all the  right reasons.  Wednesday. April 16, 1997 5  Family  Ml  Dr. Wally Goddard  sands of Alabama teens on their  lives, their challenges, and their decisions.  de-cisions. .  Goddard and his wife, Nancy,  have three children, Emily, Andy,  and Sara. They have also had more  than 20 foster children in their  home during their 25 years of marriage.  mar-riage. Goddard's book, \"The  Frightful and Joyous Journey of  Family Life\" has just been released  by Bookcraft publishing.  John Paul Murphy, State 4-H specialist,  spe-cialist, will be the keynote speaker  for the evening program at Union  High School.  appointed to the board replacing  Mike Merrell.  Other individuals may be nominated  nomi-nated to the Board of Directors by  petition signed by at least 15 chamber  cham-ber members and turned into the  Executive Director on or before  April 24.  Judy Chamblcy is current president  presi-dent of the chamber, with Scott  Rhees as president elect. Other  members of the board are Clark  Allred, Carl Cobbs, Mike Goddard,  Jill Goodman, Dan McCarty, Ron  Perry, Tod Tesar, Miles Weaver and  Rita Wetenkamp.  The Chamber office staff consists  of Greg Hawkins, executive director,  direc-tor, with Lisa Ross and Stacy  Caulson, as secretaries and assistants.  assis-tants. It was announced Tuesday  that Doris Goddard has been hired  by the Chamber as the Convention  Coordinator  Ccdjt tilv il) f.i k5?5 fJN  Delta (80l ) 8l 2JI 4 5d", "parent": 22653316, "version": 1739887660526206979}, {"id": 22653322, "paper": "Vernal Express", "type": "page", "date": "1997-04-16T00:00:00Z", "year": "1997", "month": "April", "day": "16", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/d7/07/d707f1c4a0b433a92e259091c06cf3b44a8fefa4.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/92/1a/921a8aca24860aa8420b3b83945a035c5722dd55.pdf", "page": 6, "ocr": "Vernal Express Wednesday, April 16, 1997  SATURDAY AFTERNOON APRIL 19, 1997  1 1 2:00 12:30 1 1:00 ) 1:30 j 2:00 2:30 3:00 3:30 4:00 I 4:30 5:00 I 5:30  KUTV I Q Sports Show (CC) PGA GoH MCI Classic - Third Round. (Live) (CC) Hmn News RP0\"  KTVX Q Paid Paid PBA Bowling: Tampa Classic Wide Work! ol Sports (Live) FX: The Series News Ihkews  KSL B \"Rea Riding Hood\" Penick s-GoH Gymnastics: mil Championshcs Soni- Krerd- Mad I Hews  KUED O Baking iDes- Sewing IPainlini\" ArtWrk- Chefs iThai ICucina Kitchen Gourmet I Houss Home-  KBYU CD House Hous Woodw-Work- Kerr Cooking Caprial cooking Nova \"Secrets of Lost Empires\" (CC)  KSTU CB ' \"Annie\"(l962 Muscal) Albert Fxiney, AileenQurrn. Star Trek Gen. iPotterqeisl-Les. Outer Limits (CC)  KJZZ CO Paid iPaid Paid Hom iFlipper \"The Gig\" (1965) Wayne Rogers. Step FrshPr  AMC \"Foresf I \"Invasion-Body\" \" \"Sleath-Anzona\" \"Duel m the Sun\"(1946, Western) \"Sato Beware\"  DISC Housesmart! (R) Pop. Mechanics \" Wings (R) Mysteri- Inven- News Nex- Wonder Movie  DISN Lancg\" '; -PrenVswraZlGoofy Isitters Flash Home I Ready Ocean- Inash Charlie Insi-  ESPN (10 00) NFL Draft NFL Draft (Live) NFL Draft (Lyi) Sportsc- Hockey  FAM \"The Las! Ride pi the Pattern Gang\" 979) Larry Wilcox. Big Valley Rifle- Rifle- I High Chaparral  HBO \"rnaana iLifesto- Uttt -Qrrving rVfiss Oaisy\"(1969) PG' Talked to Death Trcey T'srer\"(1996) PG-13  LIFE Our- Our- Uving Hndma- Su- iDebt \"The Substitute Vie\"(1994) \"Silence-ArJuft -  MAX \"Ha- \"Made in America \"(1993) PG-13' \" \"First Knight\" (1995) Sean Connery 'PG-13' \"Llrpan Cowpoy\"  NICK You Do ICraiy Gadget Hey Temple g.U.T.S. lLand- Isen- lAlex- Rugrats All That Kenan-  PSN Baseball Pennant Hockey College Softball InbAAcI Pennanl Volleyball  SHOW \"EightMenOut\" My Life De- \"Spint ot76\" 1990) \"Heck's tVay Home\"(1995) \"My Boyfriend\"  TNT \"Dobermn Gang\" \"The Daring Do6ermans\"(1973) Jon- Bugs Flintstn. Bugs Heal of Night  USA Pacific Blue (CC) \"Docfor Dglroil\" (1963. Comedy) Oea.'n Benefit \"(1996) Peter Horton. \"Risky Business\"  WGN Major League Baseball: Cubs at Mets lOthln- Griffith Hercules-Jrnys. Highlander Baseball  WTBS \"The Green r1grgrs\"Major League Baseball: Atlanta Braves at Colorado Rockies WCW Saturday Night (CC)  SATURDAY EVENING APRIL 19, 1997  I 6:00 6:30 7:00 7:30 8:00 8:30 9:00 9:30 10:00 To:30l1:00 11:30  KUTV I o\" Ent. Tonight Medicine Woman Early Edition (CC) Texas Ranger News Psi Factor Comedy  KTVX Q Fortune j'pardy koisaClark Leaving LA. (CC) Gun \"Ricochet\" News BuziBall Viper \"Turt Wars\"  KSL B NBA NBA Basketball: Knicks at Bulls Cape (In Stereo) News Sports Ojij: \"Cous-  KUED O Deep Space \"Meet Me in St . Louis\" (1944) Austin City Limits Red- Red Thin- Murder  KBYU CD Nature (In Stereo) Lawrence Welk \"The Ghost and Mrs Muir\" Frank Yankovic \"For Love ol )vy\"(196B)  KSTU CD Horn- iSeinfeld Cops Cops (R) America's Most News Icheers Mad TV (In Stereo) Crypl Crypt  KJZZ CD Videos Emp- Tanan: Epic Hercules-Jrnys. xena: Warrior Highlander \"Red Scorpion\"  AMC \"Sailor Beware\" WENN \"Hush... Hush. Sweet Charlotte\" (196S) \"Neath-Arizona\" WENN \"Duel-  DISC Come Fly With Me IDiscover Mag. Titanic-Begins Wild Discovery Take H to the LimitJustice Files (R)  DISN Mickey \"Tall 7ae\"(1995) 'PG' tt \"Tom and Huck' (1995) I \"Man of the House\"(1995) 'PG' \"LasfS-  ESPN Stanley Cup Playoffs: Cont Quarterfina Baseball Sportscenter (CC) I Baseball Auto Racing: NASCAR  FAM Bonanza Bonanza Bloopers-Jokes \"Big Preams & Broken Hearts\" \"The Big Country\"  HBO \"Twister\" \"Indiana Jones and the Last Crusade\" (1989) (CC) 7 \"The Great White Hype\" Comedy Hour Boxing  LIFE \"Silence-Adult.\" t \"Nightmare in the OayligW\" (1992) \"The Stranger Within\" 990) \"Cianges\"(1991)  MAX \"Urban Cowboy\" Tk \"Tommy Boy\" (1995) Chris Farley. t \"The Silencers\" (199) R' Double t1i \"Broken Arrow\"  NICK Kids' Choice Awards (Live) Beavers Lucy Lucy and Pesi HappyPTaxi Ivan- Newhart Newhart  PSN Volley- Beach ln Their Prime: Hauoen vs. Whitaker Boxing: Fight Time I FOX Sports News  SHOW \"MyBoy\" \"Super Mario Bros.\" (1993) PG' My Life Outer Limits (CC) Boxing: Hopkins vs Jackson.  TNT Heat of Night v, \"The Road Warrior\" (19bi) 'h \"Death Ring\" (1992) Mike Norris. \"Suniving-Game\"  USA \"fiislry Business\" \"Cocktail\" (1988) Tom Cruise. Trilogy of Terror II\" (1996, Horror) (CC) \"rtofin Ttits Town\"  WGN Major League Baseball News (In Stereo) INight Ct.'; \"Helltighters\" (96S) John Wayne. Paid  WTBS \"2 \"Hang 'Em High\" (1968) Clint Eastwood. V; \"Cahill.US. Marshal\" (1973) \"lasf Train From Gun Hill\"  r  VERNAL  m w w  77?  SAVE  A OPE  if you see an  impaired driver  CaDD  9HU  on any  Cellular  phone  Thanks for  Your Help!  Coalition for Safer Highways  More of Your  Favorite Movies  for less $  over 14,000 to choose from  New Video Movies  Just In  101 DALMATIONS G  ASSOCIATE PG-13  DOWNDRAFT R  EMMA PG  GHOST AND THE DARKNESS R  MIAMI HUSTLE R  SECRETS & LIES R  i SEXUAL ROULETTE R  EXTREME MEASURES R  GANG IN BLUE R  ; LONE STAR R  Video  Movieland  135 West Main Vernal  Call to Reserve a Movie  789-7711  Vernal Theater  Now Showing  Opens 7:00 Starts 7:30 Only  ANACONDA  JENNIFER LOPEZ EElO  Tri Cinema  Theatre  CvL e 4-11 Seniors $3.00  12 & Over $5.00  7:00, 7:15 & 7:30  Start. Friday  7;00&9:10  A  Thai Old  reeling  Startt Friday  7:30 & 9,30  -SAINT  VAL KILMER E3  Now Showing  7:15 & 9 00  LIAR LIAR  JIM CARREY  SATURDAY BARGAIN MATINEE  OPENS 4 00: PRICES: 4 11 &  Senior 12. 12 over S3  r'-t . . 30. 7 00. 9 10  $vi ,......... 5. 7 30. 9 30  i 1st , $ 00. 7 15. 9 00  WEEKDAY MORNING  I 6:00 1 6:30 I 7:00 1 7:30 I 8:00 8:30 I 9:00 1 9:30 1 1 0:00 1 1 0:30 1 1 1 :00 1 11 :30  KUTV Q News News This Morning Price Is Right Young-Restless As World Turns  KTVX Q News Con: d Good Morning America Regis & Kathie Monte I Williams UtahLiv-1 Daytime  KSL Q News Today M'A'S'H IM'A'S'H Crook & Chase Leeza  KUED Q Busi- Busi- Sesame Street Barney Mr Reading Varied Exptor- Instruc- Music jParent-  KBYU ffl BYU Aero- Story- jStation Sesame Street Mr Play Barney Puzzle BYU Devotional  KSTU ffi Pino- Extra News After Breakfast Lucy Lucy Dating Newly- Rosie O'Donnell  KJZZ O Knights Rider Samurai Mask Garfield Darkw- Paid Paid Jenny Jones Jeannie Bewitch\"  AMC Movie Varied Programs Movie Varied Programs  DISC Paid Paid Paid Paid Paid Paid Paid Paid Assignment Home Matters  DISN Movie Varied Mickey TaleSpin Donald GoofTrp Chip- Mermaid Pooh Mickey Wondr- (PoohCr-  ESPN Sporlscenter Sportscenter Sportscenter Sportscenter Sportscenter Varied Programs  FAM Paid Paid FIT TV Father Dowling Waltons 700 Club  HBO Movie Varied Programs Movie Varied Programs Movie Varied Programs  LIFE Paid Paid Paid Paid Workout Workout Baby jKids- Sisters HndrniT Gourmet  MAX Movie Varied Movie Varied Movie Varied Movie Varied  NICK Looney Tunes Rugrats Busy- Rupert Muppets Allegra Gullah Ltl Bear Blues- Busy- Beaver  PSN Varied Programs FOX Sports News FOX Sports News FOX Sports News Paid Paid Paid Paid  SHOW Movie Movie Varied Programs Movie  TNT Scooby Poo , Flintstn. Flintstn. Gilligan Gilligan Spenser: For Hire CHiPs Thndr-Paradise  USA Bloom- Bloom- Bloom- Bloom- Mario Sharks Max Sonic Murder Wrote Wings Wings  WGN Bugs- Animan- Woody Bewitch Griffith Emp- Heat of Night Geraldo Rivera News Varied  WTBS Brady Bewitch Little House 3's Co. Mama Griffith Griffith Matlock Movie  WEEKDAY AFTERNOON  1 12:00 1 12:30 1 1:00 1:30 I 2:00 I 2:30 I 3:00 I 3:30 I 4:00 4:30 I 5:00 I 5:30  KUTV Q News Guiding Light Bold Judge Real TV HardCpy Maury News News  KTVX Q All My Children One Life to Live General Hospital Ricki Lake Oprah Winfrey News News  KSL 0 News Another World Days of Our Lives Medicine Woman Mad Access News News  KUED Q Eyplor- Explor- Instruc- Varied Programs Wild- San- Arthur Crea-, Wish- Bill Nye Busi-KBYU  Busi-KBYU Q) Varied Sesame Street Arthur Barney Wish- Bus Reading San- News Crea- Bill Nye  KSTU CB News Extra Bios- Bananas Spider Batman Bobby Spider Beetle- Rangers Horn- Simp-  KJZZ CD Heat of Night Matlock Sally B ru- Gar- Aladdin Quack Step FreshPr  AMC Movie Varied Programs Movie Varied Programs Movie Varied Programs Movie  DISC Housesmart! Start Interior Home Matters Housesmart! Interior Start Chefs Chefs  DISN Gum- Bears My Little Mermaid Duck- Charlie Pooh Donald Movie Varied Programs Charlie  ESPN Varied Programs UpClose Sportscenter Hockey  FAM 700ClubFITTV Rescue 911 Home & Family Shop- Shop- Takes- Bloop-  HBO Movie Varied Programs Movie Varied Programs -  LIFE Our- Our- Living ingredi- Su'-\"\" Debt Movie Commish  MAX Movie Varied Programs  NICK Looney Beetlejc. Tiny- Muppets Chip- Gadget Afraid? Rocko Clarissa Tiny- Doug Rugrats  PSN Paid Paid Varied Programs  SHOW Movie Varied Programs Movie Varied Programs Movie Movie Varied  TNT West Was Won Wild, Wild West \" Movie Heat of Night Heat of Night  USA Movie USALiveUSALiveUSALiveUSALive USALive lUSALive MacGyver  WGN Varied Programs Beauty & Beast Beverly Varied Family Dreams Saved- Saved- Family Bzzz!  WTBS Movie Cont'd Jon- Flintstn. Flintstn. Dreams Saved- Saved- Family Family Videos Videos  WEDNESDAY EVENING APRIL 16, 1997  I 6:00 6:30 I 7:00 I 7:30 I 8:00 8:30 9:00 9:30 1 10:00 1 10:30 1 11 :00 1 11 :30  KUTV B News Enter- Nanny Nanny CBS Reports: Enter Ihe Jury Room News Late Show (CC) LateLate  KTVX Q Fortune J'pardy Grace Coach Carey Carey Primetime Live News Night- Edition Journal  KSL Q News News News- Single- Wings Men- Law & Order (CC) News Tonight Show Mad  KUED O News-Lehrer New Explorers Fight in the Fields: Cesar Chavez 'Alio Summer Briltas \"Post-  KBYU g) Little House News-Lehrer Dick Francis Mysteries \"In the Frame\" Travels Firing- Embroid Nature  KSTU (B Horn- Seinfeld Beverly Hills Pacific Palisades News Deep Space 9 Coach Cheers  KJZZ fD Videos Rose- Sentinel (Rj (CC) Trek; Voyager Babylon 5 (R) (CC) Baywatch (CC) \"Perry Mason\"  AMC \"Le- wENN \"The Bone\"(ia53) Richard Burton k \"House on Haunted Hill\" The lemon Drop Kid\" (1951)  DISC Travelers (R) Movie Nex- Wings (Ri Wild Discovery Discover Mag. King Charles I  DISN TaleSpin Duck- chip- GoofTrp ', \"Nightiohn\" (199B) (CC) \"The 'Girl Who Spelled freedom\" (1986) \"rViu-  ESPN Major League Baseball Teams to Be Announced Baseball Sportscenter (CC) Baseball X-Games Trials Strong-  FAM Carson Carson cT C, Waltons Highway Hvn, Rescue 911 (CC) 700 Club  HBO Lifestories \"Batman Forever\" (1995) PG-13' '-r \"Money Tram\"(1995. Suspense) 'R' Tracey Sanders  LIFE Golden Golden Su- Debt Intimate Portrait Unsolved Myst, \"Under the Piano\" (1996. Drama)  MAX \"Amazing Panda Advntr\" , \"Empire Records\" :99b) \"Children ol the Com III\" I 'The Grave\" (1 996) 'R' (CC)  NICK Arnold Happy DLucy Bewitch Newhart Odd Taxi Mary Van- Newhart Rhoda jjeannie  PSN Major League Baseball Major League Baseball Seattle Manners at Detroit Tigers. FOX Sports News  SHOW \"Eight Men Out\" \"The Tmlight ol the Golds\" (.1997) tt \"Flatliners \"(1990. Suspense) 'R' poltor, \"Lap\"  TNT \"Pavd'(1997) Leonard Nimoy \"David\" (1997) Leonard Nimoy. tt'i \"Logan s Run\" (1976)  USA Wings Wings (Renegade CC) Highlander Murder Wrote \"rVofm This 7own\"1997) Kathy Baker.  WGN Hercules-Jrnys. Xena: Warrior Night Ct. News Sister Smart- Jamie F. Wayans Simon a\" Simon  WTBS NBA Basketball Chir,nn Pu'ls a' Mmh Hfal NBA '; \"R?frh\"(1965) CrwvyChase \"Ballad ol Cable\"  THURSDAY EVENING APRIL 17, 1997  I 6:00 I 6:30 I 7:00 1 7:30 1 8:00 1 8:30 9:00 9-30 10:00 To:30ll1:00 11:30  KUTV q\" News Enter- Diagnosis Murder Moloney (CC) 46 Houri (CC) News Late Show (CC) LateLate  KTVX Q Fortune J'pardy High Incident (CC) Deadliest Vole. Turning Point News Night- Edition Journal  KSL O News News Friends Sud- Seinfeld lFired up eR lln Stereo) (CC) News Tonight Show Mad  JUEDja News-Lehrer Cousteau Mystery! Cadlael (H) (CC) School Alio Summer Briltas Front-  KBYU 0 Little House News-Lehrer Nova \"Seciels ol Lost Empires' ICC) Travels Euro- Ances- NellGeo  \"KSTU-\"gj\" Horn- jSeinleld Martin Single NVUndercover News Deep Space 9 Coach Cheers  KJZZ CD Videos Rose- Two llti iln jiinteo) \"M Bultertly\" (l'J')J) Jeremy lions Baywatch (CC) ' Mountain Moon\"  AMC\" Pale- The Seven Yea. lh-h' (t'5M \"S.iyon.v3\"'(1957. Drama) Marlon Brando 'The Paleface\"  \"DISC Travelers R) Movie Nex- Wings (H) WMd Discovery Mysleti-Movi ShipwrckMysl,  piSN TaleSpin I Duck- chTp- iGoofTrp littie House on the Prairie\" Ok) Yei'er \"(1957) G I Planet ol Avs\"  ESPN Stanley Cup Playoffs: Cool Ouanpdmal Stanley Cup Playoffs: Cent Quarterfinal ISportsc-  FAM Carson Caraon C. C. Wallona iHighwayHvn, Rescue 911 (CX) 700Club  HBO 15 00) \"'wis'er\" Twk Generations \"(1994) The ti-oFal!\"199J R (CC) 'r A'.r.nyr\"i:i95 H' (CC)  LIFE Golden Golden Su- Debt lnlimle Portml Unsolved Mysl. I Wwn Innocenct Is Lot! \"(1997) (CC)  MAX Hustlers M(isrv ' (I'.IHM the Joumiy o! August ng . \"yiMn. Pays' (1 VH) Ralph P lonnes R' 1 JSf-  NICK Alex- Hppy o'llucy BewilcinNewhartTodd Tail Mary Van- Newhart Rhode jnm  SN B1??!\"!! NBA Basketball Wj'\"ois at J.i;; Isporls somcs NBAAct FQX Sports News  SHOW- \"b.iiw P.'r \" \"LA y.MrylKi'll) S'fve Martm \"The Usual SuiPin-ts (I9'i5) 1 ,ni Mnwr\"(i;i'iii H'  \"TNT lheHvet' (ViM4 Duma) Vrirnhson 'i \"rN Any iV'(19:'.) MutTrt lie Nno e \"Hack m Actum\"  \"USA- Wings wTngs jRenegflde iCC) Highlander iMurdot Wrote \"frn Mrn '(I'm?. Comorly Puma)  WGN Maior League Baseball U'i. i. at W' ti. jinx Nws iHrnoon- HI of Nighl Simon t Simon  WTBS .. cy r., ii r-.. yii'yi C. c rr -f vi' I rv-a' s-. ' n n fv wiidyi ft-'-r  FRIDAY EVENING  APRIL 18, 1997  KUTV  kfvx  KSL  KUED  KUVlT  KSt'iT  KJZZ  AMCT  DISC  t)ISN  espnJ  FAM  Hno\"  lit e\"  max\"  nick\"  \"'SN  SHOW  TNT  W(iN\"  wtns  1  o  ii  u  0)  Q)  6:00 6:30  FntM  fjpidyj  pw  7:00 7:30  JAG Ls-vmii  I amily Uoy  WaHWtt;Wail St  Nvws  t oMunf  Newi  Mom' l,tn!fjfl  Video TMo-  Tulef-mnlOHih  Whdt FtigndT innung T jet  C.otrten (,ninn Kw lM  - -  Haywal.h HA.)  1t-e Ct\"n  Chp Gmtt(  8:00 I 8:30 I 9:00 I 9:30 110:00  Cold Cm 1 1 )  Sbin siep ?(K?0lC t.)  tlalolme i( Ci  Civic Viion.  All Creatures  Millennium rt t'j  Naxh Bti1ys M  Hamtcide Life  Liberty t Limns Alio  Mylry! I' v  ' I1lL\" \"J i''  I (me  10:30 11:00 11:30  late Show k.Ci Hatetate  Nws Night, lidilion Journal  looijhl Show Una  SummetlTo Be Announced  Travels Smith Bust. InoH  Dfieji Spurt 9 Coach Cheers  llaywanh il.Q  A\" A'\"rdn 1tI  W.ng  p ,',;''  L i  W-ncji  Wild Dutowy Umm  3 f\"lft1? ' fill9'''\"'a  pTah lnmi Tw.f lnt1 a  taVt mwt v\"  Mtc4hf 9M 'i.C.t lPOClub  T F ' hi tort fvt' (VJ'J! sXeila) Va'I'rt  'Mw hart Odd  NIMA't 1'gr.nanl jf.pofH iMMirtri  A, 4 I AP IP J) 1  a Mf.A trott jy1  V'1(, tvirlantj !Min I erji.l  Inait  rem, (IJJ.  W'B  'j'j\"-- ( IMkH  Mtt  () 5pw' Nw  SATURDAY MORNING  6:30 7:00  KUTV  KTVX  un  VIJ  ustu  AMC  ruse  I 6:00  til\"\"1\"  APRIL 19, 1997  a n.a I11.4  IL.ii.iw-0..h  fAfvTT ii-4 irH ;'4  1 TnnT Id..  7:30 8:00 8:30j  ' t- i' iPwM tt\"gt tB\"gM  iOrf ltrft.lt, Mn. iMrwHftu  f. vPi;',P'H ;P  VgMjfh,. !-r  MPA If l MTlt  LIFI  MAI  Mir i  ftSM I '  r.f .(-ft-if  9:00  9:30  1000  W-  10:30  Sjlnt  11:00 11:30  riK.s 'Mo--  tlh.telAn. .11 Art. D at Jafca BrmuM ttow f AtttWMaM  x gr ir- iwy ief ppi\" , ...  wmi w?w lw j, W'H wn tP\"cp Cqyy tvyy '3-  SUNDAY MORNING APRIL 20, 1997  I 6:00 1 6:30 I 7:00 7:30 I 8:00 8:30 9:00 I 9:30 1 1 0:00 1 1 0:30 1 1 1 :00 1 1 1 :30  KUTV Paid Faith Hour of Power Sunday Morning (CC) Nation Paid Paid Paid Haven  KTVX O Good Morning Ghost- PE-TV paid Paid I Paid Utah This Week (CC) Old Garden  KSL Q (5:00) Easter Seal Network Celebration Easter Seal Music Easier Seal Network Celebration  KUED Q Journal Smith ICrea- Barney Barney Bus Puzzle Couch Matinee at the Bijou inslruc-  KBYU CD BYU Devotional Puzzle Station Mr Sesame Street I Barney General Conference  KSTU CB Beas- Richie All Dogs VOR- Reboot GUoe Fox News Sunday Griffith Griffith Lucy Lucy  KJZZ CD Babies oi. Twist loragon EagleR- jumanji Mouse Hulk B.A.D. Senior PGA Golf: PGA Sr. Champ.  AMC (5:30) \"The Egg and \"(1947) \"Blondie Takes a Vacation\" \"Adventures of Tom Sawyer\" Holly- \"Broken Arrow\"  DISC Paid Paid I Paid Paid Paid Paid Paid Paid Zoov- Bone- Movie ForReal  DISN \"Land Betore2\" Mickey TaleSpin Donald GoofTrp Chip- AmazinglAnimals Animal \" \"The flescuers\"'G'  ESPN ESP- NBA Sportw- Report- Sportscenter NFL Draft (Live) Auto Racing (Live)  FAM Paid Paid B.Hinn Zola Ben H. Ken- In Touch (CC) Animal Animal New-Challenge  HBO \"Twister\" (1996) Helen Hunt. (CC) Sonny Lislon Testa- Hero \"The Brady Bunch Movie\" \"DaysT-  LIFE Paid Paid Paid Paid Paid Paid Paid Paid paid Paid Baby Kids-  MAX \"Ctocfc- 'VegashSpace\"(1991) \"Bad News Bears Break Tr\" Vi \"Lionheart\" (19B7) Eric Sloltz. 'PG' \"gushw-  NICK Muppets Tiny- Looney Tunes Rugrats Beavers Arnold Mon- Pete- AII That My Bro. Space-  PSN Paid Paid FOX Sports News FOX Sports News Paid Paid Transworld Sport Pro Beach Soccer  SHOW \"Candy- Seriously '94 \"Daisies in December\" (1995) \"Indian Summer\" (1993) 'PG-13' My Life De-  TNT Taz- Scooby Poo Gilligan iHeal of Night Heal of Night \"Paternity\" (1981) Burt Reynolds.  USA Reel- Paid CNet Johnny Max Dragon Action- Ultrafrc. Fighter MortalK Pragon WingCo-  WGN Faces of Easter Seals (In Slereo) Easter Seal Network Celebration (In Stereo) Lead-Off Baseball  WTBS Jetsons Flintstn. Flintstn. Saved Family \"Overboard\" (1987. Comedy) Goldie Hawn. \"Hudson Hawk\"  SUNDAY AFTERNOON APRIL 20, 1997  1 12:00 12:30 1 1:00 1:30 2:00 2:30 3:00 3:30 4:00 I 4:30 I 5:00 5:30  KUTV Q Sports Show (CC) PGA Goll: MCI Classic Final Round. (I ve) (CC) Extre- hews News (CC)  KTVX Q Paid Soccer: Mexico at United States Passion to Play Viper \"Turl Wars\" News News  KSL Q Easier Seal Easter Seal Network Celebration Easier Seal Busi- News  KUED Q Busi- Ances- Antiques Rdsho Mystery! \"Cadlael\" (R) (CC) Burning Cousteau Nature (In Stereo)  KBYU CD LawrenceWelk \"The Ghost and Mrs. rVfuir\"(1947) \"Oym- Fomily Sperry Sympos. Music Center  KSTU CB Stanley Cup Playoffs: Con! Quarterfinal Skiing (In Stereo) Star Trek Gen. Deep Space 9  KJZZ CD Senior PGA Golf NBA NBA Basketball Xena: Warrior Out- iHome-  AMC \"BrknArr- \"The Spoilers\" (1942) Til Be Seeing You\" (9U) \"Von Ryan's Express\" (1965) Altrac-  DISC Jaws Pop-Sci Mysteri- News 20lh Century Shipwrck-Myst. King Charles I 20th Century  DISN \"Res- \"3 Lives of Thomasma\" Sitters Flash Home Roady Ocean- Flash Charlie Insi-  ESPN Auto Racing: NASCAR -- Goody's 500 naS- Superbouts (R) Horse Racing Sportsc- Baseball  FAM \"National Lampoon's Vacation\" ( 1983) tt \"Rio Sravo\"(1959. Western) John Wayne. Dean Martin. \"Papi(ton\"(1973)  HBO (11.30) \"Days of Thunder\" \"Head Above Water\" (1996) t\"i \"The Hunt lor Red October\" (1990) 'PG' \"Borrv  LIFE Commish \"V V.\" \"Armed and Innocent\" (1994) \"Empty Cradle\" (1993. Drama) \"Locked Up-Rge  MAX \"gushwhacked\" \"Pal Joey\" ( 1957) Frank Sinatra. \"Fandango\" (1985) 'PG' \"Amazing Panda Advntr\"  NICK You Do Crazy Gadget Salute Temple G.U.T.S. Land- Space- Kids' Choice Awards (R) MyBro  PSN Fishing Outdoor Tennis Nuveen Masters Final. (R) College Football: Wash. St. Scrimmage Motorcycles  SHOW \"L A Story\" (1991) \"La Bamba\" (1987) PG-13' (CC) I \"The Twilight ol the Golds\" \"Pom, t Eugene\"  TNT \"rheEnd\"(1978)BurtReynolds. \"Airpane.'\"(1980) Robert Hays. \"Airplane II. The Sequel\" (1982)  USA WWF Superstars 'r \"The Fly H\"(1989) Eric Stollz. \"Halloween H\"(1981. Horror) \"Trilogy of Terror II\"  WGN Major League Baseball: Cubs at Mets llOthln- Griffith Xena: Warrior Adv. ol Sinbad Broth- Nick-  WTBS \"Hudson Hawk\" Major League Baseball Atlanta Braves at Colorado Rockies Videos jVideos National Geo.  SUNDAY EVENING APRIL 20, 1 997  I 6:00 6:30 7:00 7:30 8:00 8:30 9:00 9:30 1 0:00 1 1 0:30 1 1 1 :00 1 11 :30  KUTV Q 60 Minutes (CC) Touched-Angel \"Rose Hill\" (1997) Jenniler Garner. (CC) News Sports Take 2 News  KTVX O Videos TBA Primetime Live \"Tango t Cash \"(1989. Drama) (CC) News Edition TVCOM Paid  KSL B Dateline (CC) 3rdRock Boston \"On the Edge ol Innocence\" (1997) (CC) Utm Sports Sports Murad  KUED O Nova (In Stereo) Nature (In Stereo) IMaslerpiece Theatre \"Rebecca\" (CC) Vicar Mul- Chill Igtoup  KBYU CD BarneyLivel t \"Lt Room Crusoe. U S N \" (1966) American Experience Classical Music (In Stereo)  KSTU CP Animal Rescues Simp- King-Hill X-Files (In Stereo) Nws Sports Deep Space 9 I Outer Limits (CC)  KJZZ CP Sports UtahJai-NBA Basketball Utah Jazz at Sactamenlo Kings!\" Jazz Crimi- Trek: Voyager iBabylon  AMC \"Dear Brinitw\" (1365) l \"Pete Kelly's glus\"(1955 Drama) U 'VonByan's(iprss\"(1965) Altrac-  DISC Shipwreck Lus. iTilanic: Anatomy of a Disaster (R) Wild Discovery Jerusalem - City of Heaven Terra X  DISN Dragon \"Th Brave Litm Toaster\" \"Jams and the Giant Peach\" \"The Rescuers\" (1977) \"Great Outdoors\"  SPN Maior League Baseball: Cardinals at Padres ISporlscenter (CC) Baseball Baseball Aerobics Ch.  f AM 15 00) \"Pap.iton\"(i973) I 'Loir Treasure of Dos Santos\" (1997) \"HorsSoiawrs\"i959)  HBO \"Bom to Run\" (CC) Brady Bunch Movie\" lHappily Comedy Hour \"In ffie Gioamma\" \"Heart-Water\"  LIPE \"Locked Up-Rge\" \"The Hau ilmg ol Lisa\" (19) (CC) \"Kaleidoscope\" (1990) Jaclyn Smith intimit. Portra  J? \"fyr0anAnari1!r!l4) L adyhiigs\" (W!) PG-13\" \"Hardliod\"(l9B4) \"R\" , \"Sprmg Brea\"(198  NJC K Wub- Nick- I Happy 0 Muns- Odd I Van- Newhart Newhart Tal Rhode IPhyllis Belty  PSN Track and Field Pipn Invitational College Baseball Qreijon State it Washington FOX Sports News  SJIOW (iom t Eugene\" ... \"tnlan Summ-(1!W3) \"PG13\" Tin Presence\" l\"rhScarWLerfer\"(1995) 'R  T.NJ n'l \"Prnl.rW(1'lH7. Soence Fiction) \"Surviving the fi,im\"\"(1994) IceT ' \"Predator\" (1987. Science Fiction)  JJSA \"Tnijy ol Tertoi II n.if to the Future Part it\" 19m) Pacific Blue (CC) Is.lk Stalkings (H) Big Easy (R) (CC)  WGN Parent Hsrv Unhap- LleWo- News Reptay Riches Adv. of sinbed Hercules Jrnys. Ixena  WTBS I National Geo Coming Plague Pan I Netlonal Geographic Explorer (HI CPPaid Paid  MONDAY EVENING  Newt  Mad Ibwd-  6:00  KUTV I n News  KTVXl tl  KSL 1 fj) V  KucrJjuI  KBYUJCPll'I'llMouM  KSTU I CD Horn.  Kjzz3oq  AMC I T V  DISCF travelers  OISN VeleSpn  ESPN UnCtow.  FAM K.ar.oo  MHO in Km I rm  llFE  max\"  NICK  PSN NBA Weyorl  SHOW I W. tj  TNT  URA  WttNTZi  WTim ) '  6:30 7:00 7:30  Cyfa.ll Inh trcrTchttago Hopt Umm lai Show (CC) lUuLnle  Melto flc  Hqi. .nHouV Mate Pirn  rjMam ftv Set  APRIL 21,1997  00 I 8:30 9:00l 9:30 1 0:00 1 0:30 1 1 :00 1 1 :30  Ati'y Wi(i.rfKMlnOav:Hwt iN.Qh,. EdHtoo iJoufnaT  Sanittld OfOtint  Am ttpthtnet  imit Hovjh  CrvtHrinjOtilh  ShMPatovtf  Gotng Placti (C Q  Haywalch N.ghn Baywalch  Nwt iTonigtn Show Mad  Suwrnw BiiMM lThttr  \" \"AM fi -w \" ( Anthony Qmn Ky ftrttntp Rkx \" ( tW)  i Ptcovy  Itfe  Hmmtorxont tl ta 7) tCt  iNeoml JuiM  jarysjteat) rXi 'J \"  e e \"V-it.\" i Civvinn  T tWhjl  MH1S Mariners!  ifMl'  Intimate Pnrtrait Unsolved Uyt  loer.) Ici\"  Newhart OiW  Spertsceniei (t CI  li jhwey Hvn  Ultimate Guide If sc. Atcetrai  e e t Vwvi Oumlw Ory ( i ms)  ReftebafllMersthon  Rescue 111 (CX)  700 Club  Running  e Xhamr-toort\"  pi W.tnan ) Cn'a\"(1tW4)  MrrMr MiLa ii ir r I  wingeJw.njnne9ete  Majm league Behall ya- .t?,  3  Major ieagwe fJaaebaH H.a; a' Ma-rw.s  iV' (i4  frKfi ANr Cat ay fXy\" 1  nt.n Hood  M\"eleMet  nhode  OJ Sports Newi  WtWrlfOiliyrCJ  WorU Wreeflmg ITeaeretien Hew  News m i Hmoon. ?Meef ol NighT  La rime Niklta  Simon t Simon  TUESDAY EVENING  6:00  O It\"  O lel  ,liie Mrmee  APRIL 22,1997  7:00 7:30 8:00 8:30 9:00 9:30 10:00 10:30 11:00 11:30  J pare'lTl''\"'- jiwniaan Twem.ji  Arfe e Sle  \"I lr lt  t.etne  ttmnUUm) (( X  Nature J-roM  Cr-ftmtnr  -tf'J  NTPB Bhrer  biein ic ci  2-  NetinaOe  girW\"g tm j\"l  \"fle! rf lVr y .- f lJ  Wae I\" Iwe tytmymtf  Yes.owe  mj tvtf rteraWe tM t r .  jwjeitene  r) ay Weft.  AH,  lent  tBerni (CCJ..  as y tyn.  Qrf Wyj C'yyy'tF  e \" r wf 'fm  (Cf.l  lcee  Vmr art 1 W\" ryryye l; lc toarj (CCI.  W rf timm' I'W.  V.?-irl r p. . ., -5 r'  \"Myty ft g ryrwr poolfre-l m trw'g VHkynf taagj  \"sjy lr-eej Bsiet-i\" C - r Erpc-s  l\"irfWrwll.  Be  rwrMirviN  ,n.-mirm a", "parent": 22653316, "version": 1739891676687630339}, {"id": 22653323, "paper": "Vernal Express", "type": "page", "date": "1997-04-16T00:00:00Z", "year": "1997", "month": "April", "day": "16", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/0b/64/0b645c6e6e180ff9c012878dcb84c743ed0523e0.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/f7/00/f7001201887865d6ba225015ec4ea5e444206412.pdf", "page": 7, "ocr": "Advisory council  Vernal Express Wednesday. April 15.  A legislative update on bills concerning  con-cerning wildlife, an overview of the  importance of private lands to  wildlife, a preview of antlerless elk  permit options and a review of the  recent drawing process for Bucks  and Bulls were the topics presented  to the Northeastern Regional  Wildlife Advisory Council  (NRWAC) on April 7 in Vernal.  Information was also made available  avail-able on the Habitat Authorization  and three draft regional habitat  management plans (phase 1 plans).  The members of the NRWAC are  selected locally to represent a broad  range of interests throughout the  Uintah, Daggett and Duchesne  county area. The 13 member council  coun-cil includes: three members from  agriculture, two sportsmen, one  from the US Forest Service, one  from the Ute Tribe, one from  Bureau of Land Management, one  businessman, one elected county  government official, one environmental  environ-mental interests and two from the  communities at large.  Their role is to work with people  of the Uintah Basin and the Utah  Division of Wildlife Resources  (UDWR) to put together recommendations  recom-mendations to the Wildlife Board  for the management of wildlife in  Utah.  Among the recent bills that  passed by the State Legislature  were bills to allow elk farming in  Utah, to add a .25 cent surcharge to  the Habitat Authorization to pay  county search and rescue efforts,  and to change the State fish to the  Bonneville cutthroat.  Other legislative actions included  funding changes such as: discontinuing  discontin-uing the $1.6 million given to the  UDWR to offset the loss of revenue  from capping deer hunter numbers,  having the UDWR pay the State  Institutional Trust Lands  Administration (SITLA) $200,000  to allow the general public  (hunters, anglers, campers, wildlife  watchers, hikers, mountain bikers,  4-wheelers) access to School Trust  Lands and to have the UDWR pay  the matched funds to the Central  Utah Project to renovate the Kamas  and Fountain Green fish hatcheries.  Information was presented on the  importance of private lands to  111  t  j, ; -  . S(MBmmM)-'i 'i i M-w$tM- wife-'-' -  Fh f.y ' l1'\"' '\"' M-H'l,f 'tpiy hii't rf xeiih the s,imt knnvltJrabU proffui,m,il r..n '  Jl A ASViMr'ibV 'At 'f fk'i'C' problem, until o l:i;r ,t piMm, .It Unttm lime. And vt offer the full tupport of am ni .r  \"sllVt VvvA'RT'wi 1 VlJ KI p Lampciiuitititi -, iiah, ue'ie hull the t,irst. maiugtrt, vohim! rrM spttMlhtt, kyl '  YStj) ,\"\"' w\"'\"'',erwrr rv.r7r (CQBJJfc Q Q't m,t infirm,,!,.,,,. r,.;-r I'  JT \"J 'H,,t \"'\"\"t'\"f! I vben it we to hn.li,,, '  '.ifpj hittr mift qnulicr npniit lime, nj ftztr rrfiW, the tihrrgnyf tfr' rir r, f  bttnlrt for )oit iul nn eniplnyta, We tin 4 ihimt t  Workers Compensation Fund j  I ipefialift fpfeifiiatly to niif biiiinrff, to oh botk OF UTAH f  i  wildlife. Of the roughly 54 million  acres of land in Utah about 51 percent  per-cent is elk andor deer habitat.  Roughly 59 percent of the elk and  deer habitat is publicly owned with  public access. Another 24 percent  is privately owned and the rest is a  combination of restricted public access  ac-cess areas including military bases,  Indian reservations, State and  National parks, etc. Most of the privately  pri-vately owned lands are in the  Northern Region, about 69 percent.  The Uintah Basin has about 20  percent private lands plus a large  reservation. Given the importance  of private lands to wildlife, the UDWR  UD-WR is working with landowners  and sportsmen to draft a landowner  general season permit bill which  should be presented to the NRWAC  this summer.  The UDWR reported on the recent  re-cent big game drawings for bucks  and bulls. Applicants were up this  year to just over 48,000. The rejection  rejec-tion numbers dropped to about 3  percent compared to a 10 percent  rate last year.  Most of the rejections were for  not including enough money, not  including proof of hunter education,  educa-tion, not signing the application and  for applying for too many species  or permits including submitting  multiple permit applications.  Due to an expected increase in  antlerless elk permits, the UDWR  presented the concept of obtaining  a second elk permit and several alternatives  al-ternatives for distributing the second  sec-ond permit to hunters. This item  was a preview and will be considered  consid-ered at the next NRWAC meeting  on May 7.  The annual report for the Habitat  Authorization, three draft Phase 1  Habitat Management Plans and a  copy of the UDWR Black-Footed  Ferret Recovery Plan were presented  present-ed to NRWAC members. Copies of  these reports are available for the  public to review at the UDWR  Northeastern Regional office. The  black-footed ferret management  plan is tentatively scheduled for 'the  June 2 meeting.  The May 7 and June 2 NRWAC  meetings are scheduled for 7 p.m.  at the USU Extension Building,  1680 West Highway 40 in Vernal.  Farm activities  reported  Spring grain planting and tilling,  prunning and spraying fruit, shearing  shear-ing sheep, lambing, and calving  were the major farm and ranch activities  ac-tivities for the week ending April 6,  1997, according to the Utah  Agricultural Statistics Service.  Spring grain seedings were spring  wheat 44 percent complete, barley  45 percent complete, and oats 15  percent complete. These crops  were normal for this time of the  season. Apricots were 92 percent  full bloom or past. Cows calving  was half complete, while lambing  on the farm was 45 percent complete  com-plete and lambing on the range was  only 10 percent complete. Calving  and lambing were running between  12 to 21 percentage points below  average. Sheep shearing on the  farm was 35 percent complete, 17  percentage points below average.  Sheep shearing on the range was  only 5 percent complete, which was  29 percentage points below average.  aver-age. Both fall barley and winter  wheat were mostly undamaged or  lightly damaged due to freeze this  past winter. As a result, the fall barley  bar-ley condition and winter wheat condition  con-dition were fair to excellent  throughout the state. Subsoil and  topsoil moisture was 90 percent  plus adequate to surplus. Twenty-eight  Twenty-eight percent of pasture and range-land  range-land was rated poor or very poor,  24 percent fair, and 48 percent good  to excellent. There were over 4  days suitable for field work last  week.  Revenue...  Continued from page 1  requests.  Board members must also factor  in the need to pay a State-mandated  pension contribution increase, provide  pro-vide cost of living increases and  pay higher overall salaries to an  experienced work force.  \"We have to face it, our teacher  core is aging,\" said Ruppe. \"More  seniority means higher pay. Our  mix of younger and older teachers  just isn't as stable as on the  Wasatch Front. People stay here.\"  Board members begin budget  workshops soon to work out all the  fiscal details.  . ft r ; n \" $  Students participating in the Utah State Mock Trail competition are front I to r- Ode-Jessica  Ode-Jessica Bowman, Genica Sprosty, Josh Harbism, David Kitchen, Amanda Speir Bo '  Dennis Judd (attorney advisor), Del Dickson, Carrie Hermann, Malinda Hartle, Brindi M  Bnnkerhoff, Jeff Ross, Clay Donaldson, Rick Bowman (advisor). Missing from pictutp  Mock trial contestants hope f  Fourteen Vernal Junior High  School students recently competed  in the Utah State Mock Trial program,  pro-gram, and increased their chances of  competing in the state tournament  finals by winning both matches.  Although the court case is not real,  re-al, everything else about the program  pro-gram is. Real courtrooms and  judges are part of the program, and  the trial is carried out as if it were  real-life.  The Vernal Junior High program  is in its 1 1th year, and its advisor is  Rick Bowman.  Every team in the program is entitled  enti-tled to a professional attorney's advice,  ad-vice, and this year's team was assisted  as-sisted by attorney Dennis Judd.  \"Mr. Judd was extremely valuable  in helping the kids prepare for the  There's No Excuse For Domestic Violm  For information on how you can help stop domestic violence, coll  1-800-END ABUSE  trial by spending many of his own  hours teaching them how to conduct  themselves in court and in the development  de-velopment of court strategy,\" said  Bowman.  This year's case is a civil matter,  Johnson vs. Banner, Hays and  WASP in which the plaintiff is  charging that a white-supremist  group is responsible for a wrongful  death. The defense is claiming that  the death occurred in self-defense  and that certain First Amendment  freedoms are at stake.  The first match was Friday, March  28, at the Roosevelt Court House  against the Centennial Middle  School of Provo. The VJH team lost  to this team last year by one point,  but was able to return the favor this  year by winning by the same margin.  mar-gin. Playing the part of the plaintiff,  Carrie Hermann was na  witness, and Odessa A  Amanda Speir were nay  torneys.  The second match v..  April 12, at the 3rd C  Building in Salt Lake ;  Fairfield Junior Hi;.!  Playing the part of i!  the VJH group won hy ,  Again, Addison an !  named best attorneys,  Bowman and David Ki  as best defendant witne-  Because of high points  ed in both trials, ik Y  hopes to be eligible !, ;  action beginning April  ing that same week v.  championship to K ,  City.  Family Vioknct Prcv.  i !  t  X  ti  I  \"I  (POOR COPY j", "parent": 22653316, "version": 1739895063551410176}, {"id": 22653324, "paper": "Vernal Express", "type": "page", "date": "1997-04-16T00:00:00Z", "year": "1997", "month": "April", "day": "16", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/91/46/9146d5a2869dbf83150d36e057286747b8e4684e.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/cf/45/cf457daf86818bcb9d638af3df5312a59934d355.pdf", "page": 8, "ocr": "8 Vernal Express Wednesday, April 16, 1997  GENERAL NOTICE  TO CONTROL  NOXIOUS WEEDS  Notice is hereby given  this 2nd day of April,  1997, pursuant to Section  4-17-7 of the Utah Noxious  Nox-ious Weed Act, to every  person who owns or controls  con-trols land in Uintah County,  Coun-ty, Utah, that noxious  weeds standing, being, or  growing on such land  shall be controlled and the  spread of same prevented  by effective cutting,  tillage, cropping, pasturing,  pastur-ing, or treating with  chemicals or other effective  effec-tive methods, or combination  combina-tion thereof, approved by  the county weed supervisor,  supervi-sor, as often as may be required  re-quired to prevent the  weed from blooming and  maturing seeds or spreading  spread-ing by root, root stalks, or  other means.  Upon failure to comply  with this notice, the owner  own-er or person in possession  of property upon which  noxious weeds are present  shall be deemed negligent  and enforced control measures  mea-sures may be imposed at  the discretion of county  authorities. Expenses of  control measures employed  em-ployed by the county shall  be paid directly by the  owner or person in possession  pos-session of the property, or  shall constitute a lien on  the property and become  collectible by taxes.  The following are declared  de-clared noxious weeds for  the State of Utah:  Bermudagrass  Bindweed (Wild morn-ingglory)  morn-ingglory) Broad-leaved pepper-grass  pepper-grass (Tall whitetop)  Canada thistle  Diffuse knapweed  Dyers woad  Perennial sorghum spp.,  including but not limited  to Johnson grass  Leafy spurge  Medusahead  Musk thistle  Quackgrass  Russian knapweed  Scotch thistle  Spotted knapweed  Squarrose knapweed  Hoary cress (Whitetop)  Yellow starthistle  In addition, Russian  olive and Purple lythrum  (Purple loosestrife) are  declared noxious weeds in  Uintah County and thereby  there-by come under the provisions  provi-sions of the Utah Noxious  Weed Act.  Landowners with one or  more noxious weeds on  their property may obtain  up to 50 funding by  Uintah County for herbicide  herbi-cide chemicals by contacting  con-tacting Milton Billings,  Weed Supervisor, at the  Uintah County Shop, 789-1070.  789-1070. You may also contact  con-tact the following Weed  Board members: Blaine  Argyle, Randlett, at 545-2437;  545-2437; Mark Kettle, Roosevelt.  Roo-sevelt. 722-2041; Gene  Nybcrg, Lapoint, at 247-2305;  247-2305; Udell Gardiner,  Vernal, at 789-1503; or  John Snow. Jensen, at  789-1538. Information on  the program is also available  avail-able from Chad Rcid.  County Extension Agent,  at the Uintah County  Courthouse. 78 1 -5452.  Published in the Vernal  Express April 2. 9, and  16. 1997.  NOTICE OF RE DID  TO CONTRACTORS  The Uintah Special  Service District (USSD)  it receiving scaled proposals  pro-posals for the GRAVEL  CRUSHING AT THE  UINTAH COUNTY ASPHALT  AS-PHALT PIT  reOJECT. Scaled pro-powU  pro-powU will be received  by the USSD. at the Putrid  Pu-trid Office at 134 Wct  Main Street. Suite 101.  Vernal. Utah, until 12  noon on Apnl 29. 1997.  Scaled propmali will be  opened at 7 00 pm on  April 29. 1997. the  Khcdutcd Board of Director!  Di-rector! meeting at the  hove ftklrct.  Specification, ptopon-al  ptopon-al form and plan may  be obtained isAx X the  USSD office, upon application  ap-plication and drpmil of  S200TJ, which will be re-funded  re-funded upon return of the  bid documents. Dated  this 8th day of April.  KATHRVN  ER1CKSON.  Marwtw.USSt)  Published in the Vernal  Eaprew April 16, 1997.  NOTICE TO WATER  .USERS  The State Engineer received  re-ceived the following Applications  Ap-plications to Appropriate  Water (Locations in  SLB&M unless otherwise  designated).  Persons objecting to an  application must file a  Protest stating the reasons  for the protest. To have a  hearing before the State  Engineer, persons must  request a hearing in the  protest. Protest must be  filed in duplicate with the  State Engineer, 1594 West  North Temple, Salt Lake  City, Utah 84114, (801-538-7240)  on or before  May 6, 1997.  (PROTESTS MUST BE  LEGIBLE WITH A RETURN  RE-TURN ADDRESS.)  These are informal proceedings  pro-ceedings as per Rule  R655-6-2 of the Division  of Water Rights.  (LEGEND: Point(s) of  Diversion POD; Place  of Use POU; Nature of  Use USE)  UINTAH COUNTY  41-3474 (A70784):  Richard D. Muhlestein  QUANTITY: 4.73 ac-ft.  SOURCE: 6 in. well 100  ft. to 300 ft. deep. POD:  (1) N 840 W 2450 from  SE Cor, Sec 16, T1S,  R24E. (Diamond Mountain)  Moun-tain) USE: Irrigation:  from April 1 to Oct. 31,  total acreage 1.00 acs;  Stockwatering: 10 head of  livestock; Domestic: 1  family. POU:  SWl4SEl4Sec 16.T1S,  R24E.  ROBERT L.  MORGAN, P.E.  STATE ENGINEER  Published in the Vernal  Express April 9 and 16,  1997.  PUBLIC NOTICE  The Uintah County  Commission will hold a  public hearing in the regular  reg-ular meeting on Tuesday,  April 29, 1997, beginning  at 1 :30, to consider a petition  pe-tition from Robert Haws  to vacate a roadway running  run-ning in a Northeasterly  direction between 1500  South Street and the road  leading to the Asphalt Pit  access gate at the approximately  approx-imately 3500 West alignment  align-ment also described as  follows:  Beg at a pt on West  line, Section 29, T4S,  R21E. SLM. at intersection  intersec-tion of West Section line  and centerline of paved  road, said road being 20'  wide, 10' either side of  said centerline, said beg  pt being N227'22\" W-23.69'  W-23.69' from SW comer  of said Section; thence  following existing paved  road and along a curve to  right having a long chord  of 552.91' and bearing  N5650'25\"E, said curve  having a radius of  542.29', and a delta angle  of 61I8', following the  curve to intersection with  county road used for access  ac-cess lo county asphalt pit.  The meeting will be  held in the County Commission  Com-mission Chambers,  StateCounty Building  152 East 100 North, Vernal.  Ver-nal. UT. The public is invited  in-vited to comment andor  attend. For further information  infor-mation or to submit written  writ-ten comments contact the  Uintah County Planning  Office. 152. East 100  North. Vcmal. UT 84078.  (801)781-5481.  Published in the Vernal  Express. April 2, 9, 16  and 23, 1997.  NOTICE TO  CREDITORS  Lvt.nc of Lou Simper,  Deceased  Probate No. 973800002  Nonce l hereby given  that Gary Simper, has  been appointed as Personal  Per-sonal Representative of  the above etiaie.  All peroni having  claims gainl the above  et.iie are requited to present  pre-sent them to the Personal  Representative or. to the  Cletk of the Court within  three (3) months after the  date of the fust publication  publica-tion of this notice or said  claiim shall be forever  barred.  Gary Simpc,  tlo McKeathnie and  Allred. P C  I2I WctfMain Street  Vernal, Utah 4Q?8  Published in the Vernal  ts pre April 9, 1 6 and  23, 1 997.  NOTICE TO  CREDITORS  Estate of Ruben  Sixkiller, Deceased  Probate No. 973800008  Notice is hereby given  that Joan Yazzie, has  been appointed Personal  Representative of the  above estate.  All persons having  claims against the above  estate are required to present  pre-sent them to the Personal  Representative or to the  Clerk of the Court within  three (3) months after the  date of the first publication  publica-tion of this notice or said  claims shall be forever  barred.  Joan Yazzie  P.O. Box 62  Ft. Duchesne, Utah  84026  Published in the Vernal  Express April 9, 16 and  23, 1997.  NOTICE OF ANNUAL  MEETING  The annual stockholders  stockhold-ers meeting of the Vernal  Investment and Amusement  Amuse-ment Company will be  held April 22nd, 1997 at 2  p.m. at 1109 West 500  South, Vernal, Utah.  Published in the Vernal  Express April 9 and 16,  1997.  NOTICE  Notice is hereby given  that the Uintah Water  Conservancy District will  be holding a public hearing  hear-ing on the 22nd day of  April, 1997 at its office,  78 West 3325 North,  10:00 a.m. The purpose  of this public hearing will  be to solicit comments  concerning a funding request  re-quest being made to the  Permanent Community  Impact Fund Board for  money to construct the  Red Wash Dam, to be located  lo-cated North of Lapoint,  in western Uintah County,  Coun-ty, Utah. The application  requests a grant, but financing  fi-nancing offered may be  in the form of a loan. At  this meeting information  will be given regarding  the project and its proposed  pro-posed financing.  DAVE MURRAY,  President  GILBERT BROUGH,  1st Vice President  Published in the Vernal  Express, April !6, 1997.  PUBLIC NOTICE  DATE CHANGE FOR  SCHOOL PICTURE BID  The Uintah School District  Dis-trict procurement office is  currently soliciting bids  for school and activity  picture services. The date  for bid opening was originally  origi-nally set for April 21,  1997 at 3:00 p.m. However,  Howev-er, due to time constraints,  we must extend the opening  open-ing date to Thursday,  April 24, 1997 at 3:00  p.m. No fuxed bids will  be accepted. For specifications  specifi-cations please contact  Brad Anderson, Purchaser  at (801) 781-3100. 635  West 200 South. Vcmal.  Utah. 84078.  Uintah School District  reserves the right to accept  ac-cept or reject any or all  bids.  Published in the Vernal  Express April 16, 1997.  PUBLIC NOTICE  The Uintah County  Commission will consider  the adoption of an ordinance  ordi-nance to enact Tax Sale  Procedure. For additional  Information contact the  Cterk-Auditor'i office,  147 East Mam. Vcmal,  during regular business  hours, A public heating  will be held Tuesday.  April 22. 1997 at 2.00  pm, in the Commission  Chambers,  PAT MCNEILL,  CIrrk-Audilor  Published In the Vernal  Eprcs April 16.1997.  NOTtCK OF  MEETING  Uintah Water Conservancy  Conser-vancy District's regular  board meeting will be  held April 22. 1997, convening  con-vening immediately after  i public heating at 10 00  8 m at the District office,  78 West Jiy North. Vet-nal.  Vet-nal. Utah M0?8  Published in the Vernal  Esprcss April 16, 1997.  PUBLIC NOTICE  Utah's Grand Jury  Statute requires that a  panel of judges selected  from throughout the state  will hold hearings in each  judicial district every  three years to determine if  a grand jury needs to be  summoned based upon  criminal activity. The Attorney  At-torney General, a county  attorney, or special prosecutor  prose-cutor appointed under  U.C.A. 77-10a-l can also  present evidence to the  panel of judges based upon  up-on criminal activity to  summon a grand jury. The  panel of judges win secret  all persons claiming information  infor-mation justifying the calling  call-ing of a grand jury. All  persons appearing shall be  placed under oath and  shall be examined by the  panel of judges.  The purpose of the  hearings is for the judges  to receive testimony to  determine if reasonable  cause exists for calling a  grand jury. Persons appearing  ap-pearing to testify claiming  information justifying the  calling of grand jury  should be prepared to  give evidence in support  of such claims. In this regard,  re-gard, persons considering  appearing to testify  should bear in mind that it  is not the purpose of the  hearing to hear and consider  con-sider controversies between  be-tween individual parties.  If a grand jury is summoned,  sum-moned, the jurors may be  drawn from the state at  large or any judicial district  dis-trict within the state.  The next grand jury  panel is scheduled for  Tuesday. May 13. 1997.  9:00 a.m. to 4:00 p.m. in  the 2nd Floor Conference  Confer-ence Room at the Vernal  Courthouse at 147 East  Main Street. Vernal.  Utah.  Individuals who would  like to testify before the  panel of judges on the  scheduled date need to  contact either the Clerk of  the Court, JoAnn McKee  at 789-7534 or D. Mark  Jones, District Court Administrator,  Ad-ministrator, at 579-3971  at least one week prior to  the scheduled date for an  appointment.  Administrative Office  of the Courts  230 South 500 East,  Suite 300  Salt Lake Citv, Utah  84102  (801)578-3800  Published in the Vernal  Express April 16, 1997.  PUBLIC NOTICE  The Uintah County  Board of Adjustments  Administrative Officer  will be considering the  following request:  Delbert Martin: A variance  vari-ance to allow construction  construc-tion of a residence on a  lot that does not have the  required road frontage  and is accessed by a private  pri-vate right of way. The  property in question is located  lo-cated at 14386 W. Dry  Fork Canyon, Vernal, and  contains 10 acres.  This variance will be  granted to the above by  the Administrative Officer  Offi-cer if no appeals are filed  within five (5) working  days. Appeals can be  mailed to Uintah County,  Building and Zoning, 152  East 100 North, Vernal.  For more information,  contact Dale Peterson,  Zoning Administrator,  781-5346, during regular  business hours.  Published in the Vernal  Express April 16, 1997.  PUBLIC NOTICE  The Uintah County  Commission will consider  the adoption of an ordinance  ordi-nance to enact Tax Sale of  Contaminated Properties  Procedures. For additional  information contact the  Clerk-Auditor's office,  147 East Main, Vernal,  during regular business  hours. A public hearing  will be held on Tuesday,  April 22, 1997 at 2:00  p.m. in the Commission  Chambers.  PAT MCNEILL,  Clerk-Auditor  Published in the Vernal  Express April, 16, 1997.  NOTICE  Notice is hereby given  that on March 31, 1997.  Kaleidoscope Foundation,  Inc. filed an application  with the Federal Communications  Commu-nications Commission for  a construction permit for  a new noncommercial educational  ed-ucational television station  sta-tion on Channel 6 at Vernal,  Ver-nal, Utah. The officers  and members of the Governing  Gov-erning Board of Kaleidoscope  Kaleido-scope Foundation, Inc.  are: Larry E. Morton,  Gregory W. Fess, and  Max W. Hooper. The proposed  pro-posed television station  will operate with 1 kilowatt  kilo-watt visual ERP with antenna  an-tenna height 178 meters  above average terrain,  from a transmitter site locate  lo-cate on Asphalt Ridge approximately  ap-proximately 6 Km SW of  Vernal. A copy of the application  ap-plication and related materials  ma-terials is on file for public  inspection during normal  business hours at Uintah  County Library, 155 E.  Main St., Vernal, Utah  Published in the Vernal  Express April 16, 23 and  30, 1997.  PUBLIC NOTICE  PUBLIC HEARING  CANCELLED  To the Public and Residents  Resi-dents of Vernal City:  Notice is hereby ' given  that the Vernal City Council  Coun-cil public hearing scheduled  sched-uled for Wednesday, April  23, 1997 at 7:30 p.m. has  been cancelled. The public  pub-lic hearing was to consider  consid-er the recommendation of  the Planning Commission  on a rezone request by  Columbia Ashley Valley  Medical Center to rezone  property located at approximately  ap-proximately 75 North 200  West and 150 North 200  West from Commercial  (C-2) to Health Care (HC-1)  (HC-1) zone. The City Council  will hold a public hearing  on this matter at a later  date.  Published in the Vernal  Express April 16, 1997.  Eanth  Tips  How do you write  a Classified Ad  that gets Results?  Be Thorough  Sure you want your ad to stand out from the  rest, but don't skimp on the sort of information  that sells. The items condition, size, age, brand  name, and color are some of the basics readers  want to know. Without them, your ad may be  passed by.  Steer Clear of Abbreviations  OK. so you want to include all the important  basics, now don't confuse your reader by using  strange abbreviations. What is periectly clear to  you may be perfectly unrecognizable to someone  else!  Be Honest  Exaggerating your items finer points may bring  in a lot of responses, but a buyer who's misled  won't appreciate it-and will take his business  somewhere else.  State Your Price  The cost of an item is one of the most important  concerns of Classified readers. Ads snowing  prices arc ones which get results. Giving a price  also serves to \"weed out\" those buyers not in  your price range.  Be Accessible  Including a telephone number or address puts  you In touch with potential buyers. Dc sure to  state the hours you can be reached: a caller who  can't get through the first time often won't call  again.  Don't hesitate to call us with any questions or  Kroblcms you may have. Out staff would be  appy to help you with your classified ad. That's  why we're here: to help you get the results you  deserve.  789-3511  j VERNAL  EKpire&&  mm mm  The before and  after of recycling  by Linda West  You're at the checkout in the  grocery store and the friendly bagger  bag-ger asks, \"Paper or plastic?\"  If you're trying to be an environmentally  environ-mentally conscientious shopper,  perhaps you ponder the alternatives:  alterna-tives: \"Well, paper comes from renewable  re-newable trees and is biodegradable,  but plastic is less bulky and takes  less landfill space... but it's  petroleum-based, so it's not renewable...  renew-able... but paper manufacturing  causes a lot of water pollution...  yeah, but what about oil spills...  aaarrgh!\"  Probably very few of us really engage  en-gage in such mental debates, but in  any case the best answer to the bagger's  bag-ger's question is \"Neither!\" and  you pull out your handy reusable  cloth bag. Paper and plastic bags  each have their pros and cons, but  the fact remains that both are designed  de-signed to be used only once or a  few times and then disposed of  (both can be recycled, but how  many actually are?). A sturdy canvas  can-vas bag should last for years, and  even when the bottom finally gives  out or the handles are too frayed, it  can give further service as, say, a  cleaning rag or a cat's bed before  ending up in the trash can.  Maybe you've seen or heard the  phrase, \"Reduce, reuse, recycle.\"  Note that \"recycle\" comes last in  the sequence because creating  less waste in the first place is more  efficient than trying to figure out  what to do with it later. Before you  recycle, what can you do to reduce  your share of the waste stream?  How you fill up that canvas shopping  shop-ping bag is one important step.  Packaging paper, plastic wrap,  cardboard, cans, bottles, jars accounts  ac-counts for a large volume of our  trash. Single-serving packages are  often convenient, but we pay for  that convenience both directly, at  the checkout, and indirectly, in disposal  dis-posal of the packaging. When products  prod-ucts come in several sizes, choosing  choos-ing the largest size that is practical  for you is not only more economical,  economi-cal, it usually means less packaging  per unit of product as well. And  whenever possible, try to avoid  products with wasteful packaging,  such as a small bottle in a large  plastic bubble on an even larger  cardboard backing.  Some kinds of packaging, of  course, can serve more than just  their initial purpose. How many of  us store leftovers in former margarine  mar-garine tubs, or save peanut butter  jars to fill with Christmas candies  and give to friends? \"Reuse\" is the  next step: get as much use as possible  possi-ble out of everything before recy  cling or disposing of it. Use both  sides of that writing or copier paper  before you put it in the recycle box;  turn fabric remnants into quilts or  doll clothes; save scraps of lumber  for birdhouses or craft projects. If  you're no longer using items of  clothing, kitchenware, furniture,  books, toys, etc., have a yard sale  or donate them to a club or church  rummage sale, or to Deseret  Industries chances are someone  else can use them.  Make a habit of choosing reusable  and long-lasting products whenever  you can. Like to have your coffee at  the office, or a big cold soft drink  while you're on the road? Instead of  discarding a foam or paper cup each  time, keep refillable mugs and cups  at your desk and in your car.  Constantly replacing batteries in  toys, flashlights, portable stereos?  Try rechargeable batteries instead  in-stead their higher initial cost will  be offset by repeated uses. (Some  stores will recycle these batteries  when they've reached their maximum  maxi-mum number of recharges, which  also helps keep toxic metals out of  the waste stream.)  Finally, after you've reduced,  reused, and recycled, there's one  more step: look for products made  from recycled materials, particularly  particular-ly those that specify \"post-consumer\"  content (that's the stuff  you've used and recycled, as opposed  op-posed to pre-consumer recycling  within paper mills and other industries).  indus-tries). Chances are you're already  doing this at the grocery store:  about half the aluminum in beverage  bever-age cans has been recycled; steel  cans and glass average about one-eighth  one-eighth to one-fourth recycled material;  mate-rial; and many cereal and cracker  boxes and molded-pulp egg cartons  are made mostly from recycled paper.  pa-per. But these are just the containers;  contain-ers; what about actual goods? This  takes a little more searching, but in  various local stores you can find  writing pads, envelopes, toilet tissue,  tis-sue, file folders, greeting cards, and  copier and computer papers with  substantial post-consumer content;  pencils made from recycled plastics  and wood scraps; and carpeting  with polyester fibers that used to be  soft drink bottles.  Those bottles may also turn up as  fiberfill in your winter jacket or  sleeping bag; recycled newspapers  and magazines may one day become  be-come insulation in your house. We  still have a long way to go in reforming  re-forming our wasteful habits, but  predictions that we'll drown in our  own trash are too  pessimistic we're finding ways to  live in it instead!  Why Haven't You  Bought A Home?  Down Payment?  Advanced Funding has a program to help you purchase a  home with NO DOWN PAYMENT. To name a few benefits:  No Down Payment Required  Possibility of Closing Costs included in loan  $0 Out-of-Pocket Cost  No Prepayment Penalty  Why Rent When You  Can Own!  Call for your FREE  it  ADVANCED  FUNDING  HOME MORTGAGE LOANS  1 1 Credit Analysis  TOLL FREE 1-888-571-HOME  (801) 272-0600  PUBLIC NOTICE  Uintah County Commission hereby gives notice of vacancy for one (1)  position on the Administrative Control Board for the Uintah Soecial  Service District. Vacancies on special district boards shall be filled as  provided In Section 20A 1-512 (UCA). The County Commission may  reappoint the member with the expiring term, appoint a new member, or  appoint a county commissioner.  PERSONS INTERESTED IN SERVING AS A MEMBER  OF THE ADMINISTRATIVE CONTROL BOARD SHALL:  1) Not be an employee of the Uintah Special Service District.  2) Be a registered voter, residing within the District's boundaries,  3) File a Declaration of Consideration for Appointment, and include  4) A resume stating qualification and interest in the position, and  5) SENDDELIVER TO:  Commissioner Lewis G. Vincent  Chairman, Uintah County Commission  Uintah County County House  152 East 100 North  Vernal, Utah 84078  BEFORENQOH ON FRlDALJUNEUlh. 19Q7.  For more information (packet) contact Kate Ericsson, Manager, Uintah  Special Service District at 7894636 tK at the District Office at 134  West Mam Street. Suite 101, Vernal, Utah.  .JUL", "parent": 22653316, "version": 1739894759938326528}, {"id": 22653325, "paper": "Vernal Express", "type": "page", "date": "1997-04-16T00:00:00Z", "year": "1997", "month": "April", "day": "16", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/e1/bc/e1bcc37da4e58fd3d9990b343354a2e44b17bd7e.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/2c/f0/2cf06cd28b39f66112b73a4cac746f29991d780a.pdf", "page": 9, "ocr": "TT Ypdate  SJ) Snow Survey  Snow Survey and Water Supply for the Uintah Basin  contact: USDA-NRCS Nick Lundstrom 722-4621  (Natural Resources Conservation Service formerly SCS)  As Of April 14, 1997  SNOTEL SITE ELEVATION Snow Water Content 30 Year Aver- Percent  Drainage pp (inches of water) age Water ofAvgi  1 ' 1994 1995 1996 Content  TrSSR,er 25A 32' 36-5 259 1  RRokckCC?eekk 7'9 2A 7\"8 179 54 331  4kf r0lkoBaSln 11 -100 22-8 27,5 29.0 24.8 117  Brown Duck 10,600 23.5 20.1 24.4 19.9 123  Lake Fork River  Lake Fork 1 10,200 1 8.7 13.4 .17.2 12.1 142  Yellowstone River  Five Point Lake 11,000 23.2 19.5 27.1 18.3 148  Yellowstone River  CSeta, a' 10'300 20A 11 25.7 13.7 188  Wruterocks Rtver  Mosby Mtn. 9,500 20.6 9.1 25.7 11 6 222  Whiterocks River & Mosby Creek  aSSJcS1\" 9,400 9-8 65 m4 10-6 1 55  Kings Cabin 8,730 10.4 5.5 16.2 10.6 153  Brush Creek  Hickerson Park 9,150 3.9 3.5 12.6 6 6 191  Steep Creek North Slope) ,ai  Hole-in-Rock 9,150 5.8 5.8 11.8 6 2 190  Beaver Creek (North Slope)  Indian Canyon 9,100 11.0 10.0 18.7 10.8 173  Strawberry Hiver & Argyte Creek)  Currant Creek 8,000 6.3 8.5 13.7 7 9 173  Currant Cr. & Strawberry River  East Willow Creek 8,250 3.5 2.7 11.4 3 7 308  Willow CreeMBook Cliffs)  Strawberry 8,000 11.8 19.5 24.9 15.8 158  Strawberry  Strawberry Dto 8,400 1 2.6 19.6 29.7 17.6 169  Strawberry  Provisional Data from snow pillows at snotel sites, subject to revision '  Finish first  In the  Express  789-3511  54 N. Vernal Ave.  789-3511  mwm  EDM  DOS  Sr n  Super charge your wheels with a new car loan from  Mountain America, we're olTenng a competi  tive rate on new and used automobiles dur  ing the month of April.  Visit or all the  Mountain Ameri  ca branch near  est you for more MOUNTAIN AMERICA  information. Or credit union  visit our web site. hllp:www.mtnomeri(o.org  ' mmmmm!ib  Residents to  join in World  Service Day  Uintah Basin members of the  Church of Jesus Christ of Latter-day  Saints will donate their skills and  combined manpower to their communities  com-munities during World Pioneer  Heritage Service Day, July 19.  The service day has been designated  desig-nated by the Church's presiding  First Presidency, Gordon B.  Hinckley, Thomas S. Monson and  James E. Faust, to commemorate  the 150th anniversary of the arrival  of the first Latter-day Saint pioneers  in the Salt Lake Valley.  The sesquicentennial celebration  honors pioneers of all times and  places who have helped establish  the LDS Church throughout the  world.  During this one day service  marathon, each congregation of the  Church has been asked to contribute  a minimum of 150 hours of community  commu-nity service. If the challenge is successfully  suc-cessfully met, more than 3.5 million  service hours will be donated  worldwide.  Local congregations, such as the  Naples 1st and 2nd Wards, have already  al-ready begun to organize projects.  They plan to remove a field of  rocks from the east end of Naples  City Park so family picnic areas can  be built in their place.  Other congregations hope to join  with members of other faiths to  complete projects which will improve  im-prove the community at large.  As the modern-day beneficiaries  of the sacrifices made by the pioneers  pio-neers who have preceded them,  Uintah Basin Latter-day Saints plan  to use World Service Day to show  their gratitude by unitedly rendering  charitable service to the community.  Vernal Express Wednesday, April 16, 1997 9  Friday, April 11 representative students from every Maeser class  shave Dr. Klein's beard at the culmination of a month long contest  to promote 1 5 minutes of reading every day at home. Many prizes  were awarded by drawing reading coupons.  Maeser Elementary Students of the Week are top I. to r.: Taylor  Jeski, Chant Caldwell, Cynthia Owen, Nicole Peterson. Bottom I. to  r.: Dallas Goodrich, Kara Dockter, Zachary Sessions. Absent:  Langdon DeCamp.  Vernal City  SECRET WITNESS  789-8888 4j  r  rrogram  WARNING  GAS PIPELINE  before digging or in an emergency call  questar pipeline co. toll free i-boo 300 2025  If -  Skfeil. .-Us,-.--\"- : V vil lU  1  IT MARKS HIGH PRESSURE  UNDERGROUND NATURAL GAS  PIPELINES OF QUESTAR PIPELINE CO.  Call before you dig.  State law requires that if you're doing any excavating,  exca-vating, seismic work, road grading, building or  any other construction near these markers, you  must notify the appropriate company. A Questar  Pipeline representative will come and locate our  existing underground pipelines for you at no  charge. Questar Pipeline is a participant in the  following utility notification ceniers;  Utah Blue Stakes 1 800 662 4111 On state) ot  1 801 532 5000 (out of stainl  Wyoming One Call Concepts 1 800 343 1030  Colorado Utility Notification Center of Colorado 1 800 922 1987  You can also call Questar Pipeline directly at 307-382-8882  irt(ft c\"i enly \"nMy QiutUf P'Wi'n. (Hit olh ul'i't ot p.punp omt I  Be able to recognize and report pipeline hazards. The uncommon conditions below may indite  a pipeline problem or emergency. Please immediately report it by calling the telephone number below.  i i m nr  f L. I oSSn ISL  MM  Vj I  1 7j  IM Ui  Wong lowod Wo t i epod B-e\"g ertianifg horn Wo t t il I  f k QueStar EMERGENCY TELEPHONE:  fipyilliy yt iwurntt I'OVUMVV'ivi way ui 111111", "parent": 22653316, "version": 1739887741903044610}, {"id": 22653326, "paper": "Vernal Express", "type": "page", "date": "1997-04-16T00:00:00Z", "year": "1997", "month": "April", "day": "16", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/00/89/0089290aece17b1713b98af17bbec8c6abc951cd.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/1b/c7/1bc75340fa96cecb4c394d665e4fe4882f133829.pdf", "page": 10, "ocr": "BUY.SELLJRADE OR RENT THROUGH THE  S3l  10 Vemal Express Wednesday, April 16, 1997  CLASSIFIED AD  RATES AND  INFORMATION  RATES:  20$ per word (5 per  word extra for black  type). $4.00 minimum,  cash in advance. $1.00  extra charge if billed.  DEADLINE:  Monday, 5:00 p.m.  ERRORS:  Please read your ad  and call us immediately  if there are errors. We  will cheerfully make  any corrections necessary.  neces-sary. However, we cannot  can-not be responsible for  any errors that continue  contin-ue after the first publication.  publi-cation. PHONE  789-3511  FAX  789-8690  OFFICE HOURS:  8 a.m. to 5 p.m.  Monday through Friday  Closed Saturday  PUBLISHER'S NOTICE  All real estate advertised in  this paper is subject to the  Federal Fair Housing Act of  1968 which makes it illegal to  advertise \"any preference,  limitation, or discrimination  based on race, color, religion,  sex. or national origin, or any  intention to make any such  preference, limitation or discrimination.'  dis-crimination.' This newspaper will not know  ingly accept any advertising  tor real estate whicn is in vio  lation of the law. Our readers  are informed that all dwellings  advertised in this paper are  available on an equal opportu  nity basis.  Animals  AFTER 50 years raising  registered quarter horses,  we are selling foals with  small down payment and  monthly payments until  paid for. Mares and foals  will be on 300 North 500  West after April 15. Please  don't go into the pasture.  ' Contact Woodsy B. Searle  789-2126.  TWO-YEAR-OLD  HORNED hereford bulls,  weight approx. 1,600 lbs.,  quality, good disposition.  Gilbert Myers Hamilton,  Colo. 970-824-6272.  STEEL PIPE 4\" posts 6'-S7.00ea..  6'-S7.00ea.. T-$8.00ea., 8'-S9.00ea.  8'-S9.00ea. Steel pipe for  rails, 4\"x2V lengths,  S0.76ft. other lengths  available. Call for free  stockprice list. 1-800-947-0249  Metalmart, 1200 E.  100 S. Leni. Delivery available  avail-able EIGHT SMALL yearling  herefords for sale 789-1358.  789-1358. SWEET HAND-FED  babies: Macaws, Amazons.  Ama-zons. Greys, Senegals,  Red-bellies, Sun conures.  Red-throats and others.  Some breeder pairs. D.J.'s  Fancy Feathers Farm 801-465-9646.  DIAMOND PET FOODS.  High quality, premium specialty  spe-cialty foods. L & L K-9 Services  Ser-vices 2441 E. 2500 S.  801-789-2958.  NEEDED PASTURE lor  35 pairs ol cattle. Phone  7R9610  Bus.  Opp.  HEY, WE'LL do II lot you!  Dool believe me? Cad 1  600 811-2141 7inv7pnv  Reference 'W!. II you  can'l make money doing  fhis...thefl go beck to  bed'!  FRIENDLY TOYS 4  GIFT has immediate  epnng m yje area  Number on w party pun  toy, ol, Christmas,  home decor. Free telaiofl  and Inhumation. 1-800'  For  Rent  TWO WEEKS FREE  RENT. Clean, 3 bedrooms,  bed-rooms, gas heat, major  appliances, wd and cable  TV hook-ups, storage and  carport. Close to town.  Rent starts $295 and up.  Sorry no pets. Senior citizen  citi-zen discount. Twin Cedar  Apartments, 789-8711,  789-4654.  TWO BEDROOM apts.  $220-$250mo. No pets.  Deposit and references  required. 789-2075 or 789-4033.  789-4033. CLEAN, 3-BEDROOM  apts. Great location. Call  Tim or Ashley Bingham,  781-2445.  ASPEN PARK APTS.  Large beautiful 2 and 3  bedroom apartments. Quiet,  Qui-et, excellent location, gas  heat, AC, WD hookups,  carports. Senior citizen  discount. 789-7341, 789-3291  789-3291 or 789-0721.  BASIN'S BEST APT. Ask  about our move-in special.  Spacious, nice, clean, quiet,  qui-et, 2 or 3 bedrooms. Several  Sev-eral locations, pool, hot  tub, wood stove, garage  and carports, appliances  included, some furnished.  $270mo. to $430mo.  Office at 575 N. 175 E.  After hours leave mes-sage,  mes-sage, 789-8426.  WILLOWBROOK TOWN  HOMES, nicest! 1-12  bath, large kitchen, wood  stoves, gasheat, dishwasher,  dish-washer, disposal, wd  hookups, playground.  Senior discounts. $350.  (801)781-2200.  NICE 2 BEDROOM apts.  Excellent location. Call  Jeff or Melinda Palmer,  789-4052.  TWO BEDROOM town-house.  town-house. WD, $325mo. No  pets. Call 789-9928 or  789-7048.  ONE BEDROOM apt.  Clean, no pets. $190mo.  Work 789-5451, home  789-2438.  CLEAN 2-BEDROOM  duplex apartment. Ideal for  couples. No pets. Water,  sewer and garbage paid.  $325 rent, $300 deposit.  References required. 789-4584  789-4584 176 W. 350 N.  THREE BEDROOM, 1-12  bath condo wd hookups,  stove, fridge, dishwasher,  drapes. No pets. 789-0163,  789-0163, MOBILE HOME space,  fenced yard, storage,  shed. $140mo. includes  water, sewer, garbage.  100 W. 300 N., Duchesne.  222-9610.  MAESER FARM lor lease.  Approx. 45 acres ol alfalfa,  additional 8 acres of pasture.  pas-ture. All with excellent .  water shares. Cal 789-1234  789-1234 or 789-3656.  1920 SO. FT. office space.  East wing Naples Office  Bldg .(6011967:2995,  FOR RENT beginning May  1st. Industrial building  2.000 square laet ol Shop  240 square (eat ol office  7899239.  Garage  Sale  CASH ONLY OARAGE,  YARD, MOVING SALES.  Deadline for classified  advertising it S pm. on  Mondavi  OlOANTlC OARAGE  sate'!! Household Items,  gun stuff, ear stuff, clothing,  cloth-ing, pvC pipe, ehaira,  stoves, misc. 8 30 am.  Frtrtay, Apr 18, 895 N.  800 W.  BACK YARD SALE a  Suzuki street bike, a Murray  Mur-ray pedal bike, two-horse  horse trailer, two electric  stoves, a wicker love seat  and two chairs, a puff quilt  and shams and lots of  good stuff. Only Saturday,  April 19, 9 a.m. to 2 p.m.  Come and get it. 4199 S.  VernaMve  Help  Wanted  THE ADVERTISEMENTS  appearing in this column  may or may not constitute  offers of employment. Persons  Per-sons responding to these  advertisements may be  required to pay fees in  advance for licensing, permits,  per-mits, dues, portfolios, registration,  reg-istration, processing or  other services . Opportunities  Opportuni-ties advertised in this column  col-umn may require training  at the expense of the  applicant. No guarantee of  job availability, implied or  direct, is made by publishers.  publish-ers. DRIVERS...OVER 4,000  beginning drivers have  said yes to Swift. Training  is available in a 3-week  CDL training course  through Ogden-Weber  Applied Technical Center.  Financing & tuition reimbursement  reim-bursement available. Swift  offers: Great pay & benefits,  bene-fits, guaranteed employment  employ-ment (pre-hire program)  rider programs, assigned  equipment. We are hiring  drivers! Say yes to Swift:  1-800-347-9438. (eoe-mf:  min. 23 yrs-Vets 21 if E-4  or above).  NEED FREE JOB TRAINING?  TRAIN-ING? Young adults 16-24,  earn while you learn. Lots  of benefits and cash  incentives! For information,  informa-tion, call JOB CORPS  today. 1-800-426-JOBS.  DRIVERS. ..SWIFT  ANNOUNCES: Retention  incentive. Now hiring  drivers. Contracted training  train-ing available! Our drivers  earn more because they  get more miles. Swift  Transportation 1-800-347-9438.  (eoe-mf)  CASTLE VALLEY Services  Ser-vices provides the people  power needed for today's  heavy industrial requirements.  require-ments. We are now interviewing  inter-viewing for welders, pipe  fitters, equipment operators,  opera-tors, boilermakers, core  drillers, laborers, and millwrights.  mill-wrights. Motivated, quality  minded craftsmen may  apply by sending or faxing  your resume to : Castle  Valley Services, 1409  South 1500 East, Vemal,  Utah 84078 (phone) 801-781-1994,  (fax) 801-789-5644.  HOME TYPISTS, PC  users needed. $45,000  Income potential. Call 1-800-513-4343  exL B-2236,  Fee.  POSTAL JOBS. Start  $12.68hr. plus benefits.  For application and exam  Into, call 1-600-256-7606,  ext. UT263, 6 a.m. to 7  p.m.. 7 days.  WILDLIFECONSERVATION  WILDLIFECONSERVA-TION JOBS. Now hiring  gam wardens, security,  maintenance, park  rangers. No exp. necessary.  neces-sary. For application and  Into call 800-299-2470,  ext. UT263C, 6 a m .to 7  pm.,7 days.  CARPKNTF.R'S  HELPER  Vemal City it accepting  applications for i carpenter's  carpen-ter's helper. Full-time po-Mhon  po-Mhon Marling at $8.7lhr.  Mt be a high school  graduate or equivalent,  six months apprentice experience  ex-perience ami valid Utah  driver's liceme. Applications  Applica-tions available more Information  In-formation can be obtained  from Vemal Job Service,  1050 Market Drive. Vernal.  Ver-nal. I'lah U-1078. (HOI)  789-1211 or Vernal City  Personnel. 447 Eat  Main. Vemal. t'tah  84078. (801) 789-2253.  Job closes April 25, 1997  at J. 00 p m. Vemal City is  an equal pppnrtunity and  affirmative action employer  em-ployer Published in the Vemal  Esprecs April 16 and 2J,  1997.  CEMETERY  MAINTENANCE  WORKER  Vemal City is accepting  applications for seasonal  cemetery maintenance  worker.  Salary: $5.12-$6.97hr.  Season will last from  Mid-April through  September. Completion of  8th grade and valid Utah  driver's license. Applications  Applica-tions available or more information  in-formation can be obtained  from Vernal Job Service,  1050 Market Drive, Vernal,  Ver-nal, Utah 84078, (801)  789-1211 or Vernal City  Personnel, 447 East Main,  Vernal. Utah, 84078,  (801) 789-2255. Job closes  clos-es April 25, 1997 at 5:00  p.m. Vernal City is an  equal opportunity and affirmative  af-firmative action employer.  Published in the Vernal  Express April 16 and 23,  1997.  ZONING  COMPLIANCE  OFFICER  Vemal City is accepting  applications for seasonal  zoning compliance officer.  offi-cer. Salary: $6.68-$9.23hr.  $6.68-$9.23hr. Season will last  from Mid-April to  September. Must be a  high school graduate or  equivalent, valid Utah  driver's license, type 40  words per minute, and  have basic computer  knowledge with WordPerfect  WordPer-fect desirable. Applications  Applica-tions available or more information  in-formation can be obtained  from Vernal Job Service,  1050 Market Drive, Vernal,  Ver-nal, Utah 84078, (801)  789-1211 or Vernal City  Personnel, 447 East Main,  Vernal, Utah, 84078,  (801) 789-2255. Job closes  clos-es April 18, 1997 at 5:00  p.m. Vernal City is an  equal opportunity and affirmative  af-firmative action employer.  Published in the Vernal  Express April 16, 1997.  HELP WANTED: Earn up  to $500 per week assembling  assem-bling products at home.  No experience. INFO 1-504-646-1700  Dept. UT-1057.  UT-1057. HOMES NEEDED for adolescents,  ado-lescents, will pay for their  care in your home. If you  are out of the Vernal area  you may call collect. Call  789-7030.  EARN MONEY reading  books! $30,000yr income  potential. Details. 1-800-513-4343  ext. Y2236.  FEE.  SI.OOO'S POSSIBLE  reading books. Part time.  At home. Toll free 1-800-218-9000  ext, R-8413 for  listing. FEE.  SEIZED CARS from $175.  Porsches, Cadillacs,  Chevys, BMWs,  Corvettes. Also Jeeps,  4WDs. Your area. Toll free  1-800-218-9000 ext A-8413  A-8413 for current listing.  FEE.  SI.OOO'S POSSIBLE typing.  typ-ing. Part time. At home.  Toll free 1-800-218-9000  ext. T841 3 for listing. FEE.  PHARMACIST NEEDED.  Full-time position in rural  town. Call 801-257-0445,  ask for Alan lor details.  EASY WORKI Excellent  Pay) Assemble products at  boms. Call toll Ires 1-800-467-5566  axt. 8270.  WANTED 97 PEOPLE.  Will pay you to loss up to  29 plus pounds. Expires 4-22-97.  Call loll Ires 1-888-830-5334,  PHYSICIAN OFFICE  MANAOER. Full time  position. Must have 3 5  yeam of medical experience,  experi-ence, computer experience  experi-ence and strong communl-cation  communl-cation skins. Prefer prior  medical insurance billing  experience. Apply tor position  posi-tion at Columbia Ashley  V allay Medical Canter 151  Wast 200 North, Vemal,  Utah 64078, 801-769-  Home  Improv.  HOUSE NEED lac Ml?  Ca us' Hock Mountain  Coesnys We do stfng,  roofing, window, ate. For a  fr asttneta Cal 789-3149  REYNOLDS CONSTRUCTION.  CONSTRUC-TION. New, remodel, custom  cus-tom cabinetry and trim  work, siding, etc.  Licensed, insured. Free  estimates. Ron 789-1547  828-7779.  MANILA MAGIC Construction.  Con-struction. We do garages,  additions, siding and  decks. Trailers our specialty  spe-cialty and pitched roofs.  Licensed general contrac-tor  contrac-tor Call 801-784-3367.  THOMAS CONSTRUCTION  CONSTRUC-TION All types garages,  decks, patios, sidewalks  and more - Give me a call  - Reasonable - References.  Refer-ences. Free estimates  Thomas 789-3608.  WEEKLY MOWING, aeration.  aer-ation. Commercial-Residential.  Free estimates  789-6964.  QUALITY LANDSCAPING,  LANDSCAP-ING, your complete landscaping  land-scaping service. Custom  landscaping, sprinkler systems,  sys-tems, sod, mowing. Let us  take the hassle out of your  lawn care need. Free estimates  esti-mates 789-5286. Ask us  about vinyl fencing!!  i mama i  PRESERVE YOUR investment.  invest-ment. Don't hesitate to  paint. Interior, exterior,  paper hanging. Licensed,  Insured. Free estimates  Ron 789-1547 828-7779.  B U G M A N  SERVICEASPEN LAWN  AND TREE. We specialize  in dead bugs and greener  lawns. Low rates. Satisfaction  Satisfac-tion guaranteed. Free estimates.  esti-mates. 781-BUGS, Outside  Out-side Vemal area, 1-800-882-BUGS  Misc.  PROMPT DELIVERY service  ser-vice on your bottled gas.  Call 789-3198. SAV ON  PROPANE.  SEELEYS STORAGE  Units for all your storage  needs. Also storage buckets  buck-ets for food storage. See-ley's,  See-ley's, 1010 North Vernal  Avenue. 789-0933.  WHY RENT CABLE TV?  Satellite gives you more!  350 channels stereo  parental lockout - perfect  reception. $29 per month.  HEC, 789-1997.  SHORT ON CASH? We  make loans on anything of  value. Cars, Trucks,  Motorcycles, Guns, T.V.'s,  VCR'S. AAA PAWN. 57  NORTH 500 WEST. 789-4034,  789-4034, THE VERNAL EXPRESS  does not endorse, promote  pro-mote or encourage the  purchase or sale ol any  product or service advertised  adver-tised In this newspaper.  Advertisements are the  sol responsibility ol the  advertiser. The Vemal  Express hereby disclaims  all liability tor any damage  suffered as the result ol  any advertisement In this  newspaper. The Vernal  Express is not responsible  lor any claims or representations  represen-tations mads m advertise-ments  advertise-ments In this newspaper.  The Vemal Express has  the sola authority to adit  and locals any classified  advertisement as deemed  appropriate. The Vemal  Express reserves the right  to n?usa any advertising,  PLACE YOUR CLASSIFIED  CLASSI-FIED AD in not 1, not 2,  but 46 newspapers  throughout Utah, One  placement One payment  puts you into the VTAM  CLASSIFIED ADVERTISING  ADVERTIS-ING NETWORK Be  over 413.0O0 Ulahns lot  enty l\"S tot the 25  word Cal the VERNAL  EXPRESS at 601769'  3511 lot runlet inform-on.  For Only  Your Classified Ad  32,000 readers in the Vernal for 20 words or less  Shopping Area. (does not include billed ads)  100 Total Market coverage of  Uintah County Daggett County  Dinosaur and Rangely, Colo.  ir \" f WAN T A\" C LAS S I FfED\" A D \"  1 Please run the following Ad in the Classified Section of the  , Wednesday Vernal ExpressThrifty Shopper. 20$ per word, $4.00  I minimum, (5$ per word extra for Bold Type) print or write plainly.  ! DEADLINE IS MONDAY AT 5:00 P.M.  , Ad Copy:  il 51 31 J  5 6 . 8  9 10 11 12  13 14 IS 16  17 16 19 00 20  4 21 4 5 4J0 23 4!) 24  500 25 g20 26 540 27 5o 28  5 29 goo 30 g20 31 g 32  Ad To Run How Many Times:  Name:  Address:  Bank Card Number:  up anu ividll iu.  1 u. W rci(B  .0.  c  WOLFF TANNING BEDS.  Tan at home. Buy direct &  save! Commercialhome  units from $199. Low  monthly payments. FREE  color catalog. Call today,  1-800-842-1310.  BEEF FOR your locker.  Ranch raised no chemical  feed additives, half, whole  or quarter, 789-2305.  FOR SALE: House full of  furniture, washer, dryer,  wood stove, TVs. 789-3149  789-3149 evenings.  STEEL PIPE 4\" posts 6'-$7.00ea.,  6'-$7.00ea., 7'-$8.00ea.. 8'-$9.00ea.  8'-$9.00ea. Steel pipe for  rails, 4\"x21' lengths, $0.76  ft. Other sizes available,  call for free stockprice list  1-800-947-0249. Metal-mart  Metal-mart 1200 E. 100 S. Lehi.  Delivery available.  HARDLY USED name  brand lawn mowers at  used prices. Self-propelled,  mulching, bagging.  See at Gray Enterprises  1758 E.Hwy 40.  REPOSSESSED GRAND  and upright pianos.  Assume small monthly  payments. See locally 1-  800- 231-0868.  SLIDE IN metal horse rack  for longbed truck $150  see at Mid-Town Auto 295  W. Main or call 789-3223.  GENERATORS: 110220  60 cycle 1.5-5 KW, $225-$495.  $225-$495. TANKS: 600 gal.  aluminum liquid storage  $395. MILITARY TRAILERS  TRAIL-ERS available. Call Milt 1-  801- 743-6907, Fillmore.  FOR SALE Ford 1300  tractor with 4 wheel drive  and front end loader,  some attachments. Llamas,  Lla-mas, good blood lines, 1  mala 6 female, 2 due in  summer. Will consider  trade for good quality  camp trailer. Call 970-675-  2589,  CONSIGNMENT AUCTION  AUC-TION Saturday, April 19  10 a.m. 2368 S. 1500 E.  Vemal. UT. 1990 Bronze  Ranger, 1979 5th Wheal  camper, pips threader,  wood splitter, table saw,  nail gun, radial arm saw,  roof cement aluminum  roof coating, shingles, row  bar radiant healer, trans  mission jack, shop press,  hand grinder, grinder  toots, boxes of hardware,  various new doom, fireplace,  fire-place, low pressure oilfield  pumps, high pressure  hosa, electric boxes, and  much, much mora. For  more Information or to  consign can 2J Auction  eot-;ea-7g.  WOOO BURNING Ealh  Stove M50. Cal 781'  1013.  will rparh over  ... Visa MasterCard  Express wm SHOm  Box 1000, Vernal. Utah 84078  HOME LOANS, refinance  loans, home equity loans,  All kinds of commercial  loans from $20,000 to  $5,000,000. Roger Hack-  ing 789-2375.  2020 WITHOUT GLASSES!  GLASS-ES! Safe, rapid, non-surgical,  permanent restoration  6-8 weeks. Airline pilot  developed. Doctor  approved. Free Information  Informa-tion by mail: (800)422-7320,  (800)422-7320, ext 238, (406)961-5570,  (406)961-5570, fax (406)961-5577  SATISFAC-TION  SATISFAC-TION GUARANTEED.  $30 MASSAGEI Incredible  Incredi-ble one hour relaxation  treatment! Call for appointment  appoint-ment Life-Touch Therapies  Thera-pies and Massage, Karen  Brown, L.M.T. 781-2055,  781-2306. $3011  STEEL \"HI-RIB\" sheets  for building sheds, bams,  etc.. Low prices, great  stock galvanized and colored.  col-ored. Call for stockprice  list. Palmers Metalmart,  1200 E. 100 S. Lehl 1-800-947-0249.  STEEL PIPE 4\" posts 6'-$7.00ea.,  6'-$7.00ea., 7-$8.00ea.. 8'-$9.00ea.  8'-$9.00ea. Steel pipe lor  rails, 4\"x21' lengths, $0.76  ft. Other sizes available,  call for free stockprice list  1-800-947-0249. Metalmart  Metal-mart 1200 E. 100 S. Lehl.  Delivery available.  POLYSTEEL 'Forms for  concrete the forma  remain In place providing  super Insulation and  stronger walls. Meets all  building codes. Polysteal  Distributing 1-800-760-7659,  801 896-0236.  STEEL BUILDINGS, new.  40x60x14 was $15,250  balance $8,940;  50x100x16 waa $26,200  balance $17,631;  60x200x16 wss $62,500  balance $39,672 1-800-406-5128.  Notices  TEE  SWEDISH STUDENT and  other Scandinavian, Euro  pean, South American,  Asian, Russian exchange  Students arriving August.  Become host volunteer  femiiyAJSE. CaH 1-800-  Personals  ABORTION? WMYf Corv  ? V.'amt  secure loving LDShome  evaHa&ie for  txy Pfea tl enomoy  8t 1 6006064411. A60 7.  Dates of Issues:  Phone:  Signature  Expiration Date:  Phone: 789-351 1 Fax 789 -  WHEREFORE NOW let  the fear of the Lord be  upon you; take heed and  16 for there Is no iniqul-  ty with the Lord our God,  nor respect of persons,  nor taking of aifts. 2  Chronicles 19:7.  DIABETICS! (using  insulin) Did you know  medicare (or Insurance)  covers most supplies?  Save money - call 1-800-748-1662  Liberty Medical -Satisfaction  guaranteed  No H.M.O. members.  Mention AD-AAOO.  EMBARK ON a cultural  adventure. Be a host family  fami-ly for an exchange student!  stu-dent! High school students  from over 45 countries  need families like yours for  the 9798 school year. Call  1-800-SIBLING to request  information, or visit the  AISE web site at  http:www.sibllng.org,  BE ASSURED. This childless,  child-less, loving couple will be  the best possible parents.  Your baby will have a lifetime  life-time of love, happiness,  honesty and security.  Legal expenses paid.  Please call Diane and  Stephen 1-800-890-1144.  TENT RENTALS. Special  events, weddings, business  busi-ness promotions. Larry  and Nancy Bartlett 789-7046  789-7046 TENTS R US.  CORRECTION IN book  \"One Hundred Yeara of  Browns Park and Diamond  Mountain on page 124 It  should read Sam Bennlon  has daughter, Wanda,  who married Tad 'Slatts  Watklna. My mistake, Sor-ryt  Sor-ryt Dick DeJoumette.  Real  Estate  2S  FOR SALE trailer lot  $11,000. Water connection,  connec-tion, septic tank, electrical  power. Ready to move on.  Cal after 6 p m, 769-61 29.  IDAHO RANCH BARGAIN.  BAR-GAIN. 40 acres-tZS.OOO.  Snake and Salmon Rivera.  Spectacular ranch  acreage wJ0 mae views  and tons of wildlife. Private  location on end of road  wmniona of acres of pub  Be lands neaoy. Enjoy  excellent year round recreation.  recre-ation. Surveyed, warranty  deed, excellent financing.  Cal now m 639-2501.  LAND FOR SALI 14 9  acres $60,000 located at  1178 South . Vemal Ave.  For Info cl 616 651-4654  OfM1-762S07.  VIEW LOT on Yeeow H  fot S4'S. Cal 7B9 6739  VERNAL 20 acres for eee  ft Or p1 tnmvWkSng  pmpetTy, water pgfit  asceeeni looseon Cal  BOUM &Wfl W 801 24-  5439.  4  8690  VIEWS GALOREI 40-AC  40-AC $49,900.'  LakoMtnsValley Awesome,  Awe-some, top-of-the-world,  360 degree views from  this spectacular Montana  acreage! Back to BLM  wmule deer everywhere!  Close to Hauser Lake and  just 15 minutes to Helena.  Private, secluded, on end  of cul-de-sac wug utilities  and food access. Excellent  financing. Won't last, call  now 406-227-5901.  PRICED FOR quick sale  $3,500 slightly less than  half acre lot. Located at  4869 South Vemal Ave.  801-226-3748.  1 1  BUILD NOWI DeGeorge  Home Alliance Sales.  Materials and offers interest  inter-est free, no payment,  100 construction loans.  90 land loans. Ken  Plonk 970-244-8429 or  800-798-3855.  CANT AFFORD THE  HOME YOU NEED? Get  MORE home for your  money with minimal down-payment.  down-payment. Complete  financing If qualified.  DeGeorge Home Alliance.  1-800-3432884.  BUILD YOUR DREAM  HOME. The Landvest  Owner-Involved Building  program offers below market  mar-ket construction financing  and no interest and no  payment for six months on  Landvest materials,  approved labor and site  preparation. Call toll free  1-888-HOME-005 ext. 007  . for more information,  AIR VILLAGE HILLS  home for sale by owner on  2 lots with extra acreage  available. 4 bedrooms, 2  34 baths on 2 levels with  walk out deck and patio,  gas heat double garage.  781-0066,  BIO CORNER lot sharp 3  bedroom 1 bath, fresh  paJnL gas available.  $56,000 647 E. 1500 S.  puverflnance 769 6934  JUST FINISHEOI Priced  to sell! New custom home  by Jerry larsen Construe  ton. In Pheasant Aces  SubdMsion m Meeser.  $109,900. See Inside to  appreciate 789-0246,  THREE BEDROOM. 1  befh home m NepN. Fen  y room, fireplace, large  det, fenced yard. See at  176 West 400 South,  NepH $110,000. Cal 601.  623 1716.,  MCE OLDER home lot  sale. Three bedrooms 8  befh country Svrg on .68  of en eee l?o.0OO Cel  1-600 368 5597 ext 8953  or hftp;ww comnd  hom'uVowne(Crifl( 162 h  tml.  I", "parent": 22653316, "version": 1739890026713448448}, {"id": 22653327, "paper": "Vernal Express", "type": "page", "date": "1997-04-16T00:00:00Z", "year": "1997", "month": "April", "day": "16", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/31/a6/31a6861687b4c9fd1e9266b168e1a347ff23cc21.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/46/64/466414a47120bc58ad7b16b90e7aa38231b60753.pdf", "page": 11, "ocr": "Y  A  Vernal Express Wednesday, April 1 6, 1997 11  1981 14X70 mobile home.  Fridge, range, dishwasher,  washer, dryer. Three bedroom,  bed-room, two bath 789-4302  $10,900.  FOR SALE or rent. One  bedroom trailer. Call  Shawn or Linda 781-2661 .  DAY CARE Young People's  Peo-ple's Daycare, 495 South  600 West 11 years experience.  expe-rience. Director with master's  mas-ter's degree. Open Monday  Mon-day thru Saturday, ages 2  thru 12. Snacks and meals  included. Enroll now for  Spring and consider your  needs for Summer. 789-7231.  789-7231. Stop by and look us  over.  FIRST IMPRESSIONS  has openings in our new  daycare. Two- to 11 -year-olds.  Open 7:30 a.m. to  6:15 p.m. Monday thru Friday.  Fri-day. State licensed facility  789-3882, 650 North Vernal  Ver-nal Ave.  DAYCARE 35YEARS  experience. CPR and First  I tg-lilllSffQ I Aid. Excellent references.  Utah licensed,  mealssnacks, learning  time, lots of love. Call 789-1250.  KM  ATTENTION: NOTE  HOLDERS. Are you collecting  col-lecting on a mortgage or  note?? We pay cash for  mortgages and trust  deeds. For free quote, call  800-988-6531.  DUMP TRUCK SERVICE  by Backhoe Supremo.  Hauling by the hour or per  load. Delivered. Products  available: reject sand,  drain rock, road base, 4\"  minus rock and earth.  Ripp Rapp rock. Foston  Chivers. 789-1620  ALL STEEL BUILDINGS.  Arch building 40x30  $2,995. 40x50 $4,995,  50x100 $9,650. Straight-wall  Straight-wall buildings also avail-able.  avail-able. 1-800-973-3366.  STEEL BUILDINGS sale:  30x40x10, $4,527;  40x60x14, $8,257;  50x75x14, $11,866;  50x100x16, $15,949;  60x100x16, $18,614. Mini-storage  Mini-storage buildings, 30x160,  32 units, $13,944. Free  brochures. Sentinel Buildings.  Build-ings. 800-327-0790,  extension 79.  MUST SELL IMMEDIATELY,  IMMEDIATE-LY, 2 arch style building  25x50 and 50x100 1-800-330  Services  BONNIE'S DAYCARE.  Open 6-midnight, Mon.-Sat.  Mon.-Sat. We have preschool,  playschool, infants and  after-school programs  available. CDA certified  teachers. 789-6028, 370  W. 200 S. Drop-ins welcome.  CHILD CARE in my home  in Vernal. Any hours Monday  Mon-day through Saturday.  References and experi-ence.  experi-ence. Call 781-2654.  CHILD CARE in your  home. References and  tons of experience. Anytime.  Any-time. Call 781-3095 ask  for Judy.  CAR STEREO INSTALLATION.  INSTAL-LATION. Professional  work, 15 years experience,  experi-ence, certified. Custom  installations on all makes.  Vernal H.E.C., 145 West  Main, 789-1997.  WWW DEVELOPMENT  and consulting. Put your  message on the Internet:  including online catalogues,  cata-logues, indexes, mail service,  ser-vice, home pages. Contact  Steve at 789-3511. Rea-sonable  Rea-sonable prices.  KEYBOARDIST will customize  cus-tomize music for weddings,  wed-dings, receptions office  parties, funerals, etc. From  simple piano bar to full  orchestration 789-3713.  HEADSTART-FREE  PRESCHOOL and day  care to eligible families in  designated areas within  Uintah County. Child must  be 3 or 4 years old by  September 1st. Over  income children with disability  dis-ability or special need given  giv-en special eligibility consideration.  con-sideration. For out lying  areas, upper Maeser,  Jensen and Dry Fork  areas our Home Base Program  Pro-gram may be an option for  you. Day care (7:30a.m. to  5:30) available to parent  working or attending  school full time. Many services  ser-vices are provided including  includ-ing lunch, snacks, transportation,  trans-portation, dental, vision,  hearing and physical  screening. For more information  infor-mation please call Kaye at  789-4666.  $DEBT CONSOLIDATION.  CONSOLIDA-TION. Cut monthly payments  pay-ments up to 30-50.  Reduce interest. Stop collection  col-lection calls. Avoid  bankruptcy. Free confidential  confiden-tial help, NCCS non-profit,  licensed, bonded. 1-800-  Vehicles  1977 KIT trailer. 19 feet  long, self-contained, 870  North 2500 West.  Evenings best, 789-7110.  1984 23' Resort camper  trailer, self-contained with  bunks, sleeps up to 8. 2  spare tiresupport jacks,  good condition, $6,000.  Call 789-0469.  1980 FORD Bronco, new  Flowmaster exhaust system,  sys-tem, 302 V8, new carpet,  call James for details after  Wanted  EXCLUSIVE HUNTING  rights for Utah ranch.  Ranch selected must have  ample game with trophy  deer potential, elk population  popula-tion a plus. Private family  interest. Eight hunters  maximum. No organizational  organiza-tional hassles. Top dollar  paid. Call or fax details to  801-278-1167.  WANTED 1983 Olds  Omega, Buick Skylark or  Pontiac Sunbird 2.5L 4  cylinder, running or not  789-6971  f What to U  when you  need a new  employee...  In 1859, Edwin L. Drake drilled  the first oil well in Titusville, PA,  opening up the Pennsylvania oil  field and starting the large-scale  exploitation of petroleum.  ( nun )  FOR LOADS OF  RESULTS  CALL:  wVERMAL  Express!  CLASSIFIEDS  789-3511  Davis (ftjh Pharmacy  HOMETOWN raSfctD  Registered Pharmacist  on duty at all times  Open 7 days a week  to serve you!  Vernal Pharmacists:  Tom & Glade 789-7011  Roosevelt Pharmacists:  Jeff & Cory 722-2255  U-- 'FLOWERS9 1.  in-  rTTX  -FLOWERS'  In Vernal or anv  plao In the World!  1-800-35 1-9 102 .  or UI7-214I if.l  .14 US  Builders  Residential &  Commercial Construction  & Repair Service  We do it all... Give us a call..  Reasonable Rates  call Barry Barboza 789-2138  Licensed A Insured  Subsidized Housing  for the Low Income  Elderly and Disabled  (Elderly must be 62 years of Age)  1 bedroom Apartments  EQUAL  OPPORTUNITY  HOUSINCfsTt  TOD 2S&M8J COMPLEX  Sharon Skerl 789-2788  I Mt. Olympus Waters  789-2875  Hot Soups  Hot Chocolate  E Complete Coffee Service  Fresh, clean tasting  I mountain spring water  Serving Home  or Office  tummiiinnmnntinmn  Cutiotn B ik Knot Dump Truck toMer  Serine Pitchinj Tcnichtng Cxavation  Swf I wattf Ln mutilation Spi  Ttnkf & Dn FK) CM, Power, Pnont  Ixwt Snow Putting A Rtmov  UctnttO. Bond. Innjrrd  Fotton L Chivers  CtflulM 7QQ 0010  FOR ALL  YOUR  PROPANE  NEEDS  With ytant of xprlnc and  knowltdg In th propane butlnett.  Come by and see our complete line of  heaters, torches and propane bottles.  ?OPMZ 789-3198  SAM'S  BODY SHOP  nry.X'Free  aw m. - Am  Y7  y  Auto Glass1  Installation  Rock Chip Repair  Frame Straiehtenintf  a B  Estimates  Insurance Claims Welcome  789-6718  1732 W. 1000 S.  f tOPlt Mil! Vnl  l:Jttia:flMlafiia:l  EBTHtMiUUiillillJiipJ iH  MAIL MRU  2100 Wett JO0O South 1104 ! Mwy 40  Vnl, UtaA  AS111EY VAUEY  Udan'  ROOFS 'SIDING  RAINGUTTERS  AWNINGS  'Free Estimates\" .  Licensed 'insured  (Mf) (101)  714113 Bft$-i1ia  lj.620 N. Vtmri Aw. Vtmal  ft f  mi  LJ,  av aw \"immmmmmm mm At  1  MARTIN  C 789-4113 o  1-888-789-4113  I 14T0 w vwm a Vml  FUN A EXCITING fund raising  opportunity selling Fireworks.  Make MONEY in short period of time  100 consignment.  No Out Of pocket MONEY.  Must be 18 years or older to apply.  RAISE MONEY FOR YOUR GROUP BY  RUNNING A FIREWORKS STAND.  Do not miss out.  PRIME locations a'e going fast.  CALL TODAY! PyfOflyne American  BEEHIVE FIREWORKS  80126218S1  General  Building  Contractor  rum, i j  rnrr  L Mil WAY A  For  All  Your  Propane  Needs  24 Hour On Call Service  & Sevte Fire tf\"gy'sN  Competltlvt Pricei  789-8883  l.fTTi:rrz?TtYrrrtr  bl'tXIAt.lZISO IS WWKjAJ.V  & FltiEKCLASS HATHTIVS.  &.VK.S. S-IIOWEKS.  CEHASIIC TILE  CKwotCO'P NtBhnjomC'i'0  fpn 5 &uirit tHwjont.ai (  Convnoft. Cniy Vx)J  Custom Mstcn Any C(W)f Cc-p'  I \" n tl, t,rf,rft  till UTIKUTtl  f D ATH JS, C R EST,  W & 789-1898  CONCRETE  Jeff Shepherd  1 t9?1?i2-ioyyM  ronSOTrO'S r.rwnpn  PtK)3 WB n OUt1t  D  \"Ghr ut caH, wiOoft all!'  789-2801 cff.790-5020  U30 W. 72S t. Vam(  OperaloftTtchntcian  89\"ef 0B'i'n( Co . a m h  a'pn't 6l\"''t iMwlt'y, II ek.  S WI8J,H 9oph,lt f.m ,,  . 1 t l -'O ut jn?  tMto'nlti9 9jr7  \"Imagine This...\"  2 Acres 3 Bedrooms 2 Baths 'Formal Dining Room  Family Room 'Wood Burning Stove 3 Storage Sheds  'Covered Patio FHA Approved  ' :i - f t..  Newly refurbished home on 2 acres of land in Maeser area.  Call Dart Realty I  more Information  Call Dart Realty for TOO 4 AOr  ( nSS  Of or  , 1 1 1 r  ' ! I 1 1 1 1 1  i i'ir fi  HUH Mllll!\"ll III';;!!  I nil  One Of A Kind  2 story home with 3 bedrooms, family room, gas heat, white picket  iciite ana mucn, mucn more.  For more information call:  that a' \"v  Sales  Assoc.  ft VIRGINIA BIRCH  789-1482 7894239  Tiree Trimming  Removal  Free Quotes  Kim Harding  (801) 646-3089  SATISFACTION  ABSOLUTELY  GUARANTEED  1997 JTPA SUMMER  YOUTH PROGRAM  4.  X7  n-.p k. -  h AT  Tht JTPA Summf YOutn EmpiOjrfrent and T'ainm Pftigm it a tpdo'sii) fur)a  prog'sm that i n3miniVefa By (n Ptimtf industry Cflynta,  To t tll)W fw tha profram you mutt mtt on of tho followtng crttatia:  1. BE AGES AND BE ECONOMICALLY DISADVANTAGED.  2. BE A FOSTER CHILD.  3. BE AN INDIVIDUAL WiTm A DISABILITY.  Youth Accepted into the program Milt wtii apDronmateiy 32 \"OW  pef for 8 eeH OVig the ijmfnef, Thfy e'e pad te 'e1?'ai  minimum wage of $4.75 pr houf.  MOW TO APPLY  APPLICATIONS WILL BE ACCEPTED f&OM AP&il 8!h TO May I6tn  BETWEEN 100 p m. \"d 4 30 p \"i.  F0 MOPE lSr0PMT:ON tO'.T.Kt  VERNAL JOB SERVICE  1050 W. MAfirET DPivl  7831211", "parent": 22653316, "version": 1739886949152325634}, {"id": 22653328, "paper": "Vernal Express", "type": "page", "date": "1997-04-16T00:00:00Z", "year": "1997", "month": "April", "day": "16", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/9e/36/9e36ffd01795445b4bd92b9ce207948a4473c51d.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/40/a5/40a5eed643fd676eae76333d2e540a34638f2dc3.pdf", "page": 12, "ocr": "12 Vernal Express Wednesday, Aprt 16, 1997  Public lands and  multiple use  \"The question of what a beloved  country is to be used for, quickly  becomes inseparable from the questions  ques-tions of who is to use it or who is to  prescribe its uses, and what will be  the ways of using it. It is not until  we speak of 'a beloved country'  particular country, particularly  loved that the question about  ways of use will arise. It arises because,  be-cause, loving our country, we see  where we are, and we see that present  pre-sent ways of use are not adequate.  They are not adequate because such  local cultures and economies as we  once had have been stunted or destroyed.  de-stroyed. As a nation, we have attempted  at-tempted to substitute the concepts  of \"land use,\" \"agribusiness,\" \"development,\"  \"de-velopment,\" and the like for the  culture of stewardship and husbandry.  hus-bandry. The problem is that land users are  using people, places and things that  cannot be well used without affection.  affec-tion. Wendell Berry, farmer, essayist,  es-sayist, poet in \"An argument for  Diversity,\" in the 1990 publication  \"What Are People For?\"  The ideal of multiple use on the  public domain is often depicted by  artists' renditions on BLM and  Forest Service pamphlets, where a  host of unrelated activities are  stylistically telescoped onto a single  sin-gle printed page. In the narrow confines  con-fines of a brochure, cattle graze by  an oil rig where the deer and antelope  ante-lope play. Hunters stalk their game  hard by a timbering operation,  while a strip mine reposes just over  hill from a creek where a fly fisherman  fisher-man is landing a fat trout. Hikers  and horsemen share the same cozy  scene with off-road vehicle riders.  Everything seems to be in total harmony.  har-mony. Artistically, it's a lot easier to  cram all these activities onto a single  sin-gle page of a brochure than it is to  manage all of these activities on the  same area of the public lands. Out  on our public lands, we know that  this idealized concept of multiple  use sometimes works, but often  doesn't. Why?  It's because the values and expectations  expec-tations of stakeholders and \"users\"  of the public lands are as varied and  complex as the land itself. We love  and value our public lands, but often  of-ten for quite different reasons.  So what is the \"true\" meaning of  the term \"multiple use?\"  Since the public lands are managed  man-aged according to public laws and  statutes, perhaps it would be well to  see what the lav; says in this regard.  The term and the concept perhaps  originated with the Muliiplc-Use  Sustained-Yield Act of 1960. This  law established that timber was no  longer the dominant use of the national  na-tional forests, and gave forest managers  man-agers broad discretion to manage  the forest in a manner that would  preserve the relative value of other  important uses. Since then, the term  \"multiple use\" has been used in  hundreds of government tracts,  pamphlets, management plans and  public meetings. Somehow a lot of  folks got the idea that it means that  all areas of public land should be  open to all uses. But (his was never  the intentions of Congress.  In 1976 the Federal Land Policy  and Management Act was passed in  It you would like to adopt this  twelve week-old black and tan,  female, ihepherrj-mix dog or  any other ot a variety of pete,  call the Uintah County Animal  Shelter at 789-5601. Mon.-Frl 9  a.m. to S p.m.; Saturday until  noon.  notes on the land ethic  by the Uintah Mountain-Club  an attempt to balance all the competing  com-peting uses on our public lands.  The Act was not built in haste.  After five years of exhaustive  scholarship and six years of drafting,  draft-ing, redrafting and debate, this  landmark legislation finally  emerged as Public Law 94-579.  The Act states that \"management  be on the basis of multiple use and  sustained yield\" and that \"the public  pub-lic lands be managed in a manner  that will protect the quality of scientific,  sci-entific, scenic, historical, ecological,  ecologi-cal, environmental, air and atmospheric,  atmo-spheric, eater resource, and archeo-logical  archeo-logical values, that, where appropriate,  appro-priate, will preserve and protect  certain public lands in their natural  condition; that will provide food  and habitat for fish and wildlife and  domestic animals; and that will provide  pro-vide for outdoor recreation and human  hu-man occupancy and use.\"  Guidelines for implementation of  the Act include a definition of  Multiple Use:  \"(T)he management of public  lands and their various resource  values so that they are utilized in  the combination that will best meet  the present and future needs of the  American people;  making the most judicious use  of the land for some or all of these  resources...  the use of some lands for less  than all the resources;  a combination of balanced and  diverse resource uses that takes into  account the long term needs of future  fu-ture generations for renewable and  nonrenewable resources, including,  but not limited to, recreation, range,  timber, minerals, watershed,  wildlife and fish, and natural,  scenic, scientific and historical values;  val-ues; and harmonious and coordinate  management of the various resources  re-sources without- permanent impairment  impair-ment of the productivity of the  lands and the quality of the  environment with consideration being  be-ing given to their relative values of  the resources and not necessarily to  the combination of uses that will  give the greatest economic return or  the greatest unit output.\"  The intent is clear: different resource  re-source values must be balanced and  managed to ensure that one use  does not degrade or destroy another.  This means that some uses of the  public lands will be incompatible. at  certain times and in certain places.  There will be times when one use  must be excluded to protect another  use. Just as a landowner plans the  uses to which he will put his quarter-section,  our land will have many  uses, but not all uses on every acre.  Choices must be made. And the  public lands need not be managed  for their greatest \"practical\" or economic  eco-nomic value.  This is real multiple use.  II at  L  Workshop  Parenting Skills  Gardening Tips  Home Improvement  Fitness for All Ages  Marriage Enrichment  Outdoor Recreation  Evening Session for adults & families 6:30 pm-9 pm at Union High School  SpeakerJoin Paul Murphy-USU State 4H Specialist, 44 Family Fun & Recreation\"  Workshops 4- Games Activities -i- Native American Dancing  Fee-$10 total for Day & Evening Sessions Fee45 (families invited)-Evening Session only  Prereglster by April 17th at USU Extension Offices In Duchesne or Uintah Counties  For more information call USU Extension at 1-800448-2107 ext. 150 or WWW.UWIN.comgovconf  Republican party  releases survey  Improvements to the 8th District  Court building, Uintah Care Center  and library were all addressed in the  6th Annual Uintah County  Republican Party Survey.  Of the 173 surveys sent out, 102  delegates responded to the 11 -question  survey. Questions concerning  the building of a new 8th District  Court Building were:  The State of Utah plans to build a  new Court Building located in  Vernal. The State of Utah will either  build the building or let the county  build the structure and lease it for a  20-years period from the county.  Which entity should purse building  the Court Building. Fifty-two percent  per-cent said they wanted the State of  Utah to build the new court building  and 44 percent said they wanted  Uintah County.  If Uintah County builds the complex,  com-plex, it is proposed that a new jail  facility be constructed in conjunction  conjunc-tion with the court complex. The  present jail is 104 beds. The state  currently pays $35 plus medical expenses  ex-penses and transportation per inmate  in-mate per day to house inmates.  Current costs are $28 per prisoner.  This year the county will subsidize  the jail $547,774. Should the county  incorporate a new jail complex if  the county decides to build the facility?  facil-ity? In response to the question, 46  percent said \"yes,\" 49 percent said  \"no\" and three respondents said  they need more information.  Currently the Uintah Care Center  is being subsidized $16,800  ($366,800 in property taxes and  $50,000 general funds) per year by  Uintah County, the current facility  is too small to be economically viable.  vi-able. If a 200 bed facility were built,  county officials feel it would be  able to sustain itself, but Republican  delegates are not as confident. In response  re-sponse to the question, should  Uintah County build a new care  Center facility, 51 percent said \"no,\"  49 percent said \"yes,\" two suggested  suggest-ed selling it and four were for privatizing  priva-tizing it.  Ninety-three percent of the delegates  dele-gates said they had children who  use the Uintah County Library.  Seventy-five percent said they  thought the library was adequate for  their needs. When asked if they  would be willing to pay for an expansion  ex-pansion of the library, 56 percent  said \"yes,\" 44 percent said \"no\" and  Utah milk  production up  Utah milk production during the  first quarter of 1997 totaled 373  million pounds, up 4 percent from  the same quarter of 1996, according  to the Utah Agricultural Statistics  Service. The number of milk cows  during the January-March quarter  averaged 92,000 head, 2,000 head  more than the same quarter of 1996.  Milk per cow was 4,054 pounds, up  76 pounds from the previous year.  Grain and other concentrates fed  to milk cows on April 1, 1997 averaged  aver-aged 17.5 pounds per cow, 0.4  pounds more than April 1, 1996.  The value per hundredweight of  grain and concentrates fed to cows  on April 1 averaged $8.45, down 75  cents from April 1, 1996.  Don't miss it.. .Coming soon. ..it's the  Governor's Regional Family Conference  \"Expand your Horizons\"  Wednesday, April 23, 1997 - 9 am-4 pm  I Itah Qtata I lnisrcitt  Sponsored by G.I.F.T.-Governor's Initiative on Families Today, Utah Governor's Commission for Women  & Families and Utah State University Extension in Duchesne & Uintah Counties  Featured Speaker - Jacalyn S. Leavitt - Utah's First  Keynote Speaker - Dr. Wally Goddard- Covey Leadership  \"Seven Habits of Highly Effective Families\"  topics:  two said they needed more information.  informa-tion. Areas which the delegates said  need expansion were the facility,  25; services 28; better computer, 7;  more books, 7 and Internet 6.  Last year the Uintah County  Economic Development  Department was dissolved by  Uintah County Commissioners.  Delegates were asked if the department  depart-ment should be reestablished or  should the county contract with the  Vernal Area Chamber of Commerce  to promote economic development.  Thirty-two percent said Uintah  County and 62 percent said to contract  con-tract with the Chamber.  The role Vernal City, Naples City,  Ballard City should have with economic  eco-nomic development is that each  should pay something, according to  the majority, 27 responses. Other  roles of the entities were to work together,  to-gether, 26; all should have input, 16  said there should be a committee or  board to make decisions.  A feasibility study indicates the  present airport is adequate for approximately  ap-proximately the next 20 years.  Should Uintah County pursue building  build-ing a new airport on bench hill beyond  be-yond the citycounty landfill?  Thirty-two percent said \"yes\" and  68 percent said \"no.\"  Fifty-four percent of the respondents  respon-dents said that the Uintah County  zoning ordinances need improvements.  improve-ments. Two commented that the  current zoning laws aren't enforced.  Forty percent said the present zoning  zon-ing ordinances are adequate as they  are.  Areas where Uintah County  should be focusing their resources  in order of importance are: road  construction, economic development,  develop-ment, new care center facility, library  li-brary expansion, state county buildingjail  build-ingjail complex and airport move.  A SINCERE THANKS  TO ALL THE CUSTOMERS AND EMPLOYEES WHO HAVE MADE  OUR FIRST YEAR IN THE UINTAH BASIN SO SUCCESSFUL!  As our customers know, SOS Staffing Services is in the business of solving staffing needs. When  you use our temporary employees, we take care of all these costs for you:  All employee withholdings  All quarterly payroll tax reports  All Workers' Comp. insurance and claims  Being relieved of this paperwork can be invaluable  SOS has many employees available who are QUALIFIED and  with your short- or long-term needs in the following areas:  SecretarialReceptionist  Word Processing  Data Entry  SOS Staffing Services will enable your company to maintain your full-time staff at an optimum  level. You can utilize our services to help you through the stress of special projects, overload work  conditions, illnesses, emergencies, etc. Our services are fully guaranteed.  STAFFING SERVICES.  Hantar OQ7 Caef nrtnnn Dn(mrtlfl  Reading Readiness  Careers at Any Age  Foods & Nutrition  WWW. Family. Internet  Character Education  Dealing with Grief  J in  Front to back: Kelly trains the two black border colies for the Search  and Rescue, Trac and Sweep; Shari Rose with dog Storm; Bill with  Autumn, and Tim Sweeney with his dog Bear.  Animal Care group  presents program  Jacque Hobbs of The Animal  Care Association, presented a program  pro-gram for all third and fourth grade  students in Uintah County April 14.  The program emphasized the importance  im-portance of having pets spayed and  neutered. It stressed the importance  of treating animals with kindness  and to make sure they live in a  clean, dry place and have food and  fresh water.  A booklet was given to the students  stu-dents about a dog named Hope, her  little puppies and what happened to  them. Spaces were left in the booklet  book-let at the end of the story for the  students to fill out and finish the  story. The contest winners won cash  prizes.  First place, $20; second place,  $15; third place, $10 and 50 honorable  honor-able mentions.  The program included 2 small  dogs that were trained rescue dogs  for Uintah County Search and  Rescue. The larger dog, Trac, is  deaf so sign language was used for  him. The smaller dog, Sweep,  Bookkeeping  Accounts Payable & Receivable  SalesCustomer Service  We look forward to helping you  work out a plan for your specific needs.  Please call 789-9200.  Rethink Anger  Traditions and Culture  Basin History  Families in Business  Children's Literature  Children's Health Issues  demonstrated how to find someone  that was lost.  All dogs participating were pupils  of Kelly Postbriand's Pet  Obedience School.  Tim Sweeney brought a large  blond labrador that he raised from a  puppy. \"I found Brar in a trash can  when he was about 24 hours old,\"  he explained. \"He thinks I'm his  mother because I bottle fed him for  the first weeks of his life.\"  Sweeney emphasized the importance  impor-tance of adopting a pet from the  pound.  A 100 pound, giant, black  Schnauzer, Storm, showed the audience  audi-ence how obedience training  worked. Storm is owned by Shari  Rose.  Camille Scarle brought her pet  tarantula, Ange, who is 10 years  old.  \"The program was informative  and entertaining, as well as educational  educa-tional for the schools in the county,\"  said Hobbs.  All unemployment taxes and claims  ' The employer's portion of FICA and Medicare  All monthlyquarterly payroll tax deposits  to many businesses.  WILLING to help your business  Skilled and Unskilled Labor  Hospitality  And many, many more  STAFFING SERVICES.  Lady  Institute  4", "parent": 22653316, "version": 1739887067324743680}, {"id": 22653329, "paper": "Vernal Express", "type": "page", "date": "1997-04-16T00:00:00Z", "year": "1997", "month": "April", "day": "16", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/99/48/994879c0328d9320e5a303a8074c4c283856ddb1.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/52/03/52038184dd8aafe2d506900d02f07ba1a16ef462.pdf", "page": 13, "ocr": "'Come to the House of  the Lord' plays to April 19  Vernal Express Wednesday, April 16, 1997 13  \"With three performances down  and six to go, cast members and attendees  at-tendees alike agree that 'Come to  the House of the Lord' is not only  inspiring, but is also very powerful,\"  power-ful,\" said Mary Neilson, co-director.  \"The talented performers have exercised  ex-ercised the maximum of their abilities  abili-ties and then some. They have really  real-ly poured all of their hearts into it.\"  The musical involves a cast of  more than 2(K) volunteers from  throughout the Basin.  \"One of the main purposes of this  production was to attempt to answer  an-swer questions for everyone in the  community about why Mormons  build temples and their purpose.\"  Neilson said.  According to Steven Kapp Perry,  music writer and lyricist for the  play, \"When President Howard W.  Hunter said, 'Let us be a. ...temple-loving  ...temple-loving people.' it touched a responsive  respon-sive chord. Brad Wilcox and I responded  re-sponded to that call by creating this  presentation, which celebrates in a  reverent way the joys of the temple.\"  tem-ple.\" Brad Wilcox wrote the original  script for the musical which was  adapted, with permission, by  Douglas Christensen, co-director, to  have a more localized meaning and  appeal for the new Vernal Temple.  Perry is a full-time songwriter and  playwright living in Cedar Hills,  Utah. He is the son of Douglas and  songwriter, Janice Kapp Perry.  While attending Brigham Young  University, Perry was a performer  and assistant director with the BYU  Young Ambassadors. He has released  re-leased eight albums of original music  mu-sic on several labels.  Perry is best known for his  recordings, \"From Cumorah's Hill,\"  \"Come to the House of the Lord\"  and \"Polly, a One-woman Musical.\"  His most recent project is a collaborative  collabo-rative work with James Arrington  and Marvin Payne called \"The Trail  of Dreams.\" This musical pre  miered at Utah Valley State College  in January and will be performed at  BYU May 1 and 2 and again in  August.  \"I feel that the visuals displayed  during this production provide a  wonderful atmosphere,\" said  Christensen.  The visuals by Scot Facer Proctor  depict the history of the Lord's temples  tem-ples from the beginning of time in  both Palestine and meso-American  until our present day. Proctor and  his wife, Maureen, are the former  editors of \"This People\" magazine  and produced the \"Source of the  Light,\" \"Light from the Dust\" and  \"Witness of the Light\" photographic  photograph-ic trilogy.  The musical runs through  Saturday, April 19 each night at 7  p.m. with a noon matinee on the  19th at the Vernal Middle School  auditorium. Tickets are free.  \"Although most of the tickets  around town are gone,\" said  Neilson, \"some tickets are still  available through church leaders as  well as at the door for each performance  perfor-mance where 200 to 300 extra seats  have been made available for each  night.\"  \"Come to the House of the Lord\"  is sponsored by the Vernal Maeser  Stake to commemorate the building  of an LDS temple in Vernal. The  temple is currently under construction  construc-tion and is bring built within the  former Vernal  new temnle i  shell of the  Tabernacle. The  scheduled for completion and dedi  cation in November and will be one  of the more than 50 temples worldwide  world-wide operated by the LDS church  and the only one built within an existing  ex-isting structure.  fitful'  lis- k - N 1  ell fr.vrMBBSWMd  Lynette Kunz, Doug Barlow and Caroline Squires rehearse their  parts for \"Come to the House of the Lord.\"  Megan and Amanda Johnson greet Kory Kunz, their soon to be  brother-in-law in musical production sponsored by the Vernal Utah  Maeser Stake.  Chris Piner, co-director, shows Jessie Labrum, where to stand during  dur-ing practice.  Vernal Rotary Presents  An Svwittq KJU&...  Autfoi Goto QanamUU  Cato will share her unique and  disturbing story of living in a  Nazi Concentration Camp fifty  years ago. At the age of 12,  Cato endured life as a victim of  Hitler brutalitv. She watched  4  as people were starved, tortured,  tor-tured, and killed in the name  of racial purity. Today, Cato  tells her story to hundreds of  people every year, including  youth groups, gangs and  troubled teens: Come and  listen to Cato's story.  Dinner and Lecture  Thursday, April 17, 1997  7:00 p.m.  Western Park Convention Center  $15 per plate  Proceeds to Benefit Rotary Scholarship Fund  Tickets Now Available At:  Gale's Office Supply and Book Store  Davis IGA, Vernal and Roosevelt nX  mmm.s?  SUMACS  mm  0  o5  WW  !lMlDaa(J5l3E!i:  YES  We will  still  4t  OoA  F  I  N  A  YES  We are still  open till  8 pm  Mon Frl  till  6 pm  U BRING YOUR TRUCK K  At These Prices, Delivery Is Extra!", "parent": 22653316, "version": 1739891019941412865}, {"id": 22653330, "paper": "Vernal Express", "type": "page", "date": "1997-04-16T00:00:00Z", "year": "1997", "month": "April", "day": "16", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/fa/62/fa624a9d7fcda504d3338d4baf4691b67d079a91.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/5e/5f/5e5f02571709dbc1a282eb938c5cbfba8f2a8d7e.pdf", "page": 14, "ocr": "14 Vernal Express Wednesday. April 16, 1997  I i jl li j  . i f I m \"1 1 1 1 Ilk .  - if! !  ; Kota Barnett is an employee for the  : upeiauiiy n it; oiieepb root, a ain  wSftclhiDmig roles aft  Aiisha Williams of Vernal is a  mechanic in her father's garage.  She was taught since infancy that  she could do anything she wanted  to if she wanted it bad enough.  \"It was never expected of me to  be feminine or unfeminine. I was  and still am given every opportunity  opportuni-ty to be me. My father and my husband  hus-band allow me to fulfill my own  goals, so I chose to work with my  father, who has been in business for  25 years. I not only do his books,  take care of customers and answer  phones, I also tear apart transmissions.  transmis-sions. I have my own tools, get extremely  ex-tremely greasy and dirty, which I  don't mind, but then I love dressing  up and going out.\"  Unlimited career choices arc becoming  be-coming more common for both  men and women, but it wasn't long  ago that girls and boys were pushed  into stereotypical roles. In prc-1970s,  prc-1970s, stereotyping began from the  time children were born. In the hospital  hos-pital nursery girls were given pink  bracelets, and boys given blue.  When the girls \"traded in their pink  bracelets\" for adulthood, they got a  set of dishes, a vacuum, or two  dozen diapers. What the boys found  awaiting them were choices. They  could choose an education, a baseball  base-ball mitt, or a scat in Congress.  \"Back then girls were forced to  choose between being smart and  being feminine. Such a choice  should never have to be made,\"  Williams said. \"I'm a outfitter,  hunting and fishing guide in the  summer, bookkeeper and mechanic  in the winter. I'm doing just what I  want to do and make good money  ding it. I don't consider myself a  tomboy cither, because I like to do  '.cry feminine things, too. I guess I  consider myself married, but not an  extension of my husband. I am my  own person.\" She encourages others  oth-ers not to be intimidated by anyone,  male or female.  \"Human beings, all human beings,  be-ings, have a need to grow.\" she  said, \"that is as basic to nature as  eating and sleeping.  Hie Irccdoins enjoved in the 90s  arc f.ir superior lo earlier times.  Cook of the Week  Teenagers  K.uhy Harris is a woman who believe  be-lieve th.it girls should be well prepared  pre-pared lo t.ikc tare of themselves  when Ihcy pet on their own.  \"I make them learn ever) thing be-lauvc  be-lauvc they have lo know how to  .urisc when they leave home,\"  mvs Hams. \"Ith one lakes lurns  locking at lcal once a week \"  H ut is is the daughter of Charles  and Yvonne Johnson of Los  Angeles ami she married Doyle  Hams of Vernal. She is Ihe mother  of three ihililrcn.  Iter daughter Kristma Is 14 )ears  eld atiJ Is siudcnl of Vernal Jr.  High Sihocl.  Jenny Hair Is aln 14 vears olJ  anJ Is a siudcnl of Vernal Jr. High.  She tame lo live with hef aunt and  unite about two years ago.  m  Uintah County Road Department  compacior.  Intelligence is something held in  the highest esteem, whether it is a  boy or a girl, a man or a woman.  Nadine Bunnell, equity specialist  for the Utah State Office of  Education in Salt Lake City says  that \"children need the freedom to  think and choose for themselves.\"  Chief Economist Lecia Langston  says women need to consider some  facts before walking down the aisle  with Mr. Right and dumping their  career path. Statistics show:  The Census Bureau estimates  that 50 percent of all new marriages  in the U.S. will end in divorce.  Utah's divorce rate is higher  than the national average.  The vast majority of Utah  women who work are married.  More than 70 percent of Utah  women between the ages of 20 and  54 work.  Almost 60 percent of Utah  mothers of preschool children work  outside the home.  Women in Utah work at a  higher rale than the national average.  aver-age. Three-fourths of Utah mothers  of school age children work.  The Bureau of Labor Statistics  estimates young women will spend  roughly 30 years of their lives in  the labor force.  Almost 40 percent of families  with children headed by women  have incomes below poverty level.  \"Personal experiences of many  women, as well as both national  and Utah statistics, suggest that every  ev-ery high school girl should prepare  herself for the economic realities  she may face,\" explains Debbie  Lamorcaux. Schools-to-Carecrs advisor  ad-visor at Uintah High School. \"This  preparation should include an  awareness of rewarding jobs now  available to women and training or  education for a good job of her  choice. Women should be able to  support themselves and their families  fami-lies w ith jobs they have consciously  chosen. Jobs (hat offer good pay,  good benefits, and opportunity for  learn cooking skills  Both the girls say they like to  cook ihincvc food and haibecue the  best,  \"I like ihimichangas ami chocolate  choco-late dipped carrots,\" said Krishna.  \"I like lo make made from sctaith  hlMUIIS,\"  \"I like lo cook dcserls and stuff  huf I love to hatbecue chiikcn and  then cat il,\" said Jenny,  Apple Pudding take  2c. white sugar  12 c, margarine  2 eggs  I Tbn. vanilla  I lp. cinnamon  12 lp salt  3 pared, ducd f aw apples  t  who started out with them as a flagger and worked her wav uo to  advancement. Economic necessity  will dictate employment for many  whether they have planned for it or  not.\"  Shawna Lange and Lori Cashen,  seniors at Uintah High School, decided  de-cided to enlist in the Air Force after  graduation. \"They offer a program  that if we joined together we will  get to stay together,\" said Lange. \"I  gave up a scholarship to Mesa State  in Grand Junction, Colo, to join the  Air Force, because I can get my education,  ed-ucation, travel, get on the job training  train-ing and decent pay while I'm learning.  learn-ing. On top of that I get benefits. I  want to be a CPA, so I put in for  business in general population.  When I get out I will have my education,  edu-cation, experience and employers  will hire veterans. Last, but not  least, I get a 30 day paid vacation,\"  she said.  Cashen says she joined for the  same reasons. \"I don't have any  plans for marriage yet, and I want  to do a few things before I settle  down. I like the fact that this is  what I choose to do and am confident  confi-dent that I will end up with a decent  job.\"  \"Intellectual pursuits are not unfeminine.  un-feminine. Learning independence  in men and women is almost a must  in today's society,\" says  Lamorcaux.  Kota Barnett started out as a  dagger and is now a heavy equipment  equip-ment operator building roads. She  operates what is called a Shecps  Foot.  \"I got married right out of high  school and had a son when I was 20  years old. I was divorced, shortly  remarried and had another son. I'm  now, almost 30 years old, divorced  with two sons. I like my job and I  was lucky to have found a job I like  and a company that treats me as an  equal.\"  Barnett hopes all girls and boys in  junior high and high school think  very seriously about their futures,  \"Now, not when they arc 30. If I  could give all young women advice,  ad-vice, I'd tell them to learn indepen-  2 c. flour  1 Isp nutmeg  14 vp. cloves  2 tsp, baking sod a  12 c. nuts, optional  Deal sugar, margarine, eggs and  vanilla until flufTy. Sift dry ingredients  ingredi-ents together and add all ai once  with all the apples. Stir until flour is  well miscd. Four into a greased and  floured 9s 1 3 inch pan. Bake al 350  degrees for 50 minutes.  Topping:  I C. sugar  12 C. cream (of evaporated milk)  I cube butter.  Heal lo a hoil, ihcn hrnl for 2 min  Ulcs. four over cooked cake.  woirk  dence before you ever get married  and then teach this to your children.  Never stop learning and studying-because  studying-because you will need it all your  life.  \"Be aware, build the awareness of  others, of sexist behaviors, beliefs,  and practices. Awareness is the first  step toward positive change for  you, for schools, and for society.\"  Men sometimes receive the same  stereotyping that women do and often  of-ten feel the negative feedback.  Sometimes this negativity isn't easily  eas-ily perceived, since men traditionally  traditional-ly enjoy the advantages of money,  physical prowess, and prestige.  Women may complain about being  sex objects, but men might justly  complain about being status objects,  valued only for the amount of their  paychecks, positions, or power.  \"Boys are socialized to be active,  independent, and aggressive. This  results in a role conflict for boys,  especially in elementary years when  few males are available to model  behavior with both society and  school expectations,\" explained  Bunnell. \"Thus, boys are more likely  like-ly to be identified as having learning  learn-ing disabilities, they receive lower  grades, and they are more likely to  drop out of school.  \"Few school advisors encourage  boys to learn parenting skills and  may advise them not to enter into  traditional female occupations, such  as elementary teacher, nurse or secretary,  sec-retary, even though there is a demand  de-mand for workers in these fields,\"  said Bunnell.  Columbia Ashley Valley Medical  Center (CAVMC) employs several  male nurses. \"I remember when  there were no male nurses,\" said  Helen Bcmis, Intensive Care Nurse  for CAVMC. \"Now we have some  of the best male nurses I have ever  worked with. Male nurses arc very  important lo some of our male patients  pa-tients who only feel comfortable  with another male.\"  Darwin McKcc, a nurse at  CAVMC said it was difficult for  him when he first started. \"When  someone asked me what I did for a  Kaihy Hams leachea her teenagers Ihe dc's etxl don'1'9 ot baKina  Harris and Kalhy Harria,  ttt r ' a  I 'Q' f -  to Cj . ;  f (Jfi, ! ft  - mS r r If h  i ni n . tf i rr .... if i I  M it i I r \"nmJI Lil LtfaakJI Li mmnJ  Alesha Williams is a versatile  job as a mechanic.  i . ii . v  Lori Cashen and Shawna Lange  aner graduation.  1 l'ri I II  In f- a J if I . i .a  r--'-  i f r.  I i I . i h  Darwin McKee, R.N. at the Columbia Ashley Valley Medical Center.  living and I told them I was a nurse,  eyebrows would raise and I would  hear 'a nurse?' It doesn't bother mc  any more.  \"I believe you have lo be very sc-  cure with yourself. A lot or guys  think Ihis is a sissy job, but it's nol  ?!  woman who enjoys her untraditional  r  have decided to join the Air Force  1 i .  that way at all. I never really had rc-  spc for nurses before, but I do  now.\"  Compromise, disappointments  and frustrations might be avoided  had men and women learn Ihe  decision making process and arc nol  bound by stereotypes and bias.  1 i  11  .. :J I  i 4 i 1  a Cake. L lo r.: Jenny Oair, Krishna", "parent": 22653316, "version": 1739887783452868610}, {"id": 22653331, "paper": "Vernal Express", "type": "page", "date": "1997-04-16T00:00:00Z", "year": "1997", "month": "April", "day": "16", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/7d/a9/7da95de868aa177197524585614b9c2edfae12dc.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/85/f9/85f9bac49b37368b4c7fe488ba7561c6bed4d500.pdf", "page": 15, "ocr": "I 7Z II 1  Vernal Express Wednesday, April 16, 1997 15  m  if ' .. A . . : ij;'- :'.tkA V \"'O ' Joel Sechrist and Kim Aycock  Lee McLaren  Vigil and McLaren will be  married at Western Park  Terry May Vigil, daughter of Mr.  and Mrs. Henry Vigil, will marry  Lee McLaren, son of Mr. and Mrs.  Dale McLaren, Saturday, April 19  at the Western Park.  The bride is currently attending  Ashley Valley High School.  The groom is a 1994 graduate of  Stephen Koch and  1 '\"'Y  r - f  IT\"'  1 fjjf  Erskine and Koch are to be  married in Salt Lake City  Kelly Ann Orskinc and Stephen  Adam Koch will be married in the  Salt Lake Temple on Thursday,  April 17.  The bride is the daughter of Mr.  and Mrs. Ivan Erskine of Vernal.  She graduated from Uintah High  School and has attended Utah State  University the last two years. She  will be transferring to the  University of Utah this fall and is  currently employed with the  Bureau of Land Management.  The groom is the son of Larry and  Five generation, front row, I. to r : great-great-grandmother, Nellie Kloeppel and Kory Bastian Turner.  Back row, I. o r.: grartdmothef, Elaine Kloeppel Christensen; great grandfather, Walter Kloeppel; mother,  moth-er, Julee Chrtstensen Turner and Alexis De Nee Turner.  and Terry Vigil  Uintah High School and attended  UBATC. He is currently employed  at Jack's General Tires.  The couple will be honored at a  reception following the wedding.  They plan to make their home in  Vernal.  Kelly Erskine  Shaunna Dottcr of Vernal, and  Stephen and Suzanne Koch of Salt  Lake City. He is a graduate of  Uintah High School and is currently  current-ly attending the University of Utah.  He served as LDS mission in  Brazil. He is currently employed  with Franklin Quest.  A reception will be held in their  honor at the Glincs LDS Chapel,  1270 W. 1500 S., Saturday, April  19 from 7 p.m. to 11 p.m.  The couple plan to make their  home in Salt Lake City.  Rebecca Calder  Calder and Wentzel will  wed in Salt Lake Temple  Glade and Arlene Calder of  Vernal, announce the marriage of  their daughter, Rebecca Sue Calder,  to Hans Lewis Wentzel, son of Guy  and Terry Wentzel of Rescue, Calif.  They have chosen April 26 to be  sealed for time and all eternity in  the Salt Lake Temple.  A reception will be held in their  honor the evening of April 26 at  Ashley Maeser Chapel, 2575 N.  1500 W. in Vernal, from 6:30 p.m.  to 9 p.m. An open house will also  .be held in their honor on May 10 at  the groom's parent's home in  Community Calendar  April 1  Vernal Jr. Spurs shot and worming clinic for 4-H horses will be  held at Western Park at 4:30 p.m.  Vernal Junior High midterms will go home to parents.  April 17  \"Dance Traditions of Deseret\" with Craig R. Miller, folklorist, Utah  Arts Council slide show and lecture at 7 p.m., Uintah County  Library multipurpose room. For more information, 789-0091.  Teen recovery meeting for 13 to19 year olds, 7 p.m. at 110 N.  500 N.'3.  April 21-25  The training program for the Utah Field House education volunteers  volun-teers will be from 9\"a.m. to noon. Anyone may volunteer. For further  fur-ther information please call the Utah Field House and ask for  Linda Unsicker.  April 22  Teen recovery meeting for 13 to19 year olds, 7 p.m. at 110 N.  500 W. 3.  April 23  Fifth annual Uintah School District Art Show at the Western  Park Museum, 6 p.m. to 8 p.m. Free refreshments and live music.  For more information call Brock Thorne 781-3110.  Vernal Chamber of Commerce luncheon, 7-11 Restaurant at  noon.  April 25-27  Richard Shrake's Resistance Free Riding Clinic, will be held at  Western Park. For more information call Brenda Bridges 781-1130,  781-1130, Jacque Hobbs 789-2367 or Janet Lesh 789-3696.  To place items of public interest on  to Vernal Express, P.O. Box 1000  Materials subject to edit. Deadline  and Hans Wentzel  Rescue, Caiif.  The bride is a 1994 graduate of  Uintah High School and a 1996  graduate of Rick's College. She  will graduate from the Institute of  Medical and Dental Technology on  May 16.  The groom recently returned from  serving a full time mission for the  LDS church to the Mexico,  Chihuahua Mission.  The couple plan to reside in  Rexburg, Idaho, where the groom  will continue his education at  Rick's College.  the community calendar mail  or call the Express at 789-3511.  is Monday at 12 noon.  Correction  The llardman and Waldron wedding  wed-ding announcement in the April 9  issue should have included Lewis J.  Waldron is the son of Kenneth C.  Waldron.  Marriage Licenses  Matthew Jason Schlaegcr and  Jacqueline Faith Rasmusscn, both  of Vernal, issued April 9, 1997.  Donald Clyde Hatch, Jr. of  Roosevelt, and Keli Frances  Nielsen of Ft. Duchesne, issued on  April 10, 1997.  Trcn Strnlton Hirschi and Laura  Rasmusscn. both of Vernal, issued  April II, 1997.  Brian Maik Bennett and M.ilynda  Guymon Andcrton , both of Vernal,  issued April II, 1997.  William R. Tcnhagcn and Sandra  Sue Campbell, both of Salt Lake  City, issued April II, 1997.  Johnalhan Lee Stephenson of  Mountain Home, Idaho, and Dolly  Isabcllo Taylor of Vernal, iucd  April 12, 1997.  Duane lidwin Dalil of Montrose.  Colo., and Anna Mane Harrison of  Lapoint, issued April 14, 1997.  Steve Lloyd Caldwell and  Winona Marie Ramuvcn, both of  Vernal, issued April 14, 1997.  Aycock and Sechrist marry  in Mt. Timpanogas Temple  Gordon and Ruby Aycock of  Billings, Mont., announce the engagement  en-gagement of their daughter Kim to  Joel Sechrist, son of Lynn and  Sandi Sechrist of York, Penn., April  26 in the Mt. Timpanogas Temple.  The bride is employed by Sound  Concepts and attends Utah Valley  v i  Dr. R. K. and  I  1 d 'W  Murri's celebrate 50th  wedding anniversary  Dr. R. K. Murri and his wife,  Oneta, will celebrate their 50th  wedding anniversary on April 16.  They were married in Idaho  where they were both born and  raised. Shortly after graduating  from dental school at the University  of Minnesota, they moved to  Vernal, where R. K. practiced dentistry  den-tistry until his retirement in 1989.  R.K. enjoys Fishing, hunting, golf  and gardening. Oneta (Big O) enjoys  en-joys bridge, golf, and volunteer  work with the schools. She worked  many years for the juvenile court  g, mdal  ' CLRI - K  1  L  Terry llgit & Lee McLaren  .mn.U.  \"\"inn  Kelly Erskine & Stephen Koch  ..iuiuuv. Apt ii r.i, rw 7-Hpin  f;iinrsIJ)SClMrl 1270W! I .'MX IS  Julie llanlmnn & Irw U'ahlnm  anurias; April 19. I'i'i7 \"-9 pin  . WrMrtit I'aik 102 L. 2tX) S  iff,  o0  Jftt Qift nUppinj ani Dttimf  M: 84 Sat:  280 W. Main  State College in Provo. She is majoring  ma-joring in business.  The groom is a junior at Brigham  Young University in Provo where  he is majoring in business.  Aycock is the granddaughter of  Ken and Alyce Aycock.  ' t ' f  Oneta Murri  office in Vernal.  The Murri's were blessed with  two sons, Ron Murri and his wife  Kris who reside in Vail, Colo., and  Steve Murri, who died on Feb. 14,  1991. They also have two grandsons,  grand-sons, Morgan of Vail, Michael and  his wife, Sioux, of Moab, and two  great grandchildren, Morgan and  Cody of Vail.  The Murri's have enjoyed many  cruises to all corners of the world  and will be celebrating their 50  years of marriage on a cruise  through the Panama Canal ending  up in Vancouver, Canada.  'Registry  )W & K ITITfinv  ..u 19. IW I ..5 pm  r.nk302K, 200S  ' :'V x  ill  iii  Rr.ci-.Hiox  XII  i 1 1  III  r  4 Sun: 10S  v 7811556", "parent": 22653316, "version": 1739891504178003969}, {"id": 22653332, "paper": "Vernal Express", "type": "page", "date": "1997-04-16T00:00:00Z", "year": "1997", "month": "April", "day": "16", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/df/69/df69e25f2ef28fa6d0a05f24ae1d80eb827e7911.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/76/2b/762bc433c7060119b6d0876e515ecf01c09f6b65.pdf", "page": 16, "ocr": "16 Vernal Express Wednesday, April 16, 1997  News from  Manila  by Clara Robinson  7843463  i  V  JT X  1 J  i - v  1  Kim Barnhurst shares her knowledge of album preservation, creativity  cre-ativity and meaningful.  Memories preserved  for future generations  Kim Barnhurst is a Creative  Memories Consultant from Dutch  John and wants to share her expertise  exper-tise to those who care about the  preservation of those memories that  should never be forgotten on  National Scrapbook Day, May 3.  \"I've been doing scrapbooks since  I was 12 years old, but I've been  doing it professionally for the last  year and a half,\" Barnhurst said.  She says that 90 percent of all  households own and use a camera  and more than 46 million photos are  taken, nationwide, every day.  Family photos, indeed our heritage,  her-itage, are in danger of deteriorating  because of cheap materials, adhe-sives  adhe-sives and cardboard backing.  Barnhurst reminds us that most people  peo-ple aren't even aware of this problem.  prob-lem. Even worse, numbers of priceless  family photos are being prematurely  destroyed in albums that contain  photo-damaging peroxides or PVC  (Polyvinyl Chloride).  Barnhurst has come across some  interesting solutions to these problems,  prob-lems, which she shares in her classes.  class-es. She also offers organizing tips  that will make scrapbooks more attractive,  at-tractive, creative and individualistic.  individualis-tic. She begins with showing how to  organize and preserve family photos,  pho-tos, sometimes 10 or 20 years  worth, by detailing the process of  making a family album. This includes  in-cludes preserving family heritage  by balancing photographs with genealogyfamily  ge-nealogyfamily tree or videotaped  memories, and creative arrangements  arrange-ments of photographs and writing.  She also addresses the problems of  adding newspaper articles into the  9 t  P $.  Kim Barnhurst made a geneology album of her family for her future  generations to learn about family histories.  National Library Week  celebrates kids, libraries  National Library Week. April 1 3-19.  3-19. will celebrate the many ways libraries  li-braries and librarians serve children  with the Ihcmc \"Kids Connect ai lite  Library \" The goal is to encourage  parents, grandparents and cither  caregivers to bring children and  other resources that will help them  learn and grow throughout their  lives. On Wednesday. April 16. the  American Library Association and  the Uintah County Library will  sponsor Log on at the Library Day  lo fivus atienlion on the key role of  libraries in providing public access  to lite information superhighway.  Library staff members will he on  Tied Flannel  mi -  Quilted Hens  38 S. 600 W.  'J  3  photograph album.  Photography is an investment into  personal memories and family heritage,  her-itage, and Barnhurst feels that it is  important to protect that investment  so that it may last through generations  genera-tions to come. In her classes she  covers the kinds of materials and  supplies needed to make a keepsake  family photo album and what materials  mate-rials should be avoided.  Safe and creative photo storage  practices are also a primary topic.  In some albums, \"photographs are  ruined much more quickly than they  would be if you just left them in a  shoe box,\" said Douglas Severson,  a conservator at the Art Institute of  Chicago.  On Saturday, May 3, people  across the country will join together  to celebrate National Scrapbook  Day, an annual event that teaches  the importance of documenting and  preserving family photos and stories  in safe, meaningful keepsake albums.  al-bums. A beginner's orientation class that  teaches the importance of the keepsake  keep-sake album tradition as well as  how-to-tips and creative ideas will  take place at the Golden Age Center  on May 3, National Scrapbook Day.  This is a great family activity too,  said Barnhurst. \"My five-year-old  just got her first album and can't  wait to start putting her pictures in  it.\"  Everybody has a history and what  better way to bring it back to life  than pictures, hand written histories  and articles of achievement preserved  pre-served in a scrapbook album for future  fu-ture grandchildren and great-grandchildren.  hand lo assist patrons of all ages in  becoming familiar w ith the Internet.  Families can enter lite \"Kids  Connect Ml the Library\" contest,  sponsored by the American Library  Association and Suave, for a chance  at winning a multimedia computer  for iheir family and the school or library  li-brary of iheir choice (one winner  for each stale), and a S20.IXK) grand  pric for the besl overall entry from  among ihc 50 slate w inners. Sec (he  Uintah County Library for dci.tiU  on contest rules. Lniries must be  postmarked by April 30 anJ received  re-ceived by May 15.  Quilts for Sale  , 1 1  Great (lifts for Mother's Day  Graduation New Uables  birtbdav Catmx-rs  ::  Vernal 789 2411  D oil  1  i i i it i  ill \"N. f  Angela Merkley  Merkley  elected FBLA  president  Angela Merkley, junior at Uintah  High School, was elected State  President of the Future Business  Leaders of America at their state  competition in Salt Lake City last  month. Merkley, daughter of Enrol  and Janet Merkley, is the first student  stu-dent from UHS to be elected to the  state FBLA presidency.  As president, Merkley will  provide leadership to over sixty  state chapters of FBLA. \"My major  goals,\" said Merkley \"are to improve  im-prove communication between the  FBLA chapters and to increase the  scholarship fund established for  FBLA students.\"  Merkley's responsibilities start in  June at a state planning conference  in Logan. In July, she will represent  Utah at the FBLA National  Conference in Anaheim; and in addition  ad-dition to state leadership conferences,  confer-ences, Merkley will attend the  National Leadership Conference in  Seattle in the fall.  According to Merkley, the idea to  run for state office came last year  when she attended her first FBLA  state competition, \"It looked like  fun,\" said Merkley. \"At first we just  joked about it. But then students  started encouraging me to really  think about it. I thought about running  run-ning for vice-president, maybe historian.  his-torian. Then Mr. Jameson suggested  I run for president.\"  Merkley said her campaign revolved  re-volved around a speech she gave at  the opening session and a campaign  booth w hich featured a tablecloth of  hand prints depicting the hands-on  opportunities available through  FBLA. A video prepared by George  Harvey, a senior at UHS, informed  participants at the convention from  over 60 high schools of Merkley's  campaign objectives.  In addition to FBLA, Merkley is a  member of DF.CA, An Association  of Marketing students and the  Honor Society. Upon graduating  from Uintah High School, she plans  lo continue her education in photojournalism.  photo-journalism. Newborns  April 1 1 , 1 W a son was born to  Jamie Lorraine and Kurt Barret  Young. He weighed 8 lbs. 7 oz. and  will be named Gavin O'Ncil  Young.  April II, 1997 a son was born to  Darchcl and Ryan Murray. He  weighed 6 lbs. 14 .. and measured  19 12 inches long. He will be  named Jaydcn Allen Murray.  April II. 1997 a daughter was  born to Tamara and Randy  I'ummcll. She weighed 8 lbs. 2 oz.  and will be named Courtney Lyn  I'ummcll.  WANTED  Recipes for this years Uintah County Fair  Cookbook. Be a part of history, send us your  favorite recipes for soups, salads, one dish  meals, breads, and desserts. Leave them in  the boxes at the Library, the Court House,  The Hair Affair, My Place, Smith's, Dinah  Bowl, Acute Cut, and Alece's Beauty Factory,  Jensen Cafe or mail them to:  East 500 South  Vernal, Utah 84078  DEADLINE IS MAY 24!!!  Brooks and  Tinker wed  Kathleen Brooks of Salt Lake  City, daughter of Jack and Shawna  Brooks of Bountiful, became the  bride of Travis Tinker of Salt Lake  City, son of Glen and Betty Tinker  of Manila on March 22 in the  Bountiful LDS Temple.  A reception was given that  evening at the Salt Lake City Deaf  Ward from 7 p.m. to 9 p.m.  The bride attended Salt Lake  Community College and will attend  USU in the fall. She currently  works for the Jordan School District  as an interpreter for the deaf and  plans to be a counselor for the deaf.  The groom is a graduate of  Manila High School. He attended  Salt Lake Community College and  will attend Bridgeland ATC in the  fall.  They will make their home in Salt  Lake City.  The M & L Homemakers Club  met on the third Wednesday instead  of the regular third Thursday last  month at the home of Ferl Briggs at  1 p.m.  A lunch was served by officers  Ferl Briggs and Donna Lloyd and  members were asked to look at the  bottom of their plates after they finished  fin-ished eating, for a prize. Sandy  Asbill won an Easter basket. After  the luncheon a meeting was held  and \"it\" packages went to Cherril  Woodard and Donna Lloyd. The  next meeting will be Thursday,  April 20 at 1 p.m. at Niki's Cafe.  The Cub Scout Pine Wood Derby  will be held at 6:30 p.m. on  Wednesday, April 17 at the Manila  Ward Cultural Hall.  The Stake Young Women, the primary  pri-mary and the Relief Society Stake  meetings will be held at the Green  River Stake Center at 7 p.m. on  April 22.  High School rodeos this week will  be held in Price and Castle Dale.  The Sweetheart Ball is scheduled  for 7:30 p.m. at the Manila High  School on April 22.  Stake Temple Day is April 26.  Those attending are to meet in the  waiting room of the Ogdcn Temple  at 7:30 a.m.  The Manila Ward Conference was  held at the Ward building on  Sunday, April 13.  f - .  i4f  4  4  McKayla Wahlqulst  Carly Smith  Bnloe Gregory  Congratulations  Congratulations to Ihc following  babies for passing (heir first milestone:  mile-stone: McKayla Marie Wuhlquist,  daughter of Robert F. and Michelle  A. Wahlquisl, birthday April 9,  1997.  Carly Marie Smith, daughter of  Kyle and Tammy Smith, birthday  April II, 1996.  Drilec J'lean Gregory, daughter  of Jim and Kim Gregory, birthday  April 16, 1996.  \"'-'\" nlrrft- r ii L-\" 3k - .-' wr\" '\"Til\" (iiibJ  The Home and Garden show at  models one of the sun bonnets  the pioneer women wore.  LeAnn Miller and Quilters on the Edge set up a booth in the Homer  and Garden Show at Western Park.  t  There was a wide variety of bird houses and many other crafts  shown by Kelley Behrman of Honey Dew Crafts during the Home  and Garden Show at Western Park.  If you have any  Society News or Feature Story ideas  Call Carol Jewart  at  VERNAL  Express  fnr One, dh.r.lt flnhjl  2 LARGE 1 TOPPING PIZZAS $15\"  and 4 Salads  HU TOMBS). I .ffl -  a p a n d  22  v lit 1 1 1 v..  0w  .Lab on i Certified Precriptlon  Premlet Optician Filled  P) Sunglasses Contact Lens Repairs  the Western Park, Carma Hunsake  she makes compared to the ones  i  the  789-3511  UlflS \"IK 'sTi ft'iW  o p f n i n o  Sat May 1\"  K.C.  W. Main Vernal  789-0359  m  2E3", "parent": 22653316, "version": 1739886427414462466}, {"id": 22653333, "paper": "Vernal Express", "type": "page", "date": "1997-04-16T00:00:00Z", "year": "1997", "month": "April", "day": "16", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/2a/87/2a87a5b36a1476cfa4fdc7434039be32f3c25875.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/ff/7f/ff7f615c194f0e45afd3c915f3f93850e98acf2d.pdf", "page": 17, "ocr": "Vemal Express Wednesday. Aprfl 16, 1997 17  Looking at life  Speaking at birth  I A U LL ,LJ  Joshua Cook  Cook called  to serve  in Canada  Joshua R. Cook, son of Bruce and  Connie Cook, has been called to  serve two years in the Canada,  Vancouver Mission for the Church  of Jesus Christ of Latter-day Saints.  His farewell will be held Sunday,  April 20 in the Davis 2nd Ward,  Uintah Vernal Stake Center at 12:50  p.m.  Cook will enter the Missionary  Training Center in Provo on April  23.  Dale Allred  Allred called  to California  Dale Steven Allred, son of Glade  and VaLinn Allred, has been called  to serve a two-year mission for the  Church of Jesus Christ of Latter-day  Latter-day Saints in the California,  Anaheim Mission.  His grandparents arc Vard and  Deon Opcnshaw and Charles and  Melba Allred, all of Vernal.  He will speak April 20 at the  Glincs 5lh Ward Chapel, 1270 W.  1500 S. at 10:20 a.m.  He will enter the Missionary  Training Center on April 23.  Express  7a in  WA I LJSLJ  treat yourself!  Fine dining, lodging  and other neat stuff  -ft  RED  s  ? CflNYQN  LODGE  ftiftnm in Hem aimn with  Roger Remington  Remington  will serve  in Russia  Roger Remington, son of Sylvia  Remington, will serve a two-year  mission for the Church of Jesus  Christ of the Latter-day Saints at the  Moscow, Russia Mission.  The date of his farewell is April  20 at the LDS Church on 1500 S. at  12:15 p.m.  Remington will enter the  Missionary Training Center on May  7.  Nathan Goates  Goates accepts  call to serve  Elder Nathan Gentry Goates, son  of Hal and Janis Gentry Goates, accepted  ac-cepted a call to serve a two-year  mission for the Church of Jesus  Christ of Latter-day Saints in the  Brazil, Sao Paulo South Mission.  His older brother, Spcnce Goates,  received a call to serve the same  mission one year ago.  Elder Goates' farewell is scheduled  sched-uled for Sunday, April 20 at 10:50  a.m. in the Ashley 1st Ward, 2575  N. 1500W.  He will enter the Missionary  Training Center April 30.  SAMPSON  Had the right Idea  about advertising...  He took 2 columns  and brought down  the housel  Call 789-3511  To place your ad In the  wm aopto?  Open dally  8 a.m. to 9 pjn.  Ihe Ahlry National Fores!  Jennifer Kerns  Kerns  returns from  Washington  Jennifer Kerns, daughter of Earl  and Jeri Kerns, returned April 6  from serving a 19-month mission  for the Church of Jesus Christ of the  Latter-day Saints in the  Washington, Spokane Mission.  She will speak April 20 at the  Maeser 2nd Ward at the Maeser  Stake Center, 2745 W. 1000 N. at  12:50 p.m.  Douglas Bemis  Bemis earns  heroism award  Douglas A. Bemis, son of Robin  and Helen Bemis of Vernal and a  Life Scout, was awarded the  Heroism Award by Taul Hitchcock  at a ceremony in the Naples 2nd  Ward, LDS Church.  Bemis and his family went to  Atlanta, Ga. last summer to attend a  family reunion and go to the  Olympic games. He spent one day  with his Aunt Angic and his two  cousins swimming in a pool at their  apartment complex.  He was in the pool playing with  his two cousins and noticed a little  two-year-old boy playing in the  pool with his toys.  \"I saw the toys he was playing  w ith on top of the water, so I went  over to where the toys were and  that's when I noticed the little boy  on the bottom of the pool turning  blue and fighting for air,\" explained  Bemis. \"I just went after him,  pulled him out of the pool and  quickly put a blanket around hint so  he wouldn't go into shock.\"  \"Alter pulling him out he started  crying and screaming white I  checked him for injuries,\" Bemis  said. \"Hie dad came over then and  said, \"thank you.'\"  \"He isn't a good swimmer,\" said  Bemis' mother, Helen. \"Ho had a  lot of trouble passing the swimming  lest to get his badge but he finally  made it and he is really glad he  did.\"  \"I learned first aid in scouts,\"  Bemis said. \"I'm kind ttf proud of  myself, but afterwards I fell a little  spooky. I didn'l even stop to think if  I should go after him underwater, I  just did.it. tic is going to he okay.\"  Philipp earns  place on  honor roll  Dcni E. Thilipp received recognition  recog-nition at Wchcr Stale Ur.ivcrsiiy for  superior accomplishment in (klncv  ing a grade point average of 3 5 or  above for winter 1996-97.  Philipp i ihe daughter of Denni  and Myrna Philipp of Vernal. She i  a 1995 graduate or 1'mtah High  School and ha attended Weber  State University for ihe lat two  years.  1. ..Art;,! ' 1  Morgan Sullivan  Sullivan earns  Eagle Scout  Morgan Lamont Sullivan received  the Eagle Scout Award from Karl  Wright on March 15 at the Cultural  Hall of the Vernal 9th Ward.  Sullivan is the son of Arvid and  Leta Sullivan of Vernal. He is a  member of Troop 789. For his  Eagle project, Sullivan painted a  map on the playground at Maeser  Elementary. He is a senior at Uintah  High School, is active in sports and  plays the piano.  Immunizations  to be held  free at UBPHD  In recent years, deadly childhood  diseases have emerged due to inadequate  inad-equate immunization. The high risk  population are children between the  ages of two months and two years.  Records show that approximately  one third of Uintah Basin children  in this age group do not receive adequate  ad-equate immunization. In an effort to  reach these children, free immunizations  immu-nizations will be offered at Uintah  Basin Public Health Department  during National Infant  Immunization Week, April 20-26.  Dangerous childhood diseases  still exist. The measles epidemic of  1989-91 resulted in 55,000 cases  nation wide. Utah experienced 485  cases from 1989-91 and 136 cases  in 1994. There were 38 cases of  Pertussis (Whooping Cough) from  1989-94. Most of these cases occurred  oc-curred in non-immunized children  less than four years of age.  Diseases such as Measles,  Pertussis, Diphtheria, Mumps,  Rubella, and Hepatitis B can be  contracted through casual contact  with an infected or recently vaccinated  vacci-nated person. Children who are not  adequately immunized are most  susceptible when exposed to recently  re-cently vaccinated children.  Children need most of their shots  by two years of age. Eighty percent  of all vaccines can be given to children  chil-dren two months-two years of age  in just five visits to the local health  department at minimal cost. See  schedule below.  2 months: DTP, Hepatitis B, Hib,  OPV  4 months: DTP, Hib, OPV  6 months: DTP, Hepatitis B. Hib,  OPV  12-18 months: DTP, Hib, MMR  4-6 years: DTP, MMR. OPV  Uintah Basin Public Health  Department is holding free immunization  immu-nization clinics in celebration of  National Infant Immunization  Week, April 20-26. Immunizations  for children will be free. Valuable  coupons will be given to all participants.  partici-pants. Prize drawings will be held  all week. A special open house  clinic will be held at all UBPHD locutions  lo-cutions in the Basin (check schedule  sched-ule below). Uintah Basin Public  Health Department strives to  achieve a 95 percent immunization  success rate for children in the  Basin.  The Special Open llouvc Clinic  for Vernal will be held April 23. 9  am. to 6 p.m.; Roosevelt,  Thursday. April 24. 9 a m. to 5  p.m.; Duchesne, Tuesday, April 22,  1:30 p.m. to 4:30 p.m. and Manila,  Tuesday, April 22, all day.  We are the Lutheran t hurrh  Mhtftourl Synod  VE STILL BELIEVE.  TEACH AND CONFESS  The Virgin Birth  Complete Atonement in  Christ  Inerrancy of the Holy Bibiie  Salvation by Grace through  Faith in CHRIST, not In  works of man  Our Savior  Lutheran  T 370 S. 500 w.  789 U21  Sunday ScHool I i m  u  J  by Dr. Ron Sathe,  Pastor of First Baptist Church  What if babies were born with the  ability to speak at birth? What  would they have to speak about? I  have heard of those who do age regressions  re-gressions and supposedly take the  individual back to a previous life.  Contrary to what others might  claim, we do not have a previous  life. Some people don't ever seem  to have a life. If babies were born  with the ability to speak, they  would probably relate the story of  how they entered this world in the  midst of a crime. That they heard a  woman screaming in the background  back-ground and there were all kinds of  people with masks on. Then one of  those masked bandits grabbed them  by the legs and while hanging upside  up-side down was struck. It was a horrible  hor-rible experience that made one forget  for-get all about that woman who was  screaming!  I remember when my second  child was born. The doctor, forgetting  forget-ting his first responsibility, stepped  out to get coffee. During that time  my son decided that it was time to  be born. The nurses kept telling my  wife to wait. What a sick sense of  humor! My son was not cooperating,  cooperat-ing, the nurses were not helping,  the doctor was making an executive  decision of how many sugars the  coffee should have, and my wife  was screaming, \"Won't someone  please help me?\" She didn't look at  me when she spoke. At the moment,  mo-ment, holding her hand and telling  her to breathe deeply fell far short  of what she really needed. It was a  horrible situation and I felt faint.  Then I remembered my medical  training and sitting down I put my  Golden Age News by Ada Murray  'Old Timers' entertain  The \"Old Timers\" were the entertainers  enter-tainers during lunch on Monday  April 7. They played and sang  many songs. Some of the songs  were requested by the audience and  Dick Ufford recited some of his poetry.  po-etry. Native American Heritage Day is  Friday, April 1 8. The Ute Tribe will  entertain at the senior center with  native dances, story telling and arts  and crafts. Everyone is welcome to  attend this special occasion.  Bingo will be played on Thursday  this week. Senator Hatch's conference  confer-ence for seniors will be held  Monday, May 12 at the Little  American in Salt Lake City. A bus  will leave the center at 5 a.m. that  morning. The cost of the trip is $7  for the conference and $5 for transportation.  trans-portation. The $7 has to be paid in  advance. Anyone interested in going,  go-ing, call the Golden Age Center at  789-2169. Space is limited.  Opal and Clayton Slaugh will be  having their 50lh wedding anniversary  anniver-sary dance Friday, May 2.  Refreshments will be furnished by  the family.  Kay Bullock will be playing the  piano with the orchestra until Amy  Allen gains her strength back after  having surgery.  Winners at bingo Tuesday, April 8  Correction  In ihe article \"Explore New Life,\"  in the April 9 issue, the Vernal Elks  Lodge is the Charter Sponsor of the  4 The Youth, Inc., Explorer program.  AYYENYOON  PERSONS WITH ALLERGIES  & ASTHMA  DUANE HARRIS, MD  FROM INTERMOUNTAIN  ALLERGY & ASTHMA CLINIC  Comes to Vernal on a regular basis for the  diagnosis and treatment of asthma &  allergic diseases. Me sees patients at the  the Vernal Basin Clinic.  Appointments can be made by calling  Salt Lake City 801-968-8685  If you have questions as to whether or not you need to  see a specialist, please consult your own physician.  head between my legs. Though I  could still hear my wife screaming,  putting my hands over my ears sure  helped. If my son could have spoken  spo-ken at birth he might have said,  \"Dad what are you doing? Mom  can't you see that dad is stressed  out, lighten up, your giving us a  headache! None of this can really  be that bad.\" If men were the ones  to experience childbirth we probably  proba-bly would never have to worry  about overpopulation.  It is a blessing from God that we  cannot remember being born for it  keeps each of us telling what a traumatic  trau-matic experience it was. The Bible  speaks of another birth. \"Blessed be  the God and Father of our Lord  Jesus Christ, who according to His  great mercy has caused us to be  born again to a living hope through  the resurrection of Jesus Christ  from the dead...\" 1 Peter 1:3. What  an exciting birth this is and what a  joy it is to tell about. While we do  not remember our first birth, if you  have been born again you will remember  re-member it. I remember when I was  born again. I know the day and  date. While you had nothing to do  with the first birth, when you are  born again, it is the result of a  decision to reject sin and to receive  Jesus Christ as Lord and Savior. As  we look at the verse above, we see  that it is a work of God. It is the result  re-sult of His mercy that we have a  living hope that comes through the  resurrection of Christ from the  dead. In this life you might scream,  like my wife during the birth of our  son, \"Someone please help me!\"  Well, someone has and stands  ready. God is not out on a coffee  break. He sent His Son that we  might be born again.  were Edda Bingham first place with  five games and Mollie Stockton  second place with four games.  Friday, April 11, Lorraine Keele  took first place with eight games  and Glen Allen second place with  four games.  \"Pain makes man think. Thought  makes man wise. Wisdom makes  life endurable.\" John Patrick  Whv .nffor Frnmm  HeadachesMigraines  NeckLower Back Pain  LegArm Pain  Carpal Tunnel  Whiplash  When professional help  Is readily available?  Evening or Saturday  Appointment avallabl  by request.  1 oeauBl  jig  i  IV  rvaaaMUaaBi  v.  i", "parent": 22653316, "version": 1739895345795563521}, {"id": 22653334, "paper": "Vernal Express", "type": "page", "date": "1997-04-16T00:00:00Z", "year": "1997", "month": "April", "day": "16", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/cd/39/cd398073ee7ded51a6f0dde8d7e2ac999ae75511.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/a9/bc/a9bc56685cbbde25c6c15ebbb201a336f0dc9cfd.pdf", "page": 18, "ocr": "18 Vemal Express Wednesday. April 16, 1997  Rematch at Union Friday  Baseball team  quietly grabs first  by Eric F. Pye  Sports Writer  The Uintah boy's baseball team  picked up two important wins last  week in Region 10 contests to keep  themselves in contention for the region  re-gion championship. To listen to the  coach and players though, you  would think it was no big deal.  \"It was nice to pick up the victories,  victo-ries, but we still aren't playing that  well as a team,\" head coach Brent  Labrum offered, \"it's almost as if  the players are taking turns having  on and off games. One game we'll  have certain players play well, and  the next those same players will be  off and other players have a good  game. I'm glad they're not all off at  the same time, but it sure would be  nice to come out strong and play  strong as a team throughout an entire  en-tire game.\"  The most consistent aspect of the  victories came from the pitching  mound. In last Tuesday's 6-3 victory  victo-ry over Lehi, starter Lyn Hadlock  threw a three hit complete game. In  Friday's 5-1 victory over Park City,  Tennis team splits  by Eric F. Pye  Sports Writer  The 4th ranked (in 3A) Uintah  High School tennis team had just  one dual match prior to opening  Region 10 competition last  Thursday at 3rd ranked Lehi and  it showed.  \"We were a nervous team heading  into the competition,\" head coach  Ron Enloe said, \"even our veteran  players admitted to being nervous  prior to the match.\"  Still shuffling the lineup to best  match players and positions, Uintah  dropped a 5-0 decision to the  Pioneers. Only one match was competitive.  com-petitive. At number one doubles, Erik  Wilcken and Dan Darlington faced  the same Lehi team they lost to in  the state championship match last  year. Even though the result was the  same this year, the scores were  much closer as WilckenDarlington  went down in two tie-breakers 6-7,  6-7.  \"For their first match together, I  thought they played very well,\"  Enloe said, \"they actually led 5-3 in  the first set, but they struggled with  their serves and that basically  proved to be the difference in the  match.\"  \"Lehi is a good team. They have  already beaten number one ranked  Park City and I think they will contend  con-tend for the state title this year,\"  Enloe continued, \"the brightest aspect  as-pect of the match was the fact despite  de-spite losing 5-0, I truly believe we  are close in several of the positions  and with a few more matches under  our belt, who knows?\"  Number one Uintah singles player Parker Enloe literally leaps  into service effort during match with Lehi last week at Lehi.  starter Shane Smuin scattered seven  hits over seven innings while going  the distance.  \"For the most part, our pitching  has been very good throughout the  season. There have been times  we've struggled with our control,  but even then, we've gotten good  relief help,\" Labrum said.  In Tuesday's game with Lehi, the  Pioneers established a 3-1 lead before  be-fore the Uintah bats finally warmed  up. Over the first four innings,  Uintah collected just three hits off  Lehi starter Yates who had pitched  a one-hitter in his previous start  against Park City. Their only run  came in the second inning when Jon  Muir walked and scored on Jason  Culpepper's double.  \"That (a slow start at the plate)  has been a common occurrence with  these guys,\" Labrum said, \"I don't  know if it takes us a couple innings  to catch on to a pitcher or if we just  have a hard time preparing ourselves  our-selves prior to the game.\"  Whatever it is, the Utes have also  made it a habit to come back, and  Playing his first match at number  one singles, Parker Enloe went  down 6-1, 6-2. At number two singles,  sin-gles, Aaron O'Dell fell 6-2, 6-2  while Andrew McClellan went  down 6-0, 6-1 at number three singles.  sin-gles. Following WilckenDarlington in  doubles, Marty Mortenson and Wes  Madsen lost 6-2, 6-3 at second doubles  dou-bles to the same Lehi team which  lost to Uintah in the finals last year  in that position.  Friday, the team traveled to North  Sanpete to take on the Hawks with  a different lineup and a little more  experience. Both paid off as the  Utes took a 5-0 decision.  Enloe won his match at number  one 6-1, 6-4. O'Dell followed suit  with a 6-4, 6-0 victory while  Mortenson moved up to number  three singles and responded with a  6-7, 7-5, 6-4 victory after trailing 4-1  4-1 in the third set.  WilckenDarlington won their  match at number one doubles 6-0,  6-2 while MadsenMcClellan won  their match at number two doubles  6-0, 6-4.  \"We played a bit more relaxed  than at Lehi. The lineup change  worked and the kids played with a  lot more focus,\" Coach Enloe said.  With just a few matches under  their belts, Uintah heads into the  heart of their schedule. Following a  late match yesterday at home  against top-ranked Park City,  Uintah will travel to Logan this  Friday to take on the 4A Grizzlies  in a dual match before competing in  the Logan Invitational Tournament  Saturday.  I 1  Eh  r  Pitcher Shane Smuin whirls for  come back they did against Lehi.  Cory Kebert and Dace Mowry started  start-ed off the fifth with consecutive singles.  sin-gles. After an Andy Long fielders  choice, Uintah chased Yates from  the game with singles by Nick  Espindola and Tucker Caldwell to  tie the game at 3-3.  Uintah kept up the hitting barrage  in the sixth when Steve Hatch singled  sin-gled and Dace Mowry singled and  scored on Andy Long's blast over  the left-center field fence. Hadlock  added five strikeouts and just one  Big game permits  go on sale April 21  Permits to hunt during Utah's  1997 general buck deer and bull elk  hunts go on sale, on a first-come,  first-served basis at 8 a.m., April  21.  Permits will also be available at  Division of Wildlife Resources offices  of-fices in Ogden, Salt Lake City,  Springville, Vernal, Price and Cedar  City, and from participating license  agents statewide.  Two changes await hunters this  year, said Judi Tutorow, Division  wildlife licensing coordinator.  First, hunters may purchase permits  per-mits three months sooner than last  year, allowing them additional time  to scout their chosen areas and  make hunting plans.  Second, participating license  agents and Division offices will be  required to wait until 8 a.m. before  selling permits, allowing all hunters  an equal chance to purchase them.  In past years, license agents have  been allowed to sell permits after  12:01 a.m. the day they went on  sale, Tutorow said.  Hunters unable to access an agent  who opened early did not have the  same opportunity to purchase buck  deer permits for the popular  Southern Region as did hunters who  had access to these agents.  Regarding Southern Region general  gen-eral buck deer permits, Tutorow has  some advice for hunters traveling to  a location to purchase one. \"Be  there early,\" she said. \"Hunters interested  in-terested in hunting in the Southern  Region should know from past experience  ex-perience how quickly those permits  sell out.\"  Last year Southern Region general  gener-al buck deer permits sold out by  noon the day they went on sale.  Hunters interested in purchasing a  general buck deer or bull elk permit  will have more locations to do so  this year, as more than 230 agents  will be selling them, Tutorow said.  In 1996, 192 agents sold general  buck deer and bull elk permits. To  find the license agent nearest them,  hunters may contact the Division's  Salt Lake City office ot 538-4700,  \"or their regional Division office.  Also, all license agents including  those not selling big game permits,  have a list of other agents.  The first step in purchasing a permit  per-mit is to determine which buck deer  region or bull elk unit to hunt, and  which weapon type to use.  Once a hunter has done so he  must bring to the permit buying  location, the following: I. Correct  amount of money $23 for a resident  resi-dent buik deer permit, $30 for a  resident bull elk permit, $198 for a  nonresident buck deer permit or  $328 for a nonresident bull elk permit.  per-mit. 2. An additional $5 to purchase a  Wildlife Habitat Authorization.  Hunters ho have already pur  chased an authorisation must bring  pickoff attempt at first base.  walk and one hit batter to his winning  win-ning line.  With Coach Labrum extolling the  virtues of a quick start during practice,  prac-tice, Uintah players took him to  heart in the Park City game. The  Utes supplied starter Smuin with  three runs in the first inning on only  one hit, but their aggressive running  on the basepaths more than made up  for the lack of wood at the plate.  See Baseball page 19  it with them, or a previously purchased  pur-chased 1997 hunting or fishing license  li-cense that includes their authorization  authoriza-tion number.  3. All hunters born after Dec. 31,  1965 must bring proof they've completed  com-pleted a Division approved hunter  education course offered by a state,  province or country.  Those with questions may contact  the Division's Salt Lake City office  at (801) 538-4700, or their regional  Division office. i  Ute Soccer team shows  true grit with Lehi effort  by Eric F. Pye  Sports Writer  Some people might look at the  month of April (he Uintah High  School soccer team is having and  consider it a disaster. Following last  Friday night's 4-2 home loss to  Lehi, the team stands at 0-3 in region  re-gion play for the month and 1-4  overall.  Considering head coach Ed  Browning felt the team had a good  chance of winning all three games,  some people might think the team is  in a slump and heading the wrong  direction.  Those people don't know the indomitable  in-domitable spirit of the only head  coach the Utes have ever known.  \"We were all disappointed with  our performance in a couple of  those games, but that is what sports  arc all about. You learn from your  mistakes and come back with a better  bet-ter effort the next game. I was not  only pleased, but proud of the way  the kids fought so hard to compete  in the Lehi game. Despite trailing  throughout the game, the kids  played some of their best soccer of  the year, what more can you ask  from your players?\" Coach  Drowning said.  Indomitable. Someone with less  i;  ,! f  .'V -'-5; ! .  Lehi and Uintah players batue  Lady Utes  setback in  by Eric F. Pye  Sports Writer  The Lady Ute fastpitch Softball  team had been on cruise control  throughout most of their season,  blowing by opponents in an almost  effortless fashion. The team had only  on-ly dropped one game until last  Tuesday.  In what must have been an almost  shocking turn of events, an opposing  oppos-ing pitcher came to town and controlled  con-trolled the game, leading her Lady  Pioneer team to a 7-3 victory over  Uintah.  \"It wasn't so much that she overpowered  over-powered us, she just had excellent  control. Her coach was actually  calling the pitches and placement  from the bench,\" Lady Ute head  coach Leon Mansfield said.  It wasn't just the Lady Pioneers  pitching that was so tough either.  Lehi committed just one error  4  W - V fc  - JtS  mm  1 V. -  ft , PA  Lady Utes Liz Cranney watches ball go into catcher's mitt like Pete  Rose during recent contest. Cranney has been hitting like Pete  Rose too with a batting average hovering near .600 for the season.  character might get distracted by  the tough losses, but this coach and  this team will have none of it.  Actions always speak louder than  words, and the Uintah soccer program  pro-gram made a strong statement with  their effort Friday after what may  have been the low point of the season  sea-son in a Wednesday loss at  Wasatch.  Heading into last week's play,  Uintah was tied for third in Region  10 with Lehi and Wasatch all with  identical 1-2 records. Doth coach  and team fell they could and  would win both games to solidify  a strong playoff berth for state.  It became obvious early in the  Wasatch game that for whatever  reason, Uintah was not anywhere  near their best. While the Utes appeared  ap-peared tentative and scattered,  Wasatch was clearly focusscd as the  Wasps built a 3-0 lead by halftime.  During halftime, the Ute coaching  staff put it to the kids. \"Wc basically  told them (hey had worked too hard  and had too much talent to play the  type of soccer they were playing. It  was almost embarrassing, and we  told them that,\" Drowning related.  Again, as they have in the past,  the team responded with a strong  second half start. Uintah scored two  goals to pull within one at 3-2 dur  1 V I  for control of corner kick out In front  suffer first  region play  (throughout the contest while their  catcher gunned down three different  Lady Ute baserunners. \"They  played a solid all-around game,\"  Coach Mansfield said.  On the Uintah side of the ledger,  the same could not be said. \"I think  we came into the game a little too  loose,\" Mansfield said, \"we may  have been overconfident and we  definitely didn't give Lehi the respect  re-spect they deserved.\"  Still, it appeared Uintah would  cruise through the contest. The girls  built a 3-0 lead heading into the  fifth inning which is usually  enough for Ute hurler Janell Jensen.  But as the final score attested,  Jensen was not her usual dominat  ing self.  Despite leading 3-0, Jensen had  not recorded one strikeout. Lehi  was hitting her, but up to the fifth  See Lady Utes page 19  'S i i  '-J  Jf f  ing the first 10 minutes of the 40  minute half. Freshman Ryan Shields  scored his first varsity goal of the  season while teammate Levi  Howcroft scored Uintah's second  goal on a penalty kick.  Trailing by just one, Uintah  seemed poised to seize control of  the contest. Unfortunately, a scries  of events followed which would  prevent that from happening.  Shortly after the team's second  goal, keeper Jarcd Calder was yellow  yel-low carded for what appeared to be  a kicking motion against a Wasp  player after a collision occurred  while Calder was making a save.  The Ute player went ballistic for  what he thought was an unfair and  inaccurate call. His reaction was  greeted by a red card and automatic  ejection. It also gave Wasatch a  penally kick and eventual goal to go  up 4-2.  \"Jarcd fell the official had missed  the call which he might have. But  that still docs not give a player the  right to verbally abuse an official.  The official was well within his  right to red card Jarcd.\" Coach  Drowning said.  Jeremy Pcirce replaced Calder in  See Soccer page 19  of Lehi goal during first halt.", "parent": 22653316, "version": 1739893360762552320}, {"id": 22653335, "paper": "Vernal Express", "type": "page", "date": "1997-04-16T00:00:00Z", "year": "1997", "month": "April", "day": "16", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/2a/5f/2a5fd518abc063c25d42cefc082e1ec8f2aac616.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/20/02/200278b76734cecf28474003528ae2cede8a5a4f.pdf", "page": 19, "ocr": "Vernal Express Wednesday, April 16, 1997 19  SPgg  Eastern Conference  ATLANTIC W L GB LstlQ Strk  Miami 59 20 - 7-3 L2  New York 54 25 5 5-5 LI  Orlando 45 34 14 5-5 W4  Washington 41 38 18 7-3 Wl  New Jersey 24 54 34.5 3-7 L2  Philadelphia 21 58 38 2-8 L8  Boston 14 65 45 1-9 LI  CENTRAL W L GB LsUO Strk  Chicago 69 11 - 8-2 Wl  Atlanta 54 24 14 8-2 W3  Charlotte 53 26 15.5 8-2 W8  Detroit 52 27 16.5 4-6 LI  Cleveland 40 39 28.5 4-6 LI  Indiana 39 40 29.5 6-4 W2  Milwaukee 31 47 37 3-7 W2  Toronto 28 51 40.5 3-7 L3  Western Conference  MIDWEST W L GB LstlO Strk  Utah 60 18 - 9-1 LI  Houston 54 25 6.5 8-2 Wl  Minnesota 39 40 21.5 6-4 Wl  Dallas 23 56 37.5 1-9 L3  San Antonio 20 59 40.5 3-7 L3  Denver 20 59 40.5 1-9 L8  Vancouver 13 67 48 1-9 Wl  PACIFIC W L GB LstlO Strk  L.A. Lakers 54 25 -- 8-2 W2  Seattle 54 25 - 5-5 LI  Portland 46 33 8 6-4 Wl  Phoenix 39 40 15 9-1 W2  L.A. Clippers 36 43 18 5-5 W2  Sacramento 33 46 21 4-6 W2  Golden State 30 50 24.5 5-5 Wl  Baseball  continued from page 18  After Long walked, Espindola  reached base on an error. After  Caldwell sacrificed both runners up.  Long scored on a passed ball.  Espindola scored on Smuin's singles  sin-gles and Smuin scored when  Culpepper's fly ball was mis-judged  by the Miner right fielder. It would  be all the support Smuin would  need.  Uintah added a run in the fourth  and one in the fifth for the final 5-1  score after Park City scored their  only run of the game in the fifth on  a double and single. The fourth inning  in-ning run came when Jeremy Strange  walked, advanced on a Hatch sacrifice,  sacri-fice, stole third and scored on a wild  pitch.  The fifth inning score came on an  Espindola leadoff double followed  by a triple from Caldwell .  The team took on Fruita, Colo.  Monday at Mesa State College and  stayed on the road for a Tuesday rematch  re-match of last year's first round state  playoff game with Emery. Uintah  will travel to Union this Friday to  take on the Cougars in a 3 p.m. varsity  var-sity contest and take on Wasatch at  home next Tuesday in an effort to  avenge the team's only region loss  to date.  Valley  National  Dart  Association  Vernal Area  V 4 '  A-  for\"  Cl  'ill  11  Ute goal keeper Jeremy Peirce was kept plenty busy in his lirst  full game against Lehi. Here, Peirce knocks the ball over the bar.  j5&  ri high r)  VALLEY w  jffi NURSERY  WHERE GOOD GARDENS BEGIN  RootrvH. Uith  S North FWt Wt  FOLKS ARE PLANTING  SNAPDRAGONS  THEY LIKE IT COOL  Plant one of our  LARGE POTTED  TOMATOES  in a reliable  WALL O' WATER  IF  BfiUf  GOOD SUPPLY  WALLA WALLA  SWEET ONIONS  Don't (tepir, Warmer  enlNr will com. But  DON'T WAIT!  we hv many  thingj ht you can  PLANT NOW!  XT  Ed Rowley' High Valley Notes  It haul to find a Catalog le fl ed one Pfclu'ei  ww hand d'awn on the rough par, they avowed b-q  yield bp'ng enjoypd by henry two Dad had me read  the descnptiont at he dectted on the out we would mal  at h imie county fx1 GVe I Continued to read n soa'e  mompnfs. and dream Ot huae harvests It was a peasant  combinalion Ot imaqinalion and realty Now you can  en. nr n eniov) those frame rpeiinns win Otrf Nostaga  SJ Some MM use the colorful packets tor wail deT.oat-oh V'eyou'e  here slat your young ones on the road to dei-gntM aa'de\"j tMh Out  K-dseedS And find other tavorrte vanet-e in Our ve\" large general seed J-  play Ciw tt  (if  Lady Utes  continued from page 18  inning, they were all going right at  Uintah players.  During the fifth inning, it all came  unraveled on Uintah. Lehi parlayed  two singles and three Lady Ute errors  er-rors into four runs and a lead they  would not relinquish. Lehi added  three insurance runs in the seventh  on four hits including a triple and  home run for the final 7-3 score.  \"You could see Janell was struggling.  strug-gling. What you couldn't see was  the injury she sustained to the little  finger of her pitching hand prior to  the game,\" Coach Mansfield said,  \"she was probably throwing at  about 75 percent of normal.\"  For the previous ten games,  Jensen had been averaging around  seven strikeouts per game. Against  Lehi she had none.  Despite scoring just three runs,  Uintah hit the ball well. The Lady  Utes pounded out 11 hits including  triples by Tracie Jenkins and Amy  Smuin and doubles from Jensen and  Kelee Hanchett. Mande Dugan continued  con-tinued her torrid hitting streak with  three singles.  Uintah missed a potentially big  inning in the first when Jenkins and  Dugan singled to start the game, but  Jenkins was thrown out trying to  steal second. Smuin followed with a  triple, scoring Dugan but was  thrown out at the plate to complete  a 1-3-2 double play for Lehi on a  Bonnie Hatch grounder.  Saturday, the team traveled to Salt  Lake City to compete in the Polar  Bear tournament, only to find out  their entry had not been sent last  year. Fortunately, another team had  to drop out of the tournament and  the directors allowed Uintah to fill  w  Crack'dPotl 203  Crack'dPot2 169  Weston 1 159  Weston 3 151  Cassidy's4 132  Weston 2 128  Cassidy'sl 121  Crack'dPot3 117  Bed Rock 2 93  Weston 4 71  Cassidy's 3 34  Top Five Players  Wins  Scott Gustaveson 71  Bryan Hicks 50  Al Beck 50  Dwayne Parker 49  Clark Gustaveson 49  Soccer  jS  r r X Cf i $ 'if  V  -.1  - M  i 1  Lady Ute pitcher Janell Jensen grimaces with pain during pitch.  in for the final two games.  The Lady Utes made the most of  the opportunity. The girls handled  West Jordan in their first game 6-2  and then blasted Logan 18-3 in the  second game.  Jensen, still suffering from her injury,  in-jury, pitched both games. Again she  recorded no strikeouts, but was still  good enough for the wins. \"Even at  75 percent, Janell is by far the best  pitcher we have,\" Coach Mansfield  explained.  The West Jordan game was highlighted  high-lighted by a five-run sixth and final  fi-nal inning. Smuin singled, Hatch  doubled and Cranney homered to  start the inning. Jensen, Trisha  Oldroyd and Dawna Wallace had  consecutive singles for the other  two runs.  Against Logan, Uintah was too  much right from the start. The team  scored three in the first, five in the  second, one in the third and nine in  the fourth. Uintah collected eight  hits and sent 14 batters to the plate.  The girls will take on Union at  Roosevelt this Friday and then host  Wasatch next Tuesday. Both games  feature a 3 p.m. varsity starting  time.  II you have any  Sports New  Calf  EricPye  at the  Vernal Express  789-35H  continued from page 18  goal, but the damage was done.  Wasatch went on to a 5-2 decision.  In Friday's home contest with  Lehi, Uintah began the game playing  play-ing with fire. Almost all the action  took place in Lehi's half of the field.  Uintah had several great scoring opportunities,  op-portunities, but each shot barely  missed its mark.  Halfway through the half, Lehi  beat the Ute defense down the field  and scored on a bouncing shot  which keeper Peirce partially  blocked. The ball trickled past  Jeremy and as he was reaching to  pick it up, dribbled across the goal  line for (he score.  The Pioneers struck again just two  minutes later in a similar fashion.  Again Lehi beat (lie Ulc defense  back. This time the Pioneer player  took a running attempt which blasted  blast-ed right at Peirce. Jeremy got both  hands on the bull, but it was (raveling  (ravel-ing so fast it shot through his outstretched  out-stretched arms and into the goal for  a 2-0 lead.  \"Those are the kinds of shots  Jeremy will stop in (he future. He  hasn't played a bit of keeper for us  and it was a learning experience for  him,\" Drowning explained, \"I  (bought Peirce did an excellent job  for us in goal.\"  Levi liowcroft responded for  Uintah wiih a goal of his own to  make il2-l al halftone.  Lehi scored the Tint goat of the  second half to go up 31. Uiniah responded  re-sponded when Andy Oacta scored  on a penalty kuk to pull within 3-2,  but could get no clor. The  Pioneers added a laic goal for the final  fi-nal 4-2 score.  \"We told the kids after the Lehi  game if they played with (he same  cnthuMatm and heart the ft( of the  seaMin that they played with in (he  Lehi game, they wouldn't loe an  other contest,\" Browning said.  Uintah trawls to South Summit  today (Wednesday) fot a 3.30 varsity  varsi-ty matchup and Park City Friday  with game time slated fot 3 p m.  j f A . - . .... . -jii - u-te Lm4 . Jto. . fct .e VteMSin  Trisha Oldroyd takes the snap throw from catcher Bonnie Hatch in effort to pick off runner at first  !yW;)B.tiMja  mm  !!!mmitTn..wvif.rwt\"fyw'rn'S\"'.tilf \"th'..j.v- .;. f '.j,i i , '  i id m n  S tr I A II H liH mm II n Mil l A 1 I I I I . 1  J Premium All-terrain Steel  O A dc oeuea Ligm i rue naaiai  Lt235v75R15C  LI23565R16E $99.05  31x10.50R15C.......S96.95  U26575R16C $95.95  LI24575R16E $110.95  LI22575R16D $97.95  40.000 mil touted y  Umqu ltM bioett lmnti  v premium (tniin,  wMittM HAction.  EXPLORER  ALL-SEASON STEEL-BELTED RADIAL  $095  W P1550ni3  P17580R13 S37.95  P18580R13 S40.95  P19575R14 $44.95  P20575R14 $46.95  P21575R14 $48.95  P20575R15 $47.95  P2255R15 $51.95  P23575R1S $53.95  40 000 miM ITMMI Mrty Of Itoay  TttO Mod kUtlAftt Uflwrt Iw K1V A  CO-OP  Country Squire 4WD  All position, alt terrain Steel Belted Radial  Mai 0ftf fruci perfowi Ma ptunengt can.  v ; 1  60  95  P23575R15  P2655R15....H.$63.95  LI23575R15 $66.95  30X9.50R15 $76.95  31x10.50R1S. $80.95  U23585R16. $79.95  LI24S7SR16. $84.95  L126S75R16 S66.0S  ROOSEVELT  West HWY 40  722-2542  VERNAL  990 So. 1500 East  78M616  TIRE CENTERS  a Itartfirloet, M -H\" ' j V'a'.o nr-  JPOOR COPYl", "parent": 22653316, "version": 1739889925626527744}, {"id": 22653336, "paper": "Vernal Express", "type": "page", "date": "1997-04-16T00:00:00Z", "year": "1997", "month": "April", "day": "16", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/9a/51/9a518cf86bd6857673104722a4b5f68e3a447532.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/d6/4b/d64b3d1c786c1765375941b669c4812e7c7f9457.pdf", "page": 20, "ocr": "20 Vernal Express Wednesday, April 16, 1997  Uintah track team splashes in and out of  East Invitational as J.V. picks up the slack  by Eric F. Pye  Sports Writer  Hoping to pick up valuable experience  expe-rience at a big meet, Uintah head  track coach Gary Galley had to settle  set-tle for picking up valuable experience  experi-ence at a little meet.  \"We were all looking forward to  the East Invitational last weekend.  We knew some of the top athletes  and teams in the state would be  there. It would have been fun,\"  Galley related.  The \"would have been\" came  about w hen the meet was postponed  due to rain, snow and wind  Saturday morning after only a few  events had been run.  \"It wasn't really feasible for us to  go back out there Monday. We  could have only taken a few kids,  which wouldn't have been fair to  the team,\" Coach Galley said in  talking about the postponement  from Saturday to Monday afternoon.  after-noon. Of the handful of Uintah athletes  who did get the opportunity to compete,  com-pete, a couple made the most of the  moment.  Brian James qualified for state  with his effort in the 100 meter dash  while Anthony Thomas missed by  just one tenth of a second.  Yvonne Allen qualified in the  javelin with a toss of 106'4\" and  just missed the shot mark by 11  inches with a throw of 30' 6\". Anna  Glenn was just four inches off in the  long jump with a 15'4\" effort while  teammate Hillary Enloe was also  close with a leap of 15'.  The Ute J.V. squad hosted a Basin  meet last Wednesday and dominated  dominat-ed through sheer numbers. \"It was  good to see the younger kids get a  chance to shine against equal competition,\"  com-petition,\" Galley said. The J.V. team  won 13 events, six by the girls and  seven by the boys. The varsity  squad will be back in action  Saturday at Delta.  The following results represent  the Uintah athletes which finished  in the top six from the Uintah  J.V.Union J.V.AltamontTabiona  meet held Wednesday, April 9 in  Vernal. (Q.T., Q.H., Q.D. represent  this year's state qualifying standards  m each event.)  Boys:  110 M Hurdles  Q.T. 15.95  Win 17.75  100 M Dash  Q.T. 11.56  Win 11.87  Kennie Garcia (1)-1 1.87  Joey Morton (3)-12. 17  Danny Morton (6)-12.25  200 M Dash  Q.T. 23.30  Win 24.78  Brett Wilhelm (D-24.78  Joey Morton (3J-25.70  Jason Woods (4)-26.40  Danny Morton (6)-26.74  300 M Hurdles  Q.T. 41.55  M  m  I ROOFING  Ml  Win-7.32  Kennie Garcia (l)-47.32  Robert Goodrich (2)-53.16  Sean Anderson (3)-53.47  400 M Run  Q.T. 51.93  Win 58.30  Garrick Hatch (l)-58.30  Danny Morton (2)-58.50  Kendell (5)-1:04.32  Paul Justice (6)-1:05.87  800 M Run  Q.T. 2.02.50  Win 2:28.40  Chris Busch(l)-2:28.40  Richard Leake (2)-2:35.96  Neal Snow (4)-2:43.43  Jason Simon (5)-2:48.82  Carl Foley (6)-2:53.25  1600 M Run  Q.T. 4:41.40  Win 5:26.83  Ben Bingham (l)-5:26.83  Sidney Merkley (2)-5:30.43  Wes Loudermilk (3)-5.39.91  Jason Dilworth (4)-5:44.69  Neal Snow (5)-5:55.12  Anthony Thomas (6)-6:05.45  3200 M Run  Q.T. 10:18.40  Win 11.45.43  Ben Bingham (1)-1 1:45.43  Nick Weber (2)-11:46.75  Wes Loudermilk (3)-12:26. 17  4 X 100 M Relay  Q.T.-45.50  Win-48.33  Uintah (3)-51.22  Medley Relay  Q.T. 3:49.90  Win  Uintah ()  4 X 400 Relay  Q.T. 3:36.20  Win  Uintah ()  High Jump  Q.H. 6'1\"  Win 6'1\"  Trevor Richins (2)-6' 1\"  Brett Wilhelm (5)-5'6\"  Shot Put  Q.D. 44'6\"  Win 41'2\"  Greg Reynolds (5)-34'8.5\"  Long Jump  Q.D. 19'11\"  Win 19'  Discus  Q.D. 129'00\"  Win 120'9\"  Ryan Richins (5)-86'll\"  Javelin  Q.D. 159'4\"  Win 1447\"  Moriah Haws (4)-1 12' 2\"  Lane (5)-95'  Paul Justice (6)-93'2\"  Girls:  100 M Hurdles  Q.T. 17.26  Win 20.10  Nccia Anderson (2)-20.28  Kendra Zweifel (3)-22.59  Amy Hawkins (4)-23.28  100 M Dash  Q.T. 13.25  Win 13.07  Lacey Dearth (3)-14.03  Hillary Enloc (4)-14.06  200 M Dash  Q.T. 26.90  Win 30.56  Tiffany Murray (2)-30.65  I SIDING 1  fiTPlfflfil'lii)  Ask us about financing  emED tjr  Sr AirEbw  Licensed Insured  RAINGUTTERSj AWNINGS!  00  Ute high jumper Hillary Enloe  300 M Hurdles  Q.T. 48.95  Win 56.63  Rhonda Tollefson (l)-56.63  Jamie Muir (3)-59.64  Vera Murray (4)-1:03.97  Jennie Millet (5)-1:04.21  Lori Crowther (6)-1:09.13  400 M Run  Q.T. 1:00.90  Win 1:10.10  Trisha Cochran (1)-1:10.10  Tiffany Gibbons (2)-l:13.09  Mary Hansen (4)-l:14.34  Lacey Dirth (5)-1:14.46  Jamie Muir (6)-1:14.47  800 M Run  Q.T. 2.27.75  Win 3:28.67  Jill Hunting (l)-3:28.67  Carrie Mathis (3)-3:43.17  Karen Walker (4)-3:50.45  1600 M Run  Q.T. 5:35.85  Win 6:41.88  Jennie Millet (2)-7:32.55  Carrie Mathis (3)-7:55.59  Karen Walker (4)-7:55.86  3200 M Run  Q.T. 12:28.50  Win  4 X 100 M Relay  Q.T. 52.63  Win 57.64  Uintah ( I )-57.64  Medley Relay  Q.T.-4:37.95  Win 5:17.26  Uintah ()  4 X 400 Relay  Q.T. 4:19.10  Win 5:16.91  Uintah (l)-5: 16.91  High Jump  Q.H. 5'u\"  Win 4'4\"  Sally Caldwell (l)-4'4\"  Becky Warburton (2)-4'2\"  Ashlie Goodrich (3)-4 1\"  Shot Put  Q.D. 31'5\"  Win 26\" II\"  Emily Malouf (4)-24' 10\"  Mary Hansen (5)-24'6\"  Heincr (6)-23'll\"  1  successfully \"flops\" over the bar.  Long Jump  Q.D. 15'8\"  Win-Discus  Win-Discus Q.D. 94'0\"  Win 77'4.5\"  Mary Hansen (4)-69'4\"  Emily Malouf (5)-68' 10\"  Javelin  Q.D. 100'6\"  Win 74' 11\"  Roxanne Rogers (2)-68'8.5\"  Mary Hansen (4)-59'4\"  Emily Malouf (5)-55' 11\"  Region 10  High  School  standings  Boy's Baseball  W  2  2  2  l  0  L  l  1  1  2  2  Uintah  Wasatch  Lehi  Union  Park City  Girl's Softball  W  3  2  l  l  0  L  0  1  2  2  2  Lehi  Uintah  Union  Wasatch  Park City  Boy's Soccer  VV L T  Park City 4 0 0  Morgan 3 1 0  Wasatch 3 2 0  Lehi 3 2 0  Rowland Hall 2 3 0  Uintah I 4 0  South Summit 0 4 0  Basin chapter  prepares to  salvage eggs  The Uintah Basin Chapter of  Pheasants Forever is preparing to  salvage pheasant eggs from nests  disturbed during haying operations.  This is the fifth year that the organization  orga-nization and area landowners have  cooperated in this effort.  Studies have shown that a high  percentage of first nesting attempts  arc destroyed cither by predators or  by haying operations in alfalfa  fields. Area farmers collect any undamaged  un-damaged pheasant eggs exposed  during mowing operations. If not  collected, predators or the elements  rapidly ruin the eggs. Eggs are  quickly gathered up, kept warm and  put in incubators operated by the  group. The hatched chicks arc then  adopted by qualified youth in (he  Uintah Basin and raised to  approximately 10 to 12 weeks of  age.  The pheasants arc then banded  and released into good habitat, At  least 25 percent of the raised birds  arc being returned to the landowners  landown-ers who salvaged the eggs.  In the Vernal area anyone who  observe pheasant nests during  mowing operations Is requested to  contact Tom Pick at 789-2100 (day)  of 7810845 (evenings), In  Roosevelt, contact Don Coin or  Brett Prcvedcl at 722 4621 (day) or  646-3429 (evenings),  For current  UDOT 24 hour road  conditions report  Dial  1-800-492-2400  Snapper's A.I.R.  Mower Mulches  i While It Mows!  r i  FRP216012  SNAP-CREDIT  M Of &mm As CuU-  Subjecl to approval on Snap-Credit  Finance Charges will accrue at a rate  which will vary. The APR in effect on  December I, 1996 was 20 05. A  minimum 50 cent finance charge will  be assessed except in NC (Zero  minimum) an 1 6 APR wiH not vary  in CO., IA., ME., NC., and Wl. Il  your promotional purchase and any  optional insurance charges ore paid  in full by me promotional due date, oil  accrued finance from dale of  purchase until promotional due date  will be removed from your account.  690  PERRY MOTOR CO.  '96 GRAND PRIX  White 4 Door V-6  Auto 'Cassette Player  24,000 Miles  '93 BONNEVILLE  Red 4 Door Auto V-6  Power Seats, Windows &  Doors, Tilt, CruiseCassette  '96 CENTURY SPECIAL  Maroon 3.1 L 'Power  Windows & Doors, Tilt, Cruise  Cassette 18.000 Miles  '96 REGAL CUSTOM  Green 3.8 L Power Windows  & Doors, Tilt, Cruise 'Cassette  19,000 Miles  '96 LeSABRE CUSTOM  White 3.8 L Power Seats,  Doors, Windows, Tilt. Cruise  Cassette 25.000 Miles  '93 CENTURY SPECIAL  Blue 3.1 L  Tilt & Cruise 'Cassette  59,000 Miles  '92 0LDSM0BILE  NINETY EIGHT ELITE  Blue 'Cassette  43,000 Miles  '89 CADILLAC  FLEETWOOD  Maroon Cassette  '91 SUBARU  LEGACY  Silver 44 W.-iRon  Auto 'Cassette  '95 CHEVEROLET  CORSICA  Orange Aulo V6  26.000 Miles  '92 CMC  SAFARI  While All Wheel Drive  Auto V6  '79 CHEVROLET  12 TON SILVERADO  Tan 'Auto 44  Long Bed Diesel  93 FORD F-250  34 TON EXT. CAB  , 'Blue 44 L04 Bed  55.000 Mile 'Diesel  91 TOYOTA  PICKUP  Bed 4 Cviifdet  4i4 5 Speed  463 E Hcln  As Low As  6 HP Big Six Engine  Designed To Tackle The Toughest  Mulching Conditions  Six-Speed On-The-Go Shifting  Easy Folding Handles Reduce  Storage Space  Six Height-Of-Cut Selections Span  1 .2 to 3 75 inches  gt3flffBBHL  Anything Less Just Won 't Cut It!  MILT'S ACE  HOME CENTER  W. Main Vernal 789-2150  '95 GRAND AM  Aqua 4 Door 4 Cylinder  Auto CD& Cassette  28,000 Miles  '91 GRAND PRIX  White 4 Door Auto  V-6 'Power Windows & Doors,  Tilt, Cruise 'Cassette  '96 CENTURY SPECIAL  Green 3.1 L Power Windows  & Doors , Tilt, Cruise 'Cassette  15,000 Miles  '96 REGAL CUSTOM  White 3.1 L 'Power Windows  & Doors , Tilt, Cruise 'Cassette  28,000 Miles  '94 PARK AVE. CUSTOM  White 3.8 L 'Power Seats,  Doors, Windows, Tilt, Cruise  Cassette 41.000 Miles  '95 SKYLARK CUSTOM  White 3.1 L Tilt & Cruise  Power Doors & Windows  Cassette 39,000 Miles  '88 OLDSMOBILE  NINETY EIGHT REGENCY  Red Tilt & Cruise  Cassette  '79 CADILLAC  DEVILLE  Tan Cassette  '89 FORD  ESCORT  White 4 Cylinder 5 Speed  Great Kid's Car  '89 FORD  LTD  Green 4 Door V6  17.000 Actual Miles  94 CHEVROLET  34 TON SILVERADO SLE  Gteen Silver Emended Cot)  Lone Bed 350 'Auto 43.000 Miles  91 FORD  EXPLORER  While V8  44 (Cassette  '89 FORD F150  12 TON  ijmwn MO  361 76.000 Mile  94 CHEVROLET  BLAZER  Oeefl (Auto 4i4  Cassette 28.000 Mite  Vcmd 709-211", "parent": 22653316, "version": 1739888558409252864}]}