{"numFound": 18, "start": 0, "numFoundExact": true, "docs": [{"id": 22650614, "paper": "Vernal Express", "type": "page", "date": "1995-01-11T00:00:00Z", "year": "1995", "month": "January", "day": "11", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/73/04/7304ab35678833a5bbb1b768284de26fd91f052f.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/ee/4a/ee4a53606132520965ff2ece271839e3e3b2ef54.pdf", "page": 1, "ocr": "16-2-F  SLC, UT 84101  New yeei vtetoriee.page 14  City revamp cutfew.....pge 3  Mta hunt contlMUts.;..pages 4  ;V Off to RuMUn page IX  ';- 'Pro shop deluxe ............page 13  ElanchttEI3 ! .,... page 18  Single Copy ,50$  WEDNESDAY, January 1 1, 1995 Vernal, Utah 84078  103nd Year No. 2 18 Pages  CR UT PRESORT -152  C 123199  UTAH PRESS ASSOCIATION  307 W 200 3 It 5005  i ti 77rm  f Chefk  I Ii&ide  i vis  Lk  by Steven Wallls  Express Editor  The Naples Planning and Zoning  Commission jerked the welcome  mat out from under a proposed  expansion of a Salt Lake City business  busi-ness into an industrial area on east  Highway 40.  Last week, the Uintah County  Commission agreed to sell 40 acres  it had acquired for delinquent taxes  to Fox Valley Tannery, of north Salt  Lake City, to allow the company to  expand to the area. The property is  off the highway frontage in Naples  City, but is accessed from 2000  South to the west and adjoins the  Vernal Airport. The company was  planning on building a new plant on  the site which would employ over  30 people and have an annual payroll  pay-roll of over $800,000. \"It is a good  industry for the area,\" said Marie  Yoder, Uintah County economic  development director.  The project was acceptable to  commissioners, the county accepted  $53,090 to be placed in escrow for  the purchase of the property, but the  Naples City Commission Tuesday  night unanimously voted not to  allow the business because it did not  meet the requirements of an industrial  indus-trial one zone. Naples City's industrial  indus-trial one zone does not allow explosive  explo-sive industry and animal by-product  companies.  \"We are not against economic  development, this business just  doesn't belong in an industrial one  zone,\" said Craig Blunt, Naples City  manager.  To change the zoning in the area,  BooCi Clnffffs iraroclh)  Damxril sonagjlhiti toy dostiGicti  by Steven Wallis  Express Editor  The Uintah Special Service  District is calling for the immediate  possession of less than an acre of  property in a remote area of the  Book Cliffs as a way to open the  area to public access.  The property belongs to Rancher  Bert Delambert, who has maintained  main-tained the road and limited access to  the area for the past 17 years. By  condemning the two pieces of property  prop-erty in front of Delambert's ranch  house, the Special Service District  members believe it will establish a  clear right-of-way for public access.  Gayle McKeachnie, attorney for  Delambert, said the rancher does not  want \"a lot of people driving  through his unprotected ranching  operation. The property is right in  the middle of his DeLambert's  property.\"  \"It is not about the value of the  property, it's about having to  change my whole operation,\" said  Delambert. \"I believe they don't  have right-of-way to any of the  Zion's bank building  to ireturn to original state  The old Bank of Vernal building  is getting a facelift. No, not to make  it look more modem, but to restore  its original outward appearance.  The building was the first of its  kind, built in the early 1900s. It is  now owned by Zion's First National  Bank.  Lynn Runolfson, Zion's Vernal  manager, said he went over to  Thome's Studio, across the street,  and found an old photograph of the  building.  \"I am uncertain what the date was  of the photograph, but I suspect it  was around 1928,\" he said.  The plans are to restore the building  build-ing as close to the 1928 picture  which is printed on the architect's  plans.  Lowell Fox shows one of the end products of his business, a tanned deer hide. The businessman  wants to come to Naples, but zonina commission denied the request.  the business would have to go  before the Naples City Council. \"It  would then depend on the desires of  the people,\" Blunt said.  In a presentation to the Uintah  County Commission Tuesday afternoon,  after-noon, Lowell Jimmy Fox, owner  and operator of the business, said  the tannery does not produce animal  by-products. Animals are not  slaughtered at the site. The compa  road.\"  Of the 5 miles of road which goes  down the narrow valley of  Delambert's ranch, just over a mile  is on public ground. The rest is private.  pri-vate. The only people who use the  road is Delambert, his wife, a ranch  hand and workers for Bear Tooth  Oil who attend to a gas well in the  area.  \"There is no area anyone wants to  go, that they cannot get to without  going through my property,\" said  Delambert.  Special Service District Manager  Thorn Wardell said it is not the  intent of district to build a highway  through the property. \"We would  just like to establish the county  right-of-way.\"  Delambert runs his cattle on BLM  land, but along the road through  Main Canyon is where his cattle  calves.  September 1, an appraiser, Zane  Bergeson & Associate, valued the  two pieces of property: .083 acres at  $50 and .453 acres at $250.. The  The restoration of the outside of  the building will be complete in a  couple of weeks, said contractor  David Delight, of Certified  Construction of Lay ton.  \"It is such a beautiful building, I  don't know why anyone wanted to  cover it,\" he said.  Small leaded glass windows will  be placed above the present windows,  win-dows, and the balcony and pillars  on the front will be restored.  Next summer the inside of the  building will be completely remodeled  remod-eled to allow tellers to assist with  the drive-up windows, Runolfson  said.  The safe that held the bank's  money when it was established is  still being used by the bank. It will  fl  ny piBcesses hides in a manner that  meets EPA and Department of  Environmental Control requirements.  require-ments. \"We have spent over half a  million in. pollution controls.\"  Kathy Kempton, who visited the  tannery, said \"It does not smell and  there is no pollution. It would be a  marvelous business for this area.\"  Commissioner Lorin Merrell, who  lives in the area proposed for the  property is about a half mile east of  Delambert's home. Wardell said  that the road was changed years ago  to cross over a small reservoir dam  in front of Delambert's home. The  condemnation of the property  would allow the district to put the  road back to its original route and  bypass a locked gate Delambert  maintains on BLM land adjoining  the south end of his property. \"The  only access from the north is also  through a locked gate on BLM  land,\" said Wardell.  Prior to the action filed in Eighth  District Court, the Special Service  District passed a resolution determining  deter-mining that public interest and  necessity require the acquisition of  the property, which is located just a  half a mile from south Uintah  County Border. The road was originally  origi-nally planned to be part of the Seep  Ridge Highway, linking Uintah  County with Grand County going  through one of the most wildlife  sensitive and mineral-rich areas in  the state.  See Ranch on page 3  be replaced with the remodeling.  The bank is featured in \"Ripley's  Believe I or Not!\" and on \"The Rest  of the Story\" by Paul Harvey  because all of the outside bricks  were delivered by the U.S. Postal  Service.  The Bank of Vernal opened Dec.  14, 1903. It had bulletproof counter  and screen for protection. In 1916 it  moved to a new building for which  pressed bricks, all wrapped in paper  and packed in crates of 50 pounds  were transported from Salt Lake  City by Parcels Post 407 miles, yet  within 150 mile zone.  As Vernal was without RR, the  mail contractor's equipment was  inadequate to move the brick the  last 65 miles, so residents of Vernal  PCI  I  I  k e0 Z A?  tannery, echoed Kempton's feelings.  feel-ings. At the county meeting, Mayor  John Mathis, Naples, said he was  not opposed to the business, but  was concerned with the process in  which the business deal was put  together.  \"In my mind, I question why  attracting a business into a community  commu-nity without it knowing and when  Contractor David Delight removes  building to its 1928 appearance.  helped.  Post Office regulation were  promptly changed as Uncle Same  ; ' . - t , . - $ ' . -  1 . ' r f.TITl ' - - \" \"T .JL  t ' ' .jlllli '\"' 111 ft-\"- 11 \" j  ' 1 3 u , .1  ''til i I ii ,J \"- -f. , . .  the area is not properly zoned,\"  Mathis told Uintah County  Commissioners.  Yoder said that on at least two  occasions, she had informed Naples  City Manager Craig Blunt that the  business was going in. \"I got on the  city council meeting agenda as soon  as possible after the deal was ready  to be announced,\" she said.  Other residents in the Naples area  question why they were not allowed  to bid on the property.  Commissioner Lorin Merrell said  that since the property was in an  industrial zone, the county reserved  it for an industrial development. An  opinion by the Uintah County  Attorney's office states that \"The  county is under no obligation to  advertise the property or solicit  competitive bids for the property.\"  According to James Drollinger  who represents the owner of Fox  Tannery, the project was not well  received by Naples.  Tuesday night he said \"I believe  the project is dead. There are other  communities that have offered to  accept the project.\"  \"There is no way I will subject  these people to that Naples planning  plan-ning and zoning meeting again,\"  Drollinger said. \"They came in with  their minds already made up and  read a canned statement.\"  Yoder said she has not giving up  on the business coming to Vernal  and will begin looking for other  sites in the area.  \"The problem we are finding is  there are few areas in the county  which are zoned industrial,\" she  siding from Zion's Bank as part of  disliked \"moving buildings by  Pared Past.\" Postal regulations at  that time limited the weight of a  McKee  cleared of  charges  In a statement to the Uintah  County Commission Tuesday,  County Attorney JoAnn  Stringham said her office is not  seeking criminal charges against  Commissioner Glen McKee, nor  does an investigation of an incident  inci-dent in 1992 show that anything  criminal occurred when McKee  took his family part way to a  National Association of Counties  conference.  McKee said the accusations are  a personal vendetta against him.  The investigation centered on  McKee taking his family in a  county vehicle to Tulsa, Okla.  and then taking a commercial  flight to St. Paul, Minnesota to  attend the conference. He  returned by flying back to Tulsa  and driving the county vehicle  back to Vernal.  \"I feel bad about what I did,  but I did not intentionally seek to  take public money,\"  Commissioner McKee said.  \"Why is this coming up two  months after the election,\"  McKee questioned. He said he  believed it was a personal  vendetta against him.  The incident was brought to  the attention of Uintah County  Attorney's office in September  of 1993, the same time an investigation  inves-tigation was being conducted  into misuse of funds by Sheriff  Lloyd Meacham.  The incident was referred to  See McKee on page 2  restoration project to return the  single parcel to 50 pounds; there  See Bank on page 4  .v", "parent": 22650613, "version": 1739883997809344512}, {"id": 22650615, "paper": "Vernal Express", "type": "page", "date": "1995-01-11T00:00:00Z", "year": "1995", "month": "January", "day": "11", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/e5/18/e518448079e230873210361504a3d596be6cfcf5.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/b1/0c/b10c5b0a8328b6d21e09ddcd08f0db15c508d80d.pdf", "page": 2, "ocr": "Opinion and Commentary  2 Vernal Express Wednesday, January 1 1 , 1995  Jack Wallls  NFIB Legislative Agenda  The National Federation of Independent Business  (NFIB), the nation's largest small-business advocacy  group, has unveiled its 1993 legislative agenda.  According to Jack Paris, president of the organization,  organiza-tion, the agenda calls for sweeping reforms that will  get government, \"off our backs, out of our pockets,  and in the black.\"  The five area agenda calls for comprehensive reform  in the following places:  1. Starting a Regulatory Reform:  Strengthen private property rights and restrict takings.  tak-ings. Allow court challenges of regulations with broad  judicial review.  Use risk assessment and cost benefit analysis and  regulatory impact statement.  Cut paperwork 50 percent.  Sunset regulations every 5 years.  Establish a regulatory budget.  -Rewrite FLSA, OSHA, ADA, to eliminate burdensome  bur-densome requirements.  2. Cut and Simplify Taxes:  Cut and index capital gains taxes, eliminate them  on investments in small businesses.  Simplify tax accounting and reporting.  Create a simple EZ-SB tax form.  Exempt small business assets from estate taxes.  Boost expense limit to $100,000 on small busi  nesses.  Create safe harbor for independent contractors.  Restore home office deduction.  Create simple small business pension plan.  3. Make Health Care Available.  100 percent deduction for health insurance for  self-employment.  National purchasing co-ops for small business.  Insurance market reforms for health insurance.  4. End Legal Nightmares:  Limit punitive damages.  Proportionate liability on damage awards.  Discourage wasteful litigation by using \"English\"  rule.  Make superfund work.  Product liability reform.  5. Reduce the Deficit:  Balanced budget, tax limitation constitutional  amendment.  Legislative line item veto.  No unfunded mandates.  This is an ambitious agenda for change. It will be  interesting to see how far Congress and the President  is willing to make the changes suggested by NFIB.  Hopefully, some of them can be made very soon.  A omen oP things to come?  f HE'S AROUND ,  iBERE SOMEWHERE  PES-.: ,uUtfiOTME&  (Hi  PUBLIC FORUM  LETTERS TO THE EDITOR  What is your opinion? The Express welcomes letters from its readers  concerning any subject pertinent to the Uintah Basin. There are no  restrictions as to contents, if not libelous or vindictive and of reasonable  length (two typewritten double spaced pages). Letters must be submitted  submit-ted exclusively to the Express and bear the writer's full name, signature,  signa-ture, phone number and address. The name or names of those submitting  submit-ting letters must appear on all published letters. All letters are subject  to condensation. Letters express the opinion of the writer and are not  necessarily the opinion of the Express Editor.  Good going  Dear Editor,  In the hustle and bustle of the holiday season, I have neglected writing  this letter.  A week or so before Christmas, I foolishly placed my zipper bank bag on  the top of my car. I didn't miss it until I was going shopping. Unbeknownst  to me, two young men found it and somehow made a connection to my  father. They delivered the bag to my dad's house. He didn't know the  young men and I have no idea who they were.  I appreciate the honesty and effort in tracking me down.  MARCIE WILKINS  Vernal  Schools  Dear Editor,  Who is listening to the silent majority in today's political arena?  The Uintah School District Board of Education still uses the executive  session to operate our schools.  How can we get parents and teachers running our schools again?  Qualified teachers teaching in our schools and parents, being parents,  teaching discipline in the home let's our kids know we care for them. We  expect them to be the best they can be.  Jess Lair says: \"Children are not things to be molded, but are people to be  unfolded.\"  Professional qualified teachers who are paid for 12 months each year  instead of the present 9-month salary scale the teacher stand in front of the  classroom.  Quality teachers want recognition so moonlighting jobs are not part of  their life.  Let's bring our public schools in line with the gang problems of today's  society and lower the compulsory school attendance law to 14 so these lost  kids can go to work and earn more respectable money to meet their needs.  Our gifted and talented kids are forced to endure repetitively boring  classes without any escape until 16 years of age by then the gang syndrome  is almost irreversible.  Let's all start listening to our kids and learn how to find joy and happiness.  happi-ness. They have the answers in this high tech electronic superhighway.  HYRUM TOONE  Vernal  P VERNAL  Expi  (ISSN 0892-1091)  Published every Wednesday for $19.00 per  year in shopping area and $30 per year out of  shopping area within state and $33 per year  out of state within USA by the Vernal Express  Publishing Company, 54 North Vernal Avenue,  Vernal, Utah 84078. Second class postage  paid at Vernal, Utah 84078.  POSTMASTER: Send address changes to  VERNAL EXPRESS, P.O. Box 1000, Vernal  Utah 84078.  Jack R. Wallis Publisher  Steven R. Wallis Editor  Melanie Morrison Staff Writer  Kathleen Irving Staff Writer  Eric F. Pye Sports Writer  Janet D. Wallis Advertising  Marcia Henry Advertising  Judy Arbgast Circulation & Classified Ads  Phone 789-351 1 - FAX 789-8690 Member of  Utah Press Association and National  Newspaper Association  Area correspondents  Lapoint Marlene McClure, 247-2552  Whiterocks Virginia Ferguson, 353-4584  Manila Clara Robinson, 784-3436  Tridefl Loma McKee, 247-2350  Deadline  News Monday 5 p.m.  Display Advertising Tuesday 11 a.m.  Classified Advertising Tuesday 11 a.m.  Murder case  put on hold  A Ft. Duchesne 16-year-old has  agreed to plead guilty to first degree  murder in the death of a 19-year-old  man last year.  Dominic Manning's plea, however,  howev-er, was deferred by 8th District  Court Judge John Anderson at a  hearing last Wednesday. The judge  wants a jurisdictional question to be  answered in a companion case.  Manning and Valentino Colorow,  25, are charged with the first degree  murder and kidnapping in the death  of Bill Poleviyaoma last Jan. 28.  The victim allegedly was beaten  at party at Ft. Duchesne, on the  Uintah and Ouray Indian  Reservation.  Judge Anderson wants to determine  deter-mine whether he died on the reservation,  reser-vation, which would give the federal  feder-al courts jurisdiction, or at the  Gusher landfill, where the body was  found, which would leave the case  in state court. Colorow's trial has  been set form March.  McKee...  Continued from page 1  the Utah Attorney General's office  was investigating the Meacham  case, said Attorney Stringham.  Stringham said she usually did not  make announcements about cases  that are not going to be prosecuted,  but because of the many requests  from the media she was going to  make an exception.  She said the 4-page report of the  investigation showed that McKee  had acted \"indiscriminately\" but he  did not act criminally.  In fact, by not flying from Vernal  to Salt Lake City to Minnesota,  McKee saved the county $254 on  airfare, but that does not include  meals. - -  McKee said he received a letter  clearing him of any criminal prosecution  prose-cution in February of last year. \"The  travel company double billed me for  the trip which brought the trip to  light,\" McKee said.  The trip logged 2,657 miles on the  county vehicle, and the airfare from  Tulsa to St. Paul was $503. All  three commissioners signed the  credit card receipt for the payment  of the airline.  Commissioner McKee informed  the other commissioners about the  trip, said Attorney Stringham. \"One  of the commissioners agreed on the  trip and the other disapproved,\"  Clean lakes  Dear Editor,  I am writing to tell the people of Uintah Basin what a fine job they are  doing of taking care of the Bailey Mountain Lakes. A couple of years ago,  we went back to the Kidney Lakes and stayed there for two weeks. It was  the most clean and natural place I have ever seen in my entire life. I appreciate  appre-ciate the Forest Service for taking such good care of the trails and building  the bridges across the creeks and canyons. I would like to suggest having  some of the fish transplanted to the smaller lakes around the area; also, getting  get-ting a better trail built going across the Shell Trail or going above and  building a totally different trail.  TOBIN ROBERTS  Vernal  New Uintah School Board members Fran Harding, Mary Ann McAllister and Robert Nelson, take oath  of office given by Richard Tolley, Uintah School District business manager.  according to the investigation.  McKee said he believed that  when he requested the other two  commissioners' approval of the  trip, they both agreed, but since  then, one commissioner has said he  didn't approve of the trip.  Because of the investigation into  the McKee trip, Commissioner  Lewis Vincent said the county is  looking into changes in the county  travel policy as it pertains to commissioners.  McKee said if he had to do things to go the NACO meeting,\" he said.  again, he would have done them 4ll ' , T . .. .  j-ee i a l . . . , It was the way I saw to accomplish  differently.. At the time I had to be ' v  in Tulsa with my family and needed both.\"  ' l ' j j  Newly elected Uintah School District School Board Officers are  Gene Harvey, president and Fran Harding, vice president.  Voice of Business  Mail to the speaker  ( A  by Dr. Richard L. Lesher, President  U.S. Chamber of Commerce  WASHINGTON It is telling that while critics of the  next Speaker of the House, Newt Gingrich, are working  overtime to discredit him, his supporters are actively comparing  com-paring him to Thomas Reed and Joseph Cannon, powerful  Speakers who ran the House of Representatives with an iron  hand around the turn of the century.  It is much too early to predict whether Gingrich will measure  mea-sure up to those earlier giants, but without question, he brings to office a  wide range of personal assets, not least of which is an extraordinary gift  for oratory. Unaided by written text or even cue cards, he speaks with  power and conviction. Indeed, it is fair to say he will be the first Speaker  of the House of our generation who can actually speak.  Of course, a gift for oratory that is not supported by intellectual force  and moral courage is mere wind. Herein lies Gingrich's greatest strength,  and the real reason he drives the opposition into impotent rage. Newt  Gingrich is one of the most prescient observers of the American scene to  come along in many years. He is well read and endowed withfa keen  sense of history. He recognizes the unintended consequences that too  often result from well-intended government initiatives, and has an  uncanny way of zeroing in on the more conspicuous failures of liberalism.  liberal-ism. Most importantly, he is emboldened with a sense of mission to  bring about fundamental change in the nature of our government-.  Hence, the GOP Contract With America which the Clinton administration  administra-tion actively ridiculed right up until the election. Like his hero Ronald  Reagan, Newt Gingrich understands that political power is an active  energy that must be used to have currency. Thus, he was determined not  only to obtain a Republican majority in Congress, but to hit the ground  running once that majority was achieved. By virtue of that highly-publicized  Contract, the Republicans have asserted an agenda and defined the  political debate for the next two years.  It is a debate long overdue. At its heart is the very nature of our society,  soci-ety, and how government should relate to the citizens. Rather than discussing  dis-cussing new opportunities for pork, Congress must discuss which programs  pro-grams have outgrown their usefulness and should be abolished. Rather  than explore new methods of raising revenue, government must seek  new ways of reducing spending. Rather than creating new individual  rights and entitlements, we must get back to traditional concepts of individual  indi-vidual obligations and responsibilities.  The Republican majority in the Senate is equally eager for this discussion  discus-sion of fundamental values, as are many of their Democratic colleagues.  Several of the Republicans, including Majority Leader Robert Dole,  served in the majority before, and bring to the table experience lacking  on the House side. If the House Republicans should get carried away  with their unfamiliar power, the Senate will provide a steadying influence.  influ-ence. There is no guarantee of success, either that the Contract will be enact-  ed, or that if enacted it would produce the desired results. But the great-,  ness of democracy is that it provides for nonviolent change of government,  govern-ment, and with that change the promise of renewal. We can hope for  meaningful change that augurs well for our country's future. 1", "parent": 22650613, "version": 1739893123275816964}, {"id": 22650616, "paper": "Vernal Express", "type": "page", "date": "1995-01-11T00:00:00Z", "year": "1995", "month": "January", "day": "11", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/69/1e/691ee77b0fd2d6cbfb165b0c8ec52d1a07e599f1.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/c2/da/c2da7cb4abe40abf6e729ecda2ad6e9354030345.pdf", "page": 3, "ocr": "Vernal Express Wednesday, January 11, 1995 3  at rr- u  ' . \" I \"  '' ' ' - ' y i 5 v  KirCyyyty ;'r'\" \" - '  vi X-f' 'e,  J t  -T7'  .. v,) Mi ifi I w i).  1  f j j  The new Bank of Vernal received an award as best business building in Vernal on July 11, 1917.  Picture on loan from the regional room in the Uintah County Library.  Bank...  Continued from page 1  were no restriction on the number  of packages that could be sent. So  each brick was individually  wrapped and packaged. Ten bricks  per crate met the weight requirements.  require-ments. Thus the bank received its  name \"The Parcel Post Bank.\"  Tannery...  continued from page 1  said.  The company primarily tans elk  and deer hides for the east coast,  but will also tan cattle, buffalo or  ostrich hides. Another tannery  located in nearly the same area  closed down several years ago.  The Fox Tannery has been in business  busi-ness in Salt Lake City for over 50  years. It has grown too big for its  present location. Lowell Fox is  originally from Vernal but moved  to Salt Lake City to operate the  tannery.  State receives  Forest Service  contributions  The Ashley National Forest has  contributed during fiscal year 1994  $1.3 million to the State of Utah for  receipts from timber sales, grazing,  recreation, minerals and lands use.  By law, the Forest Service pays  25 percent of the revenue it collects  for these services to states in which  the National Forest System lands  are located. The funds are used for  schools and roads.  In addition, Ashley receipts results  re-sults in payment of more than  $96,000 to Wyoming.  Dinosaur visits  up 11 percent  Visitation at Dinosaur National  Monument during December was  11.7 percent above the same month  in 1993. But the total visitation for  1994 is 10 percent less than in  1993, according to the Monthly  Public Use Report.  The 1994 year fell short of the .  one-half million mark with 481308  total visits. In 1993, the record of  535,006 visits was reached.  December visits of 7,169 compares  com-pares with 6,418 for the same  month is 1993.  Total overnight stays for  December numbered only 24 with a  total for the year of 66,162, according  accord-ing to Ann Exccll, Dinosaur concessions  conces-sions specialist  Call the  Phone 789-3511  64 n. Iferaal Arm.  Th Codfish toy  f ttn thOHUnd tu SL  I Tht handy ten KM  I lays on. A  I Ttn Codfish Mtwr cacMtl  I to tD you whit 1  i iM't (loot..  I ind M w tcorn  VH th Codfith  Jl I wlult lh  htnMpriM.  Wl II only Ot to  VlflK snow you thit W  1 jKPAYS TO ADVERTISE!  . iiii.i.m mm JTi' ' ilffii in ..XJf  Workers on scaffoling on North  restoration to its origional took.  Original 1903 safe in the Bank of  CP I;;,  r -  L J 'V  ' r  ' ' ' ' '' v :? -  Packaged and boxed bricks for front of Bank of Vernal arrive in  Vernal after residents hauled them the last 65 miles. Photo from  Zion's Bank.  Side of bank prepare area for  Vernal is still in use today.  Arrow shows Delambert ranch house and dotted line marks area of road Uintah County wants to condemn.  Ranch...  Continued from page 1  The 1989 lawsuit would condemn  a 100-foot strip through the center  of DeLambert's property. The condemnation  con-demnation suit was dropped, but  the civil portion of the lawsuit was  never dropped, said McKeachnie.  \"Essentially the road goes nowhere,  but to Delambert' s Ranch,\" he said.  N. George Daines, attorney for  the Special Service District, maintains  main-tains in the suit, that the road is a  public road because it crosses both  public and private property. \"How  does Mr. Delambert use it if it is  not public?\" he asked.  Plans for the Seep Ridge  Highway were foiled last year  when Grand County backed out of  the project and a new commission-form  commission-form of government was elected  with the non-support of the construction  con-struction of the highway being a  campaign issue of those who were  elected. The three-member board of  the Special Service District agreed  to maintain and improve on Uintah  County's right-of-way in a joint  resolution passed last summer by  both the district and Uintah County  Commission.  Adam Catmull  Norwest  Financial  names new  manager  Adam Catmull has been named  Branch Manager of the Norwest  Financial office located at 1147-1  1147-1 169 West Highway 40, Vernal.  Catmull joined Norwest Financial  in 1991 as a credit manager at the  firm's office in Salt Lake City. He  was named assistant manager in  1993.  Catmull resides in Vernal and is a  native of Salt Lake City.  The Norwest Financial office provides  pro-vides a wide range of consumer and  commercial financial services, including  in-cluding installment loans and retail  finance contracts.  Norwest Financial is a leader in  the consumer finance industry, with  $5.3 billion in assets and more than  1,000 branch offices in 46 U.S.  states and all ten Canadian  provinces. Currently, the firm  serves the residents of Utah from a  total of nine locations.  s\" C-;  a j Robb  f j 789-1121 office  1 V C I 789-7343 residence  UM U r  Mew curfew  to cite parents  Not only will juveniles be held to  a longer curfew, but their parents  could be cited if they knowingly let  their children out after curfew, stipulates  stip-ulates a revised Vernal City ordinance.  ordi-nance. The revised ordinance approved  by the Vernal City Council, allows a  minor under 16 years to be out in a  public area only before 10 p.m. and  after 6 a.m. unless accompanied by  an adult authorized by the parent or  legal guardian.  The ordinance also makes it illegal  ille-gal for a minor from 16 to 18 years  old to be out on the street from 11  p.m. to 6 a.m. except Friday and  Saturday when they can be out until  1 a.m. the next morning.  The ordinance makes it unlawful  for a parent or legal guardian having  hav-ing care of a juvenile to knowingly  permit or by inefficient control to  allow the juvenile to remain in any  public place under violation of curfew.  cur-few. Parents in violation can be  charged with a class B misdemeanor  misde-meanor which is punishable by up  to six months in jail and or a $1,000  fine.  The curfew does not apply 30  minutes prior or after any authorized  autho-rized school church, or community  4. I hnrl1 1 li  It's YoulMoney!  I'' Tjljl l! ' U.S, GOVERNMENT 'OiLlVi  'IIIIP !i  390 West Main, Vernal 789-3335  WEEKDAYS 9 AM TO 7 PM, SAT. 9-3. APPOINTMENTS AVAILABLE BUT NOT NECESSARY  V.'.\".  v..  activity or function. It does not apply  ap-ply in cases when a minor is beginning  begin-ning or completing an authorized  work shift  \"It will be interesting to see the  enforcement of this new ordinance,\"  ordi-nance,\" said Police Chief Mike  Hamncr, Vernal City. \"The altitude  wc have received from some parents  par-ents concerning their children being  out after curfew is 'We don't care,\"'  Chief Hamner said.  Vernal City's curfew ordinance  has not been modified since 1980.  The new ordinance was reviewed  by the Vernal Youth City Council,  that endorsed the changes before  the Vcmal City Council gave its approval.  ap-proval. Temperatures  Dale  Jan. 3  Jan. 4  Jan. 5  Jan. 6  Jan. 7  Jan. 8  Jan. 9  High Low  Prccip.  30  2?..  28  36  30  37  39  4  ,4  18  16  8  9  28  .16  .02  Courtesy of Sky West Airlines  for all of your  Insurance Needs  Commercial Auto Home  Life Health Disability  Retirement Plans Bonds  Employee Benefit Plans  As your agent I will work as  hard for you as you have  for yourself.  205 North Vernal Ave.  1  LI", "parent": 22650613, "version": 1739894037867921413}, {"id": 22650617, "paper": "Vernal Express", "type": "page", "date": "1995-01-11T00:00:00Z", "year": "1995", "month": "January", "day": "11", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/ac/5d/ac5d70d59f5a6eff2a9f4d92f9523bb30bc67e5e.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/8c/9e/8c9eaaabd9f8a1ef58e5adbe7108898efdd1ac19.pdf", "page": 4, "ocr": "4 Vernal Express Wednesday, January 11, 1995  MZ  REQUEST FOR  PROPOSALS  Uintah County, in conjunction  con-junction with the County's  Coun-ty's Community Development  Develop-ment Block Grant proposals  pro-posals for year 1995-96,  hereby requests proposals  as follows:  1. Golden Age Center:  Contractor's services for  window replacement,  completion of siding, and  repairreplace and carpeting  carpet-ing to flooring.  Proposals on this project  pro-ject must be submitted no  later than 1:30 p.m. on  Tuesday, Jan. 17, 1995.  2. Avalon Fire Hydrants:  Hy-drants: Engineering services  ser-vices for the installation  of twenty (20) fire hydrants.  hy-drants. Proposals on this project  pro-ject must be submitted no  later than 4:30 p.m. on  Friday, Jan. 13. 1995.  Interested parties desiring  desir-ing to submit a proposal  should obtain a copy of  the \"RFP\" which contains  further information from  Dale W. Cameron, Uintah  County Purchasing  Agent, at 152 East 100  North, Vernal, Utah  84078, (801)781-5462.  Proposals received by  the deadlines stated  above will be opened, but  not necessarily awarded,  at the regularly scheduled  commission meeting on  Tuesday, Jan. 17, 1995.  The meeting begins at  1:30 p.m.  Published in the Vernal  Express Dec. 28, 1994,  Jan. 4 and 11, 1995.  NOTICE TO  WATER USERS  The State Engineer received  re-ceived the following Application)  Ap-plication) to Appropriate  Appropri-ate Water (Locations in  SLB&M unless otherwise  other-wise designated).  Persons objecting to an  application must file a  Protest stating the reasons  rea-sons for the protest. To  have a hearing before the  State Engineer, persons  must request a hearing in  the Protest Protest must  be filed in duplicate with  the State Engineer, 1636  West North Temple, Salt  Lake City, Utah 84116,  (801-538-7240) on or before  be-fore FEBRUARY 17,  1995. (PROTESTS  MUST BE LEGIBLE  WITH A RETURN ADDRESS).  AD-DRESS). These are informal  infor-mal proceedings as per  Rule R655-6-2 of the Division  Di-vision of Water Rights.  (LEGEND: Points) of  Diversion POD; Place  of Use POU; Nature of  Use USE)  UINTAH COUNTY  45-5658 (A68455):  Raymond McDonald  QUANTITY: 1.0 ac-ft.  SOURCE: 6 in. well 30  ft. to 60 ft. deep. POD:  (1) S 145 E 1185 from  Wl4 Cor, Sec 16, T4S,  R21E. (Maeser) USE: Irrigation:  Ir-rigation: from Apr 1 to  Oct 31, total acreage 0.25  acs. POU: NW14SW14  Secl6,T4S.R21E.  ROBERT L.  MORGAN, P.E.  STATE ENGINEER  Published in the Vernal  Express on Jan. 4, 11 and  18, 1995.  NOTICEOF  MEETINGS  The Public meetings of  the Ouray Park Water Improvement  Im-provement District will  be held at the Avalon  Community Center on the  second Tuesday of each  month.  During the months from  November through March  the meetings will begin at  7 p.m. From April  through October meetings  will begin at 8 p.m.  IOVA MOORE  CLERK  Published in the Vernal  Express Jan. 4 and 11,  1995.  PRE-DECISIONAL  NOTICE REQUEST  FOR COMMENTS  Hickerson Park Road  North Timber Salvage  USDA Forest Service  Ashley National Forest  Flaming Gorge  Ranger District  Daggett County, Utah  On Jan. 9, 1995, Acting  Flaming Gorge District  Ranger Loren Walker  identified a preferred action  ac-tion to salvage dead  lodgepole pine north of  the Hickerson Park Road  Approximately 720 acres  would be salvaged  through personal-use firewood  fire-wood gathering while an  additional 245 acres of  burned over Douglas fir  would be salvage using  commercial timber operators.  opera-tors. The Douglas Fir  area would be planted  back to Douglas fir. Two  other alternatives were also  al-so considered and analyzed  ana-lyzed in an EA.  A final decision has not  been reached for this proposal.  pro-posal. Following a 30-day  comment period, a final  decision will be documented  docu-mented in a Decision Notice.  No-tice. Additional information  informa-tion is available from  Ross Catron, Box 279,  Manila, Utah 84046 or  phone (801) 784-3445.  Comments sent to the  above address and postmarked  post-marked by Feb. 10, 1995,  will be accepted and considered  con-sidered in reaching a final  fi-nal decision.  Published in the Vernal  Express Jan. 11, 1995.  PUBLIC NOTICE  The Uintah County  Commission will meet on  Tuesday, Feb. 7, 1995, at  2 p.m., to consider a petition  peti-tion to amend Lots 6, 7  and 18 of the Pheasant  Acres Subdivision located  locat-ed in Section 8, T4S,  R21E, SLM.  The meeting will be  held in the County Commission  Com-mission Chambers, 152  East 100 North, 2nd  Floor, Vernal. The public  is invited to attend.  For further information,  contact the County Planning  Plan-ning office, 152 East 100  North, Vernal, 781-5481,  during regular business  hours.  Published in the Vernal  Express Jan. 11, 18, 25  and Feb. 1. 1995.  PUBLIC NOTICE  ORDINANCE  NO. 95-01  An Ordinance amending  amend-ing the Vernal City municipal  mu-nicipal code. Section  8.12, Garbage Collection  and Disposal.  This Ordinance will  take effect the day after1  publication, the 12th day  of January, 1995.  Published in the Vernal  Express Jan. 11. 1995.  ADVERTISEMENT  FOR BIDS  City of Naples  1420 East 2850 South  Naples. Utah 84078  Separate sealed bids for  the P&W Industrial Subdivision  Sub-division Road Project  will be received by the  City of Naples at the City  of Naples Council Room  until 7 p.m. on Jan. 26,  1995 and then publicly  opened and read aloud at  8:10 p.m. Jan. 26, 1995 at  said City of Naples office.  of-fice. SCOPE OF WORK:  Pre-Construction Design  De-sign Engineering and  Construction Engineering  for P&W Industrial Subdivision  Sub-division roads re-construction,  curb, gutter,  drainage design, curbside  landscaping and green  area design.  The contract Documents  Docu-ments will be available  Jan. 12, 1995. Copies  may be obtained at the  City office upon payment  of SI 0.00 for each set,  none of which will be refunded.  re-funded. All Bidders are required  re-quired to be Bonded by a  Surety Company.  The City of Naples is  an Equal Opportunity  Employer. The City of  Naples also maintains the  right to reject any and all  bids.  Published in the Vernal  Express Jan. 11 and 18,  1995.  PUBLIC NOTICE  The Board of Trustees  of the Uintah County  Mosquito Abatement District  Dis-trict will be holding its  regular public meetings  for the calendar year.  1995 on the second  Thursday of every other  month. The first meeting  of 1995 shall be held on  Thursday, Feb. 9 at 7  p.m. at the Abatement  District office located at  1425 East 1000 South in  Naples. All subsequent  regular meetings for 1995  shall convene at two  month intervals, at the  same time and location.  All interested persons  are welcome.  Published in the Vernal  Express Jan. 11, 1995.  REQUEST  FOR COMMENTS  USDA - FOREST  NATIONAL  FOREST  FLAMING GORGE  RANGER DISTRICT  DAGGETT COUNTY,  UTAH AND  SWEETWATER  COUNTY, WYOMING  FLAMING GORGE  RANGER DISTRICT  TRAVEL  MANAGEMENT  PLAN REVISION  On Feb. 21, 1991, the  Flaming Gorge Ranger  District of the Ashley National  Na-tional Forest began scoping  scop-ing on the proposed revision  revi-sion of the District Travel  Management Plan. An interdisciplinary  in-terdisciplinary team was  used in the analysis of  this proposal. Four alternatives  alter-natives were considered:  No action (Alternative  1), Maximize Recreational  Recre-ational Opportunities (Alternative  (Al-ternative 2), Minimize  Resource Impacts (Alternative  (Alter-native 3) and the Proposed  Pro-posed Action (Alternative  4). Their analysis is documented  doc-umented in an Environmental  Environ-mental Assessment (EA),  which is available for  public Tcview and comment.  com-ment. In June of 1994, a  pre-decision notice and  request for comments  was published. A draft  EA was mailed to interested  inter-ested parties for comment.  com-ment. Based on the initial  comments the EA has  been revised and comments  com-ments are again being requested.  re-quested. The Flaming Gorge  District Ranger (who is  the responsible official)  has identified Alternative  4 as the preferred alternative.  alter-native. This alternative  would allow for increased  recreational development  while reducing impacts  on natural resources by  restricting off-road vehicle  vehi-cle travel to designated  routes, except that, in  some areas over-the-snow  vehicles would be allowed  al-lowed to operate on a  snow cover sufficient to  protect underlying soil  and vegetation from damage  dam-age or displacement.  Pursuant to 36 CFR  2153, this legal notice  provides a final opportunity  opportu-nity to comment on the  proposed revision of the  District travel management  manage-ment plan. Comments  must be postmarked by  Feb. 10, 1995. The District  Dis-trict Ranger will consider  these comments in reaching  reach-ing his final decision.  Comments should be sent  to: Loren Walker, Acting  District Ranger; Flaming  Gorge Ranger District,  P.O. Box 279, Manila,  Utah 84046, (801)784-3445.  (801)784-3445. Additional information  infor-mation may be obtained  at this address.  Published in the Vernal  Express Jan. 11, 1995.  PUBLIC NOTICE  The public is invited to  a meeting regarding a  feasibility study, site selection  se-lection study, master plan  and environmental assessment  as-sessment of potential expansion  ex-pansion andor relocation  of the VemalUintah  County Airport The purpose  pur-pose of the meeting will  be to present projections  for airport demand to the  public for comment In  addition, public comment  regarding issues related  to the projections and potential  po-tential expansion andor  relocation of the airport  will be taken. The meeting  meet-ing will be held:  Thursday  Jan. 26. 1995  Uintah County  Commission Chambers  7 p.m.  Questions? Please call  Karen Wikstrom of Wik-strom  Wik-strom Economic & Plan  ning Consultants at (801)  521-7724 or Thorn  Wardell, Airport Manager,  Manag-er, VemalUintah County  Airport at 789-4636.  Published in the Vernal  Express Jan. 11, 18 and  25, 1995.  ADVERTISEMENT  FOR BIDS  City of Naples  1420 East 2850 South  Naples, Utah 84078  Separate sealed bids for  the development of  Master Drainage Plan,  will be received by the  City of Naples, 1420 East  2850 South, Naples, Utah  84078, until 7 p.m. on  Jan. 26, 1995, then publicly  pub-licly opened and read  aloud at 8 p.m. Jan. 26,  1995 at said City of  Naples Office.  SCOPE OF WORK:  1. Examine existing  and future problems created  cre-ated by storm water run  off and to determine solutions  solu-tions to those problems.  2. The development of  a storm water drainage  facility with the joint cooperation  co-operation of the Corp of  Engineers, Uintah County  and Vernal City Drainage  Systems and Canal Companies  Com-panies accommodating  the present and future development  de-velopment of Urban and  Industrial areas in Naples.  The Contract Documents  Docu-ments will be available  Jan. 12, 1995. Copies of  the Contract Documents  may be obtained at the  City office upon payment  of $10.00 for each set,  none of which will be refunded.  re-funded. All Bidders are required  re-quired to have Bonding  by a Surety Company.  The City of Naples is  an Equal Opportunity  Employer. The City of  Naples also maintains the  right to reject any and all  bids.  Published in the Vernal  Express Jan. 11 and 18,  1995.  NOTICE  On the 20th day of December,  De-cember, 1994, Daniel  Lopez, Jr., filed a Petition  with the 8th District  Court to withdraw the  following described property  prop-erty from the Ashley Valley  Val-ley Water and Sewer Improvement  Im-provement District:  BEG 1034.5 FT. W. OF  SE CORNER OF SEC.  14, T. 4 S, RGE. 21 E.  S.LM. TH. N. 208.5 FT;  E. 80 FT; S. 2083 FT; W.  80 FT. TO BEG. .38  ACRES 453571;  469627; 508482.  Published in the Vernal  Express Jan. 11 and 18,  1995.  PUBLIC NOTICE  OF MEETING  The Uintah County  Board of Adjustments  will meet on Wednesday,  Jan. 18, 1995, at 12 noon  to consider the following  requests:  Richard Olsen: A variance  vari-ance to allow construction  construc-tion of a residence on a  building lot that does  not have street frontage  and is accessed via a  private right-of-way.  The property is located  at approximately 3350  West 3550 North, Vernal,  Ver-nal, and contains 5  acres.  Ed Gudac: A variance  to allow construction of  a residence on a lot that  does not have adequate  street frontage, and to  permit a two (2) lot minor  mi-nor subdivision (lot  split). The property is  located at approximately  approximate-ly 903 West 2500  South, Vernal.  The meeting will be  held in the Commission  Chambers, StateCounty  Building, 152 East 100  North, Vernal. Property  owners and other interested  interest-ed persons are invited to  attend and to comment on  the request. For more information,  in-formation, contact Dale  Peterson, Zoning Administrator,  Admin-istrator, 781-5346, during  regular business hours.  Published in the Vernal  Express Jan. 11,1995.  REQUEST  FOR PROPOSALS  The Uintah Recreation  Association is soliciting  proposals for the rights to  operate a food concession  service at the Dinaland  Golf Course Pro Shop.  Specifications for the  proposal can be obtained  at the Uintah Recreation  Office located 152 East  100 North. Vernal, Utah  84078 (3rd floor). All  proposals shall be submitted  sub-mitted in a sealed envelope  enve-lope labeled \"Golf  Course Concession Proposal\"  Pro-posal\" to the Uintah  Recreation Association.  The Uintah Recreation  Association reserves the  right to reject any or all  proposals. All proposals  shall be submitted no later  lat-er than Feb. 8, 1995 at 5  p.m. to the Recreation offices  of-fices at the above address.  ad-dress. Published in the Vernal  Express Jan. 11, 18 and  25, 1995.  NOTICE  OF MEETING  THE VERNAL CITY  BOARD OF ADJUSTMENT  ADJUST-MENT will meet on Jan.  17, 1995 at 7 p.m. in the  Vernal ' City Council  Chambers at 447 East  Main Street, Vernal.  The Board will hear the  request of Norman &  Pamela Pease for a special  spe-cial exception to build a  house more than 75 feet  from an existing city  street at approximately  350 North 500 West  For further information,  contact Chuck Cunningham  Cunning-ham at the Public Works  Department at 789-6924.  In compliance with the  Americans with Disabilities  Disabili-ties Act, individuals  needing special accommodations  accom-modations during this  meeting should notify  Ken Bassett at 447 East  Main. Vernal. Utah, 789-2255,  789-2255, at least five (5)  days prior to the meeting.  Published in the Vernal  Express Jan. 11, 1995.  Utah Farm Bureau  supports balanced  budget amendment  The President of the Utah Farm  Bureau has told members of the  U.S. Senate that the Balanced  Budget Amendment is the only way  to control congressional spending.  UFB President Ken Ashby, testifying  testi-fying before the Senate Judiciary  Committee, Jan. 5, said the opportunity  opportu-nity is now available for the  Congress to enact a Balance Budget  Amendment. He said such an  amendment was critical, not only to  the country's financial health today, back t0 business as usual.\"  r . II o  out in ine luiure as wcu.  as a portion of total economic activity  activ-ity should be reduced and that fed  eral government regulations on private  pri-vate economic activity and on state  and local governments should be re-duced,\"  re-duced,\" he said. \"These changes in  public policies will take months of  serious consideration and debate by  the Congress. You cannot do everything  every-thing at once, and we do not expect  you to,\" he said. \"But we also do  not want you to simply pass a balanced  bal-anced budget amendment and then  NOTICE  OF MEETINGS  The Public Meetings of  the Jensen Water Improvement  Im-provement District will  be held at the Jensen Water  Wa-ter Office on the second  Tuesday of each month.  During the months  from November through  March the meetings will  begin at 7:30 p.m. From  April through October  meetings begin at 8 pjn.  This notice was ordered  to be published by the  Jensen Board Members.  MARJEAN MURRAY  DISTRICT CLERK  Published in the Vernal  Express Jan. 11 and 18,  1995.  PUBLIC NOTICE  ORDINANCE  NO. 95-02  An Ordinance amending  amend-ing the Vernal City municipal  mu-nicipal code, Section  9.32, Miscellaneous  Criminal Provisions,  amending Chapter  9.32.190, Curfew, and  adding Chapter 9.31195,  Parental Responsibility  for Curfew Violation.  This Ordinance will  take effect the day after  publication, the 12th day  of January, 1995.  Published in the Vernal  Express Jan. 11, 1995.  \"Farm Bureau has supported a  balanced budget amendment to the  U.S. Constitution for 15 years.  Farmers and ranchers believe a balanced  bal-anced budget amendment can help  provide much needed budget discipline  disci-pline that unfortunately seems impossible  im-possible to achieve in government  today,\" he testified. \"Farm Bureau  members are concerned that unless  discipline is restored to federal  spending and taxation, an insurmountable  insur-mountable burden will be placed  upon future generations. I, for one,  don't want my five children to inherit  in-herit an ever-expanding federal  government and a debt burden that  will substantially reduce their living  standards.\"  Ashby said Farm Bureau sees a  balanced budget amendment as the  first step in a whole series of  changes in the basic core of the federal  fed-eral government's policies on taxation,  taxa-tion, spending and regulations. \"We  believe that deficit spending should  end and that tax laws should be  changed to reduce the tax load and  the economic distortions caused by  federal tax policy.  \"Wc believe that federal spending  Ashby said aside from the heavy  burden facing future generations of  taxpayers, the $4 trillion of national  debt and annual deficits that rank in  the $200 billion range hurts  America's ability to meet present  needs. He says reduced debt would  free up monies now spent on debt  interest payments for needed programs.  pro-grams. \"Under current law, a majority of  each house present and voting could  increase taxes on a voice vote. The  constitutional majority and roll call  vote requirements would make tax  increases more difficult,\" Ashby  said.  Ashby said a section should also  provide sufficient leeway to waive  the balanced budget requirement  when necessary with a declaration  of war or engagement in military  conflict.  \"Farm Bureau is committed to  working with the committee and  other members of the Senate and  House to pass a balanced budget  amendment as the first step in transforming  trans-forming the federal government's  budget process and the impact that  government policies have on the  lives of all citizens,\" Ashby said.  Search for missing  man continues  Eason retires after 30  years in Park Service  After 30 years with the National  Park Service, Chief Ranger Nick  Eason retired Jan. 3.  He has served as chief ranger at  Dinosaur National Monument since  March of 1988. Announcing Mr.  Eason's retirement. Superintendent  Denny Huffman said that  \"Employees with the depth of experience  expe-rience Nick Eason brings to the job  just don't come along everyday. His  considerable talents will be sorely  missed in our monument operations.\"  opera-tions.\" Those talents were recently highlighted  high-lighted in a special achievement  award presented to Mr. Eason in  early December.  After a childhood spent on  Colorado ranches and high school  years in the greater Denver area,  Mr. Eason began his career with the  National Park Service while a student  stu-dent at Colorado State University.  He worked as a seasonal park  ranger at Glacier National Park and  Rocky Mountain National Park during  dur-ing summer breaks from CSU.  After a post-graduation stint with  the United States Army, he joined  the National Park Service in his first  permanent position as park ranger  at Montezuma Castle National  Monument in southern Arizona in  1965. Subsequent field ranger positions  posi-tions found him at Shiloh National  Military Park in Tennessee, Blue  Ridge Parkway in Virginia and  Natchez Trace Parkway in  Mississippi. He later served for six  years as superintendent of Abraham  Lincoln Birthplace National  Historic Site near Hodgenville,  Ken.  Mr. Eason's career brought him  back west to Utah in 1982 as chief  of operations and later unit manager  at Canyonlands National Park near  Moab. He served there until 1988  when he accepted the chief ranger  position at Dinosaur National  Monument Mr. Eason and his wife,  Marian, who is director of the  Dinosaurland Travel Board, will retire  re-tire to Moab in April.  Mr. Eason plans to continue his  work with fine wood carving, a  hobby that has netted him ribbons  three years in a row at a prestigious  Park City competition. An example  of his work can be seen at the  Dinosaurland Travel Board offices  on Main Street in Vernal. He also  may dabble in the tourism service  industry in the fast moving Moab  market. A replacement for Mr.  Eason has not yet been named.  Uintah County Sheriff, Rick  Hawkins, said that the search for a  60 year-old Uintah County man is  still continuing and a command post  set up.  According to Sheriff Hawkins, the  daughter of Clifford Serawop reported  re-ported her father missing to BIA  last week. She also reported  Serawop missing to his department  and asked for their assistance. She  told BIA that her father was last  seen driving east on Highway 40  leaving the Bottle Hollow Lounge.  At that time, the family assumed he  was headed home but when he  failed to return that night, and other  relatives reported they hadn't seen  him, Serawop's family reported him  missing.  Serawop has a son in Bismarck,  N.D. as well as relatives in Salt  Lake City and Oregon. Authorities  have been in touch with his rela-  To  tives and \"ATLs\" (Attempt  Locate) have been issued.  Serawop is a Ute Tribal member.  He is 5-foot 4-inches tall and 130  pounds with dark hair and dark  eyes. He was last seen Dec. 31,  1994 near Bottle Hollow wearing  blue levis and a gray shin He may  have a tattoo with the words, \"I love  Joyce\" on his left upper arm and  scars on his left leg and left arm. He  reportedly walks with a limp to the  left  Authorities are looking for a 1979  medium blue GMC pick up truck  with Utah license, 675 GZX.  Serawop is diabetic and the family  says he may be in need of medical  attention.  Anyone who may know this  man's whereabouts is asked to contact  con-tact the Uintah County Sheriff's office,  of-fice, 789-2511, or BIA, 722-2911 or  722-2012.  Procedures outlined  for going to school  outside boundaries  The Uintah School District has  outlined procedures to allow parents  to apply for their students to attend  schools outside the boundaries in  which they live.  Applications for the 1995-96  school year may be made between  Jan. 15 and Feb. 15, 1995. Transfer  requests may also be made after  Sept. 4, 1995. However, all requests  will be based on a first come, first  serve policy, depending on class  size availability.  by March 15, 1995 of acceptance or  rejection.  Transfers are granted on an individual  indi-vidual basis. An enrollment guarantee  guaran-tee for siblings is not implied.  Parents must make an application  for each student The processing fee  will cover all applications from the  family.  The commitment to attend a nonresident  non-resident district or school is for the  full school year and is not re-  Fore BiHanagjemmenlt  to be examined  MEETING  SCHEDULE FOR 1995  The Uintah County Soil  Conservation District will  meet the last Tuesday of  each month at 10 a.m. in  the NRCS Conference  Room at 475 West 100  North, Vernal, Utah. This  meeting is open to the  public.  Published in the Vernal  Express Jan. 11, 1995.  An expert in the field will speak  about fire management Jan. 12, at 7  p.m. at the Ashley Valley Medical  Center Conference Center.  In our lifetimes, there has been a  revolution in how fire is viewed.  In the 1940s, when Smokey Bear  made his debut, fire represented the  evil destructiveness of uncontrolled  nature.  By the 1970s, fire was viewed by  scientists as a natural phenomenon  to be understood, not an evil misfortune  mis-fortune to be resisted at every turn.  In the 1990s, many people in the  general public have come to view  fires as a mixed blessing, which  could be used to heal ecosystems.  Herb Troester, now retired by the  U.S. Fish and Wildlife Service, has  had a lot of field experience with  fire. He has a B.A. in Sociology,  and B.S. in Wildlife Management  from the University of Minnesota.  His experience with fire started  with his 10 years of work at  Tewaukon National Wildlife Refuge  in North Dakota. After that, he was  Refuge manager at Ouray National  Wildlife Refuge. From there, he  moved to Portland to work seven  years as the regional fire management  manage-ment coordinator, and then spent  three years in the same position in  Denver. He will share his experi  ences with slides and video, and Nve-momn-ora female, chow  will make the science of fire ecolo- mix puppy is available for adop-  gy understandable. The discussion tion from the Uintah County  is sponsored by the Uintah Animal Shelter by calling 789-  Mountain Club. 5601.  versible. Transnnrintinn tn nnrl from  Forms may be obtained at any the requested school is the responsi-  school or at the Uintah School Di,itv of die parentguardian of the  District Office. A one-time $5 pro- st\"denL  cessing fee will be charged at the Parents may appeal the district's  urne of application, payable to the decision by requesting a combined  Uintah School District. Parents ap- meeting of the resident school's and  plying during the January-February the requested receiving school's  vvuiuuvv win uuuuui in wniing dtj- teams.  iW 1  (,-:) &  Express  Anothtr  Great  Itftat  Keep Current With  What's Happening.", "parent": 22650613, "version": 1739891550710661120}, {"id": 22650618, "paper": "Vernal Express", "type": "page", "date": "1995-01-11T00:00:00Z", "year": "1995", "month": "January", "day": "11", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/9f/a9/9fa94a1c051a8fcdae672595914cb1c0237e5766.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/47/5b/475b3fa863a04be6cbbc3e7c6b59269c8f866bd4.pdf", "page": 5, "ocr": "Obituaries  Vernal Express Wednesday, January 11, 1995 S  Draft water  guideline released  W V r- :  f  ... - i  Eldon Q. Johnson  Johnson  passes  away Jan. 5  \"Jiggs\" Eldon Quince Johnson,  76, of (Deep Creek) died Jan. 5,  1995 at his home. He was born Jan.  7, 1918 in Vernal, a son of Quince  Dewitt and Chloe Hall Johnson. He  married Clifta Knight on Dec. 15,  1939 in Vcmal. \"Jiggs\" was a rancher  ranch-er and a member of the Church of  Jesus Christ of Latter-day Saints in  the Lapoint Ward. He enjoyed the  outdoors, the mountains, his live-'  stock, good friends, family and  hunting.  He was preceded in death by his  parents; a sister, Stella Harmston;  and a grandson, Denim Gage  Johnson.  He is survived by his wife, Clifta  Johnson, Deep Creek; sons, Lloyd  E. Johnson, Ogallala, Neb., and  Donald G. Johnson, Vernal; three  grandchildren and four great grand-,  children; sisters, Mable Nebeker,  Ivy Schiiley and Nelda Christensen,;  all of Ogdcn; and brothers, Ralph  Johnson, Lander, Wyo., Loyal  Johnson, Kaysville, Orson Johnson,  Deep Creek, Dean Johnson and  Larry Johnson, both of Vernal. Also  very special friends, Glen and  Debbie Harrison.  Funeral services were held  Saturday, Jan. 7, in the Lapoint  Ward Chapel with Bishop Richard  Lamb conducting.  The family prayer was offered by  Dean Johnson and the prelude and  pbstlude music played by Elaine  Moore. ,  Invocation was given by Loyal  Johnson, remarks by Bishop Lamb,  speakers were Martin Huber and  Lyle Taylor. A poem was read by  granddaughter, Marianne Bowden..  A musical \"In The Garden\" was  sung by Dorothy Luck and accompanied  accom-panied by Meralee McKee and another  an-other musical \"Cowboy Dream\"  was performed by Wayne Hall.  Benediction was offered by Lynn  Taylor.  Pallbearers were brothers: Orson  Johnson, Loyal Johnson, Ralph  Johnson, Dean Johnson, Larry  Johnson and brother-in-law, Gale  Christensen. Honorary pallbearers  were grandson, nephew and friends:  Darren Johnson, Brandon Bowden,  Glen Harrison, Quint Johnson, Joe  Jessup and Jim Huber.  Interment was in the Lapoint  Cemetery under the direction of  Thomson's Vernal Mortuary.  Gale Christensen dedicated the  grave with compassionate services  by the Lapoint Ward Relief Society  v (Perhaps you sent a lovely card, $  v Or sat auietlu in a chair, y  S (Perhaps you sent a floral piece, v  v ijsowcsuwu wen.  V  v (Perhaps you spokf  v jfr any friend could say; x,  v (Perhaps you 'Were not v  v , . rr w  v Just thought of us that day. $  'Whatever you. did  V  V  V  V  V  V  V  V  We thankjyou so muck M  whatever the part. v  family of Cat S. Coot v  i f  r J  v  Rose M. Ingram  Ingram  services held  Jan. 10  Rose Marie Oliva Ingram, age 89,  died Jan. 6, 1995 at the Ashley  Valley Medical Center in Vernal.  She was bom Jan. 11, 1905 in  Kcmmerer, Wyo., to Giovani  Ccsare and Giudita Carolina Calai  Oliva.  Rose married Paul Bigler Ingram  on Oct. 10, 1922 in Nephi. Their  marriage was solemnized in the  Manti LDS Temple on May 21,  1941.  Rose was a member of the LDS  Church and was a Relief Society  teacher for many years. She had  worked at Fashion Cleaners in  Vernal and also as a cook at Naples  elementary school where she was  loved by all the children. She loved  to crochet, knit, dance and work in  the garden. She especially enjoyed  playing games with her family. She  will be missed by all who knew and  loved her.  She is survived by her husband,  Paul; children: Betty Marie Ingram  Carson and Richard Paul (Jeri), all  of Vernal; eight grandchildren and  26 great grandchildren. She was  preceded in death by two granddaughters,  grand-daughters, Joann Carter and Angel  Barmore; a grandson, Wesley  Ingram; and her brothers and sisters.  sis-ters. Funeral services were held on  Tuesday, Jan. 10, in the Vernal 2nd  and 4th Ward Chapel with Shane  Mayberry conducting.  The family prayer was offered by  Allen Ingram with the prelude and  postlude music performed by Ada  Openshaw.  The invocation was given by  Linda Smuin followed by the obituary  obitu-ary and remarks by Shane  Mayberry.  A musical number, \"O My  Father,\" and the final musical number,  num-ber, \"Abide With Me,\" was sung by  Marva Lent, Lois Erickson, Ralph  Walker and Don Walker accompanied  accompa-nied by Ruth Walker.  Dwain Sodcrquist, Diane Barmore  and Richard Ingram were speakers  and a musical, \"Somewhere My  Love,\" was sung by Kay Hunting  and accompanied by Daun  DeJoumette. A musical number and  remarks were given by Rose's  grandchildren. Benediction was offered  of-fered by Mike Perry.  Pallbearers were Allan Ingram,  James Kendall, Brett Stringham,  Lang Ingram, Gary Barmore, Bruce  Stewart, Chris Barmore and Tenny  Haws. Honorary pallbearers were  Heath Smuin and the Vernal 2nd  and 4th Ward High Priests.  Interment was in the Vernal  Memorial Park under the direction  of the Hullinger-Jolley Funeral  Home.  Don Brown gave the dedicatory  prayer with compassionate services  by the Vernal 2nd Ward.  Services held  for Barrett  George Washington Barrett, 88, of  -Dinosaur, Colo., died Jan. 7, 1995  in Vernal.  Funeral services were held  Tuesday, Jan. 10, at the Dinosaur  Baptist Church in Dinosaur, Colo.  Burial was in the Dinosaur  Cemetery,  Funeral Director - Thomson's  Vernal Mortuary.  r  Happy Birthday  Rose Ingram  Jan. 11, 1905 - Jan. 6, 1995  Your family and friends were  very fortunate to celebrate 89  birthdays with you-How  you-How happy God and his angels  will be to celebrate with you In  heaven your 90th.  4'  Beatrice C. Williams  Services held  for Williams  VernalHelper, Beatrice C.  Williams, age 79, beloved mother,  grandmother, great grandmother,  sister and friend, died Jan. 6, 1995.  She was born April 6, 1915 in  Blackhawk, Carbon County, to  Henry Edwin and Lillian Bcal Day.  She married William Edward  Carnes April 13, 1938. He died Feb.  27, 1962. She then married Thomas  William Williams, Jr. on July 5,  1969. He died July 9, 1985.  She taught private kindergarten  and then attended Weber College  and graduated from BYU. She was  a retired school teacher. She had  taught first and second grade at the  Reeves School in Price, the first  grade Headstart program in  Wellington in 1967 and 1968, and  Kindergarten in Helper.  She is survived by a daughter,  Mrs. Jay (Jean) Butler of Lay ton;  two sons, Roy (Linda) of Vernal,  and Buryl of Schofield; four grandchildren  grand-children and four great grandchildren;  grandchil-dren; brother, Clive (Claudia) of  Salt Lake City; sister, Vonda Wilson  of Huntington; and sister-in-law,  Barbara Day of Orem.  Funeral services will be held on  Wednesday, Jan. 11, 1995 at 10 a.m.  in the Vernal 1st, 5th and 9th Ward  Chapel, 250 North 200 West.  Friends may call Wednesday, one  hour prior to the services at the  church. Graveside services will be  held in the Mountainview Cemetery  in Helper at 2 p.m. under the direction  direc-tion of the Hullinger-Jolley Funeral  Home.  t  Joe H. Trujillo  Joe Trujillo  dies Jan. 4  Joe Higinio Trujillo, 78, of Rock  Springs, Wyo., died at his home on  Jan. 4, 1995. He was bom April 15,  1916 in Taos, N.M., a son of Robert  Trujillo and Rachel Trujillo. He  married Donna Eaton. They were  later divorced.  Joe was a construction worker. He  was a veteran of World War II. He  served in the U.S. Marines. He was  a member of the Catholic Church.  Joe enjoyed playing golf, rock hunting  hunt-ing and fishing.  He was preceded in death by his  parents; brothers and sisters, Francis  Trujillo, Christopher Trujillo, Sarita  Viole Trujillo, Sanayla Trujillo and  Juanita Trujillo.  He is survived by two sons,  Robert and wife, Becky, Trujillo  and Randy and wife, Deborah,  Trujillo, all of Vernal; and four  grandchildren. He is also survived  by brothers: Danial Lopez, Jr., Joe  A. Lopez, and a sister, Helen  Atwood, all of Vernal.  A funeral mass was held Monday,  Jan. 9, at Saint James Catholic  Church with Father Michael  Winterer officiating.  Musicals \"Be Not Afraid,\" \"In  Memory of Jesus,\" \"Only a  Shadow\" and I Believe in the Son\"  were performed by Carol Jackson  and Amv Lube Allen.  Pallbearers were Jody Paul Lopez,  Joe A., Lopez, Danial Trujillo,  Randy Trujillo, Robert Trujillo,  Rick Murray and Steven Scrna.  Interment was in the Vernal  Memorial Park with full military  honors by The American Legion.  Funeral Director - Thomson's  Vernal Mortuary.  .-- f  f  ' J  v- - f.J  ' -' .1\"'  1 '-' I  t . 1  Norma A. Marshall  Services to  be held  for Marshall  Norma Ashby Marshall, 66, of  Vernal, died Jan. 4, 1995, at the  Ashley Valley Medical Center in  Vernal. She was bom June 5. 1928  in Vernal, a daughter of Curtis and  Eva Clark Ashby.  She married James Earl Marshall  on June 3, 1949 in Salt Lake City.  She was a homemaker and worked  for Ben Franklin Store and Gibsons  for many years. She was liked and  highly respected by her co-workers  and employers. She was a kind and  gentle person who did much for  others. She enjoyed fishing with her  mother and spending time with her  family.  Norma was preceded in death by  her parents; a brother, Keith Ashby;  and daughter, Brenda Lee.  She is survived by her husband,  James Earl Marshall, Vernal; children:  chil-dren: Erleen Baker, Sacramento,  Calif., and David K. Marshall,  Vernal; eight grandchildren; and six  great grandchildren. She is also survived  sur-vived by brothers and sister, Don  Ashby, Vernal, Ralph Ashby,  Ogden, and Barbara Bingham, Salt  Lake City.  Funeral services will be held  Thursday, Jan. 12, 1995 at 11 a.m.  at the Maeser Stake Center, 2745  West 1000 North, in Vernal. Friends  may call at Thomson's Vernal  Mortuary Wednesday evening, 7  p.m. to 9 p.m. and on Thursday 9:30  a.m.: to 10:30 a.m. Burial will be in  the Maeser Fairview Cemetery.  Funeral Director - Thomson's  Vernal Mortuary.  Services  for Alexander  Bourdeau  Alexander Rocky Bourdeau, one  month old son of Maurice and Lisa  Mary Hillis Bourdeau died Jan. 8,  1995. He was born Nov. 30, 1994 in  Salt Lake City. He is survived by  his parents; brothers, Phillip and  Chase; sister, Ashlee, all of Vernal;  grandparents, Marva and James  Hillis, Vernal, Maurice and Muriel  Bourdeau, Lexington, Mich.; and  great grandparents, Mervin and  Mary Slaugh of Vernal.  Funeral services will be held  Thursday, Jan. 12, at 2 p.m. at  Thomson's Vernal Mortuary. Burial  will be in the Maeser Fairview  Cemetery.  Funeral Director - Thomson's  Vernal Mortuary.  Williams is keynote  speaker at USU  financial conference  The Utah State University  Extension service will be hosting a  financial management conference,  \"Financial Solutions,\" on Jan. 18 in  Roosevelt, at the USU Education  Center from 9 a.m. to 3:30 p.m. For  those people who are not able to attend  at-tend the day long conference, a free  panel discussion session will be  held from 11:30 a.m. to 12:30 p.m.  to answer financial questions.  Steve Williams, financial counselor  coun-selor for Merrill Lynch, will present  the keynote address. Others presenting  present-ing classes will be USU Resource  Management Specialists, attorneys,  CPAs, bankers, local businesses and  the Farm Bureau. According to  Barbara Mathis, organizer of the  Duchesne County Conference,  \"There will be valuable information  for anyone who would like advice  on money management, budgeting,  taxes and investments.\"  The conference will have 16  The Bureau of Reclamation today  proposed new guidelines for water  conservation for communities and  irrigation districts receiving water  \"from Federal Reclamation projects  in the 17 Western States, and announced  an-nounced a 90-day comment period  for the public to review the proposal.  propos-al. The draft guidelines released to-day  to-day will assist hundreds of communities  commu-nities and irrigation districts to  identify cost-effective opportunities  for improving the efficiency of their  use of water. Such water savings  can help meet additional agricultural,  agricultur-al, urban or environmental needs.  \"Water conservation is at the heart  of our efforts to improve water resources  re-sources management,\" said the  commissioner of the Bureau of  Reclamation, Daniel P. Beard, in releasing  re-leasing the guidelines. 'They are  the result of extensive consultation  with the state, with water districts  and users, environmentalists, and  others concerned about water usage  Eanth  aC Tips  Household hazardous waste  by Don Williams  Vernal Chamber of Commerce  Conservation Issues Committee  Are you aware of the toxic waste  zones within your home and  garage? If yours is like most households  house-holds you have partially full containers  con-tainers of weed killers, pesticides,  paint thinners, antifreeze, spot removers,  re-movers, oven cleaners and used motor  mo-tor oil sitting around. These items  and others like them are considered  household hazardous waste and the  improper storage and disposal of  them contribute more damage to the  environment than any well publicized  publi-cized spill disaster.  A product becomes hazardous  waste when it is no longer going to  be used in the manner intended  when purchased and if it meets any  of the following characteristics:  flammable, corrosive, toxic to humans  hu-mans and animals or reactivity with  other chemicals to give off toxic  gases or become explosive.  In addition to the obvious need for  safe storage away from children and  pets, the problem is one of proper  disposal. While you use and store  products always keep them in the  original container with the original  label which usually contains safety  information or at the least a number  to call for information. You may recall  re-call a tragedy that occurred last year  in Utah when a solvent was put into  a liquor bottle and unwittingly ingested.  in-gested. If a container is corroding  and must be replaced, clearly and  conspicuously label the new container.  con-tainer. Never, ever under any circumstances  cir-cumstances mix two chemicals  since incompatible chemicals can  explode or produce toxic gases. The  most common occurrence of this is  mixing ammonia and chlorine  workshops covering the following  topics: basic budgeting, income tax  planning, cutting energy costs, nutrition  nu-trition that makes cents, organizing  financial records, credit options,  farm budgeting, living on one income,  in-come, wills and estate planning, insurance  in-surance alternatives, baking in the  90s, getting out of debt, investments  and purchasing clothing on a budget  bud-get Sponsors are asking that anyone  interested in attending should pre-register  pre-register by Jan. 16. Registration  forms can be obtained at either the  Vernal or Duchesne USU Extension  offices or the USU Education  Center in Roosevelt A fee will be  charged at registration. Enrollment  is limited.  For more information on the conference,  con-ference, contact Mathis, USU  Extension Home Economist at 1-800-448-2107,  ext. 152.  Registrations can be mailed to P. O.  Box 978, Duchesne, Utah 84021.  and conservation.H  Draft water conservation guidelines  guide-lines were initially released for public  pub-lic review in April 1994. These  have been rewritten to address the  issues and concerns raised during  the initial comment period.  Today's conservation guidelines  represent just part of the overall  conservation effort being developed  by Reclamation. Reclamation is developing  de-veloping a guidebook to assist irrigation  irri-gation districts in the preparation of  conservation plans as well as technical  tech-nical manuals on specific conservation  conserva-tion practices. In addition,  Reclamation is offering cooperative  agreements and demonstration  grants for the implementation and  evaluation of water conservation  measures for a wide variety of water  wa-ter uses. Other initiatives include a  program to encourage more  widespread use of water-efficient  household appliances and research  in emerging water-efficient technology.  (Clorox) which produces a very  toxic gas that can cause severe lung  damage.  Before you dispose of any chemical,  chemi-cal, read the label for disposal information.  infor-mation. If none, there is often a toll  free number for the manufacturer  who will be happy to provide you  with correct information. Never  pour it down the drain or on the  ground as you are contributing to  ground water pollution. Used motor  oil is the largest of all waste categories  cate-gories and has been one of the more  difficult items to properly dispose  of. The Environmental Health  Department of the Uintah Basin  Health Department is working to  find sites that will accept used motor  mo-tor oil. It is reasonably certain that  by this spring there will be locations  throughout the Basin where do-it-yourself  mechanics can take their  oil. They are also working on a  community household hazardous  waste collection day that will offer  you the opportunity to clean out-your  out-your storage and be responsible to  your environment at the same lime.  It's the only planet we have and a  dam nice one at that.  Future articles will offer suggestions  sugges-tions on reducing the amount of  hazardous chemicals in your household  house-hold and substitutions which will do  the same job as effectively but more  safely.  K-Mart loses  power, not  people  Tuesday evening, the Vcmal K-Mart  K-Mart store was black and deserted  but not because the doors were  closed from lack of business, but  due to a breaker box inside the  store.  According to manager, Jeff  Stanina, the power went off in the  early evening and when Utah Power  and Light was contacted, the problem  prob-lem was discovered in the breaker  box and required an electrician.  Rumors that the store was closing  was put to rest last week. The  store's deli and snack bar, however,  were closed two weeks ago. Stanina  says the decision to discontinue to  operate the eatery at the store was  based on the fact that the snack bar  was not profitable.  According to an article that appeared  ap-peared in the Uintah Basin Standard  last week, the impending closure of  the store itself was not going to  happen. Stanina says he checked  with K-Mart management and the  store is \"viable, and hoping to post  increasing sales.\"  Stanina said that he has not been  contacted about a closure and in the  event that would happen, the store  would have six months notice prior  to shutdown.  The Vernal K-Mart store was remodeled  re-modeled and expanded just over  two years ago. The deli and snack  bar were added at that time.  (  i i i-.r", "parent": 22650613, "version": 1739886958293811200}, {"id": 22650619, "paper": "Vernal Express", "type": "page", "date": "1995-01-11T00:00:00Z", "year": "1995", "month": "January", "day": "11", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/f5/db/f5dbea60e73b81aa34e35b22aa021ec2fcd1c276.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/20/4c/204c4c199713253d2397215549aa7a54b7b91000.pdf", "page": 6, "ocr": "BUY, SELL, TRADE OR RENT THROUGH THE  6 Vernal Express Wednesday, January  CLASSIFIED AD  RATES AND  INFORMATION  RATES:  20 per word (5t per  word extra for black  type). $4.00 minimum,  cash In advance. $1.00  extra charge if billed.  DEADLINE:  Tuesday, 11:00 a.m.  ERRORS:  Please read your ad and  call us immediately If  there are errors. We will  cheerfully make any  corrections necessary.  However, we cannot be  responsible for any  errors that continue  after the first  publication.  PHONE  789-3511  FAX  7894690  OFFICE HOURS:  8 a.m. to 5 p.m.  Monday thru Friday  Closed Saturday  PUBLISHER'S NOTICE  All real tstat advertised In  thli paper It subject to the  Federal Farr Housing Act of  1968 which makes It Illegal to  advertise 'any preference,  limitation, or discrimination  based on race, color, religion,  sex. or national origin, or any  Intention to make any such  preference, limitation or  discrimination.  This newspaper will not  knowingly accept any  advertising for real estate  which Is In violation of the law.  Our readers are Informed that  all dwellings advertised In this  paper are available on an  equal opportunity basis.  \"'BASIN'S BEST  APARTMENTS pool, hot  tub, clubhouse. 2 & 3 bedrooms,  bed-rooms, gas heat, wood-stove  wood-stove and carport Some  furnished. No pets. 6 locations  loca-tions to choose from.  NICE, NEW, AFFORDABLE.  AFFORD-ABLE. $270-$430. Frisco  Office 789-8426. Aspen  Park Office 789-7341,  789-4940, 789-3634, 789-7665.  789-7665. CLEAN 3 bedrooms, gas  heat, major appliances,  wd & cable TV hook-ups,  storage and carport. Some  furnished. Close to town.  Rent starts $305 and up.  Sorry No Pets. TWIN  CEDAR APARTMENTS,  789-8711,789-4654.  2 & 3 BEDROOM apartments  apart-ments - Good Locations.  789-2332.  ASHLEY VALLEY Apartments  Apart-ments - 2 bedrooms, electric  elec-tric heat, wd & cable  hook-ups. $200 deposit  789-8882.  FOR RENT: Nice, clean 2  bedroom apartment, ac.  Cleaning deposit required.  340 West 200 North. Call  789-5391 or 789-4936,  evenings.  TWO BEDROOM apartment  apart-ment $300 rent, $200  deposit. No smokers, no  pets. Call 789-3900.  TWO BEDROOM apartment  apart-ment for rent $300month,  $200deposit. Six month  lease preferred. Storage  unit. 232 West 100 North.  Manager in 3. Call 781-2543,  781-2543, 789-6905.  1 liBm;g 1  FOR RENT: 5 bedroom  home in Vernal, gas heat,  woodburner, fenced yard.  No pets. No smokers. Call  801-885-3186.  VERNAL FAMILY looking  for large home to rent or  lease. Great references.  Call 789-2338,  Real  Estate  REAL ESTATE LIQUIDATION.  LIQUIDA-TION. Country approved  building lots, (private or  mobile home lots). Sell or  rent. Farm ground, raw  land. Financing. Gilmer A.  Chivers, 789-2343, 789-4408  789-4408 or 790-5030 cellular.  For  Rent  GREAT HOMEI Four bedrooms,  bed-rooms, 2 12 baths, fire-'  place, gas heat, family  room, double car garage.  Large landscaped yard,  wonderful neighborhood!  789-0833.  HOUSE FOR sale: 409  West 200 South, 3 bedrooms,  bed-rooms, 2 baths, double car  garage, 12 acre. Call 789-2888.  789-2888. No agents. $83.600.  NEED FINANCING? BUY,  Remodel, Payoff high  interest debt, Consolidate  bills, Credit Problems? No  problem. Bankruptcy ok.  Quick-Fast-Professional.  Great Rates-Superior Service.  Ser-vice. Cash for Real Estate  Contracts & Notes.  EXPRESS MORTGAGE.  Mr. Masters, 1-800-256-0900.  PRICE REDUCED to relocate.  relo-cate. This traditional stucco  stuc-co home with landscaping  in town is very affordable  at $45,000. Ask for Kevin  Young at Home and Land  Realty (agent), 789-1820,  828-1800.  FOR SALE: 4 bedroom tri-level  tri-level home, 2 -car garage.  2225 North 2500 West.  May be seen by appointment  appoint-ment only. Woodey B.  Searle, 789-2126.  SPRAWUNG RAMBLER  in Lapoint, oversized bedrooms,  bed-rooms, 2 car garage on 1  acre. Seller motivated.  Troy 781-0269, Select  Realty 789-8122.  LOCATED IN the country,  this 1300 square foot rambler  ram-bler offers 3 bedrooms, 1  12 baths and double car  garage. Troy 781-0269,  Select Realty 789-8122.  HIGH COUNTRY Estates,  large 3 bedroom home  over full unfinished basement,  base-ment, 1 car garage. Troy  781-0269, Select Realty  789-8122.  YOU CAN own your town  home! No down payment  on Miles materials, attractive  attrac-tive construction financing.  Call Miles Homes today,  1-800-343-2884 ext. 1.  WANTED TO buy: 1983 or  newer 14x70 mobile  home, 2 or 3 bedrooms.  Phone 789-6401,  evenings.  WOULD LIKE to buy 1971  to 1974 Roadrunner trailer,  trail-er, 17, in good condition.  789-3552. leave message.  Services  BONNIE'S DAY CARE.  Register now for our new  fall preschool and  playschool programs!  Available still, infants and  arterschool. Monday-Saturday,  7am-11pm. 789-6028.  789-6028. \"DEB'S  DAYCARE\"  available, 22  Openings  years license experienced,  hot meals, learning activities.  activi-ties. Family environment  for your small ones!  Maeser area. 789-2942.  YOUNG PEOPLES  PRESCHOOL & DAYCARE,  DAY-CARE, ages 2-12 has four  programs available: 2 & 3  year olds, 4 & 5 year olds,  after school and evening  care. Hours 7am-10pm.  Call 789-7231.  HEADSTART - FREE  PRESCHOOL 4 hours  per day. Applications are  now being accepted for  eligible 3 & 4 year old children  chil-dren in Uintah County. (4  year olds will be given priority).  pri-ority). Over-income Handicapped  Handi-capped and Special  Needs children given special  spe-cial eligibility consideration  for ou'lying (upper)  Maeser, ,ensen & Dryfork  areas. Our home based  program may be an option  for you. Call Cathy at 781-2078.  781-2078. Services provided  are: Dental, Vision, Hearing  Hear-ing & Physical screening:  Parent Involvement:  Transportation to and from  school within bussing  boundaries. Lunch &  breakfast or snack provided.  provid-ed. Learning center for  individual enrichment.  Inside and outside recreational  recre-ational facilities for gross  motor development:  Equipment for \"hands on\"  learning: Best of all our  warm responsive staff  Contact Kaye at 789-4666.  11, 1995  BECOME A PARALEGAL  PARALE-GAL Join one of America's  Ameri-ca's fastest growing pro-,  fessions. Lawyer instructed  instruct-ed home study. Specialty  programs offered.  P.C.D.I., Atlanta, Georgia.  Free catalogue. 800-362-7070  Dept. LLA729.  1 igiMnsa '  BACKHOE SUPREMO.  Custom backhoe, dump  truck loader service, ditching,  ditch-ing, trenching, excavation,  sewer & water lino installation,  installa-tion, septic tanks and drain  fields, licensed contractor.  Gilmer A. Chivers. 789-2343,  789-2343, 789-4408, 790-5030.  790-5030. 1 I  HOWLETT CONSTRUCTION  CONSTRUC-TION COMPANY. New  construction and remodeling.  remodel-ing. All phases commercial,  commer-cial, residential. Licensed  Vernal since 1977. 781-0205.  781-0205. CAR STEREO INSTALLATION.  INSTAL-LATION. Professional  work, 15 years experience,  experi-ence, certified. Custom  installations on all makes.  Vernal H.E.C., 145 West  Main, 789-1997.  COMPUTER  LEMS? Having  getting started  new system?  PROB-  problems  on your  We can  HELP! Software and Hardware  Hard-ware Purchasing info,  Troubleshooting Problems  with your hardware or software.  soft-ware. Personal Tutoring  Service, Memory Upgrades.  SYSTEM UPGRADES AND  REPAIR SERVICE REASONABLE  REA-SONABLE RATES! CUSTOM  CUS-TOM COMPUTER SER-VICE.  SER-VICE. Call 801-789-1305.  NEED MORE ROOM?  Classifieds can help.  789-3511.  Misc.  PROMPT DELIVERY service  ser-vice on your bottled gas.  Call 789-3198. SAV ON  PROPANE.  SEELEY'S STORAGE  Units for all you storage  needs. Also storage buckets  buck-ets for food storage. See-ley's,  See-ley's, 1010 North Vernal  Avenue. 789-0933.  WHY RENT CABLE TV?  Satellite gives you more!  350 channels - stereo -parental  lockout - perfect  reception. $29 per month.  HEC, 789-1997.  SHORT ON CASH? We  make loans on anything of  value. Cars, Trucks,  Motorcycles, Guns, T.V.'s,  VCR's. AAA PAWN, 57  NORTH 500 WEST. 789-4034.  789-4034. BAHAMAS CRUISE - 5  days4 nights, under-booked.  under-booked. Must sell!  $279couple. Limited tickets.  tick-ets. 407-767-8100 Ext.  6392. Monday-Saturday,  6am-7pm PST.  UP TO $1,000 a week and  more! For details, send  10 self-addressed  stamped envelope to:  S.W.J. Enterprise, 328  Flatbush Ave. Suite 264,  Brooklyn, N.Y. 11238.  718-629-0322.  THE VERNAL EXPRESS  does not endorse, promote  pro-mote or encourage the  purchase or sale of any  product or service advertised  adver-tised in this newspaper.  Advertisements are the  sole responsibility of the  advertiser. The Vernal  Express hereby disclaims  all liability for any damage  suffered as the result of  any advertisement in this  newspaper. The Vernal  Express is not responsible  for any claims or represent  tations made in advertisements  advertise-ments in this newspaper.  The Vernal Express has  the sole authority to edit  and locate any classified  advertisement as deemed  appropriate. The Vernal  Express reserves the right  to refuse any advertising.  CLEAN COAL after holidays  holi-days special. Burn in stove  or fireplace. Burns longer  and cleaner than wood.  12 ton $75, 34 ton $90.  Call 800-796-4213. Deliv-ery  Deliv-ery can be arranged.  PLACE YOUR CLASSIFIED  CLASSI-FIED AD in not 1, not 2,  but 42 newspapers  throughout Utah. One  placement, one payment  puts you into the UTAH  CLASSIFIED ADVERTISING  ADVERTIS-ING NETWORK. Reach  over 379,000 Utahns for  only $99. Call the VERNAL  VER-NAL EXPRESS at 801-789-351  1 for further information.  SERTA . PERFECT  SLEEPER pillow soft  queen mattresses (extra  firm), $125 or best offer.  Call 789-0031.  FOR SALE: Large carrousel  car-rousel horse, finished in  pastel colors. 789-2942.  EXCELLENT RED 2yr old  Saler bull. Hog feeder, 12-door,  12-door, 80 bushel. Log splitter,  split-ter, heavy duty. Bridge,  heavy duty, 13'x13 781-0445.  781-0445. ELECTRIC RANGE, Hot-point,  Hot-point, almond, one year  old. $225. Whirlpool electric  elec-tric range, almond, deluxe  model, $175. 303-675-2110,  Ranger. Suburban  back soat, $50.  HOME LOANS, Refinance  Loans, Home Equity  Loans, Personal Loans. All  kinds of Commercial  Loans - $20,000 to  $5,000,000. ROGER  HACKING, 789-2375.  Animals  REGISTERED SOLID,  paint bred stock mare,  sired by Sundance Wyo,  bred to Robins Partytime.  $1700. 789-6878, 789-4463.  789-4463. WANT TO raise exotic  animals? We have a herd  of Fallow Deer for sale.  303-824-4109 Craig, Colorado  Col-orado 9-YEAR OLD gelding,  Quarter Horse-Morgan.  $1100. Call 789-2346 after  6p.m.  300 HEAD of young  Calvie cows. You pick.  462-2731,427-3796.  REGISTERED POODLE  puppies, 2 males, red.  $225. 789-6878. 789-4463.  789-4463. THE EASIEST WAY.TO  SHOP AT HOME!  Help  Wanted  THE ADVERTISEMENTS  appearing in this column  may or may not constitute  offers of employment. Persons  Per-sons responding to these  advertisements may be  required to pay fees in  advance for licensing, permits,  per-mits, dues, portfolios, registration,  reg-istration, processing or  other services . Opportunities  Opportuni-ties advertised in this column  col-umn may require training  at the expense of the  applicant. No guarantee of  job availability, implied or  direct, is made by publishers.  publish-ers. FOSTER HOMES NEEDED  NEED-ED for TROUBLED ADOLESCENTS.  ADO-LESCENTS. $450-$600  month to start, $100  BONUS Youth Services  International of Utah, Inc.  (Y.S.I.) is currently in need  of couples, families and  single people who want to  make a difference in a  young person's life. These  youth need your help now!  Agency training and support  sup-port is provided. For more  information call: 789-7030.  DENTAL  wanted, full-time  position. Apply at 606  North 1700 West. Vernal.  DRIVERSOTR Dry Box.  TUITION REIMBURSEMENT.  REIMBURSE-MENT. Now hiring Exp &  Inexp'd Drivers. Pay for  Exp. RIDER PROGRAM.  Min 23yrs old & Clean  MVR. SWIFT TRANSPORTATION,  TRANS-PORTATION, 800-347-9438.  EOE MF.  SOCIETYNEWS WRITER  wanted for local newspaper.  newspa-per. Must have good command  com-mand of language,  spelling and grammar.  Good writing and typing  skills and computer experience  experi-ence necessary. Must  meet public well, have  good time-management  and people skills. Full-time  employment. Call Vernal  Express for interview, 789-3511.  789-3511. OFFICE MANAGER  WANTED. Bookkeeping  skills necessary. Will be in  charge of classified advertising,  adver-tising, postal reports,  month end billing and subscriptions.  sub-scriptions. Computer  experience necessary.  Must be able to meet public,  pub-lic, answer telephone and  have good office skills.  Full-time employment.  Contact Vernal Express  for interview. 789-351 1 .  HOME TYPISTS, PC  users needed. $35,000  potential. Details. Call 1-805-962-8000,  Ext. B-2236.  B-2236. DRIVERS: FLATBED 48  state OTR. Assigned new  conventionals, competitive  pay, benefits. $1,000 sign-on  sign-on bonus, rider program,  flexible time off. Call  Roadrunner Trucking, 1-800-876-7784  ALASKA JOBSI Earn up  to $30,000 in three month  fishing Salmon. Also construction,  con-struction, canneries, oil  fields and more! For  immediate response call  1-504-646-4513 ext  7296K-01, 7 days.  $300-$1000 WEEKLY1  Join Centerpress Distributing  Distribut-ing and help the Nation's  fastest growing brochure  distributor mail brochures  from home. Free info.  Send S.A.S.E. to: Center-press  Center-press Distributing, P.O.  Box 25491-UP, Phoenix.  AZ 85002  UINTAH SCHOOL  DISTRICT  JOB  ANNOUNCEMENT  Part-time bilingual tutors  tu-tors are needed by Uintah  Uin-tah School District to  teach skills in reading,  math, spelling, and English  En-glish to persons not able  to speak English. Salary  $638 per hour. Deadline  for applying: Jan. 19,  1995. For an application,  please contact the Uintah  School District Office at  635 West 200 South -Ph.  781-3100.  Published in the Vernal  Express Jan. 11 and 18,  1995.  EMPLOYMENT  OPPORTUNITY  POLICE OFFICER I  Grade: G-8  Opening Date: Dec. 1,  1994  Close Date: Jan. 20,  1995  Salary:  $1,825 -2,478month  $10.53 - 14.30hour  Summary of Responsibilities:  Respon-sibilities: Under the general supervision  su-pervision of the UFSD  Sergeant, performs general  gener-al duty police work in the  protection of life and  property through prevention  preven-tion and directed patrol,  enforcement, answering  and investigating calls for  service, educating the  public and maintaining  social order.  Minimum Qualifications:  Qualifica-tions: 1. Graduate of an accredited  ac-credited high school or  equivalent.  2. 21 years of age.  3. Must possess, or  qualify for a Utah Driver's  Driv-er's License.  4. UtahP.O.S.T.ccrtifi-cation  UtahP.O.S.T.ccrtifi-cation required.  Method of Selection:  1. Written Testing  2. Oral Board  3. Interview - Chief of  Police  4. Background Check  5. Physical Agility Test  Apply To:  Job Service  1050 West Market Drive  VernaL Utah 84078  (801)789-1211  or  Vernal City  Personnel Office  447 East Main  Vernal, Utah 84078  (801)789-2255  Vernal City is an Equal  Opportunity and Affirmative  Affirma-tive Action Employer and  docs not discriminate  against the disabled in  employment services.  Published in the Vernal  Express Jan. 4 and 11,  1995.  Fob\"  Your Classified  32,000 readers in the Vernal TOr 20 words or less  Shopping Area. (does not include billed ads)  100 Total Market Coverage of  Uintah County Daggett County  Dinosaur and Rangely, Colo.  Please run the following Ad in the Classified Section of the Wednesday  I Vernal ExpressThrifty Shopper. 20  word extra tor BiacK type) print or wrue piaimy.  DEADLINE IS TUESDAY AT 11:00 A.M.  l l  5 6 ' 8  \" 9 10 11 12  13 14 15 16  17 IS 19 400 20  420 21 4o 22 4S0 23 48O 24  5H0 25 5 26 5 27 53 28  5B0 29 goo 30 g20 3l go 32  Ad To Run How Many Times:.  Name:  Bank Card Number:.  Clip and Mail to:  EASY WORKI Excellent  pay! Assemble products at  home. Call toll free, 1-800-467-5566  Ext. 8270.  Bus.  Opp.  DIET CENTER FRANCHISE  FRAN-CHISE in Vernal and surrounding  sur-rounding area for sale. For  more information contact:  Reita Ruppe, 789-1077 or  789-4954.  \"EXCELLENT PROF-ITS'LOG  PROF-ITS'LOG HOME WHOLESALERS  WHOLE-SALERS Join proven 18  yr Log Manufacturer, 16  kiln-dried log styles, starting  start-ing $9800. Exclusive territory.  terri-tory. Mr. Buck, 1-800-321-5647,  Old-Timer Log  Homes.  LONG DISTANT SAVINGS.  SAV-INGS. Six second billing.  1 1 cents per minute.  Career earnings from  home. $3,000 per month  reasonable within 6  months. 1-8OO-574-1076.  SUNQUEST WOLFF  TANNING BEDS - New  Commercial-Home Units  from $199. Lamps-Lotions-Accessories.  Monthly payments low as  $18. Call Today FREE  NEW Color Catalog, 1-800-462-9197.  Personals  HE THAT believeth on him  is not condemned, but he  that believeth not is condemned  con-demned already, because  he hath not believed in the  name of the only begotten  Son of God. John 3:18.  ARE YOU a die-hard basketball  bas-ketball fan? Be sure to  watch KBYU-TVs replay  of BYU basketball, Thursday,  Thurs-day, January 12th at 10:30  p.m. The Cougars take on  San Diego State in basketball  basket-ball action you won't want  to miss I '  Vehicles  NO RED tags, white hats,  balloons, phony rebates or  non-negotiable checks -Just  good dean deals!  Uintah Auto, 789-5036.  NEED HELP selling your  vehicle? Call Mick or Jim  at 789-2245 or 789-5036,  Uintah Auto.  iniDy  Ad will reach over  Signature  \"Visa\" MasterCard  \"BpneaWliwm  P.O. Box 1000, Vernal, Utah 84078  INSTANT FINANCING I  1986 Pontiac Firebird. It's  red Fredl Call Jim at 789-5036.  789-5036. Uintah Auto.  INSTANT FINANCING!  1986 Chev Celebrity 4  door sedan. Call Jim 789-5036.  789-5036. Uintah Auto.  NO DOWN payment needed  need-ed on this 1994 Dodge  Shadow at only $7995.  Really, it's a 1994. Uintah .  Auto. 789-5036.  GREAT COMMUTER car!  1992 Plymouth Sundance.  Low, low payments on  this! Uintah Auto, 789-5036.  789-5036. LOW PAYMENTS on  these! 1989 Buick Skylark,  1988 Dodge Shadow and  a 1991 Pontiac Sunbird.  Uintah Auto, Mick 789-2245  789-2245 or Jim 789-5036.  1984 FORD F150 heavy-half  heavy-half 4x4, good tires, 351  Windsor, RV Cam, ac,  good condition. $3,900  obo. Call 789-6722 or 781-1  781-1 180 and leave message.  TOYOTA LANDCRUIS-ERS.  LANDCRUIS-ERS. Selling 1969 and  1970 Landcruisers, as is,  has 327 Chevy engine.  Both vehicles great for  parts or to rebuild. Make  offer. 789-0210, 801-673-4274.  EXCELLENT FINANCING  for poor credit or limited  credit on up to 1994 model  vehicles. Uintah Auto.  LOOK AT all those trucks!  You want to sell a good  truck or buy one call Mick  or Jim, 789-2245 or 789-5036,  789-5036, Uintah Auto.  MI  per word, $4.00 minimum, (5 per  .Dates of Issues:.  Address:  .Expiration Date:.  Phone: 789-3511 Fax  INSTANT FINANCING!  1978 Chev Blazer, full  size, 4x4. Call Jim 789-5036.  789-5036. Uintah Auto.  INSTANT FINANCING!  1976 Ford F150 4x4. Call  Mick 789-2245, Uintah  Auto.  INSTANT FINANCING!  1985 Ford Bronco II. It's  nice. Call Jim 789-5036,  Uintah Auto.  INSTANT FINANCING!  1981 Toyota 4x4 pickup.  Nice truck! Uintah Auto,  789-5036.  LIKE NEW and low miles!  1991 Chev S-10 pickup.  Super financing! Uintah  Auto.  SUPER CAB and 4x4 too!  1990 Ford F150 XLT Lari-att  Lari-att with the 351 engine.  Uintah Auto. 789-5036.  NICE! 1987 Ford Ranger  super cab 4x4 with the  automatic. Call Mick, 789-2245.  789-2245. 1984 FORD F250 super  cab diesel. One owner!  Call Mick on this 4x4, 789-2245.  789-2245. Uintah Auto.  ONLY ONE left! 1990  Chev Suburban. Call Mick!  789-2245. Uintah Auto.  WOWI 1993 Dodge one  ton dually extended cab  4x4 with the diesel engine.  Uintah Auto. 789-2245.  WOW1 1990 Ford one ton  4 door 4x4. Call Mick 789-2245.  789-2245. Uintah Auto.  MUST SELL IMMEDIATELY!  IMMEDIATE-LY! Two arch-style buildings,  build-ings, 25X32 and 50X120.  1-800-843-1300 ext. 896.  Complete with door.  For  happening now...  Subscribe to the  Express  54 No. Vernal Avo  Vernal Express  TMty Sftaf p&i  789-3511  : 789-8690  3 ALL steel arch buildings:  40x30 was $7600, now  $3900. 40x56 was $9760,  now $5990. 50x98 was  $16,500, now $10,900. 1st  come basis only. 1-800-320-2340.  STEEL BUILDINGS! Winter  Win-ter sale! SAVE-Buy Nowl  Most sizes available. Take  advantage of special factory  fac-tory ' discounts. Spring  delivery available. Call  NOW for special pricing,  800-766-4790. j  1 1  FOR SALE: New welding  bed, fits short wheel base  Ford 1 ton, also welding  bed for 2 ton. 789-3470.  Wanted  WANTED: LOOKING for  anyone who is interested  in helping me write a book  Please call 781-0813.  GUITAR WANTED! Local  musician will pay up to  $12,500 for certain pre-1970  pre-1970 Gibson, Fender,  Martin and Gretsch guitars.  gui-tars. Fender amplifiers  also. Call toll free, 1-800-995-1217.  WANTED: ALUMINUM  beverage cans, 50 cent  per pound with this  coupon. Offer expires January  Jan-uary 18th. Also other  scrap metal. Open Monday-Friday,  9am-4 :30pm.  Saturday, 8:30am to  Noon. 1365 East Hwy 40  (behind Top Stop).  what's", "parent": 22650613, "version": 1739889978776748032}, {"id": 22650620, "paper": "Vernal Express", "type": "page", "date": "1995-01-11T00:00:00Z", "year": "1995", "month": "January", "day": "11", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/15/38/1538da6cf6cae50b04ca09dd5a34b25cabf47a18.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/a0/2b/a02b0cf8e0c6f0170ca2772a9d96fb50fc56bc73.pdf", "page": 7, "ocr": "AlDrairaaircft;  Vernal Express Wednesday, January 11, 1995 7  Flag Facts  Did You Know ...  LDQCRFCFOOXF  ALA VI O  Davis flfy Pharmacy  HOMETOWN VTwTaJD  Registered Pharmacist  on duty at all times  Open 7 days a week '  to serve you!  Vernal Pharmacist:  Tom & Glade 789-7011  Roosevelt Pharmacists:  Jeff & Cory 722-2255  scon  MURRAY  LP GAS y  24 Hour On Call Service  Sale & Service Fire Extinguishers  Competitive Prices  789-8883  \"What people put on Um Inslded  of their homes It their business.  What they put on tr OUTSIDE Is  oursi  Comply with Safety Policies  and Government Regulations.  Services Available  - : : N  : Urino drug collsctlon &  handling Blood draw  AfUr hours by appolntmant :  On lt collaction by request  On call 24 hr. for post  accldant coilsctlons.  Call (801) 789 5249  1179 E. Hwy 40 5 Vernal  Storage Containers'Bulk  Containers-'Bulk Foods  Storage Foods  Bulk Spices  Army Surplus  Ammo Boxes  -jiiiafiMi'ftflaidiflsf  1315 West Hwy 40, Vernal  C  Country home located on 5 acres  wilth 5 bedrooms, 2 12 bath, family  room, breakfast room, dining room  and much more....  Call Pat  . T III DrAnina I  III I I VkMIIV I  J Needs  mi H  Ft imii i ia  Ssatffcixtractor In the Basin j I JrTm  Lmu..v, i i hum I feMs.V SMmm I I II - I  PItTTTnraTri  1 M  -IN TOWN LOCATION-  Neat, 3 bedroom cottage with  detached garage and large shop area.  CLEO MORTENSEN  Snles Associate  Marketing Homes  Is My Specialty,  But People Are My Business!  \"Integrity That Lasts'!\"  Call Cleo  789-1482 or 789-2316  Pattie's  Beauty Shop  Pattie Emmett  owneroperator  By Appointment  1-4926  Mt. Olympus Waters  789-2875  Hot Soups  Hot Chocolate  Complete Coffee Service  Fresh, clean tasting  mountain spring water  Serving Home  or Office  FOR ALL  w YOUR  F PROPANE  NEEDS  With years of experience and  knowledge in the propane business.  Come by and see our complete line of  heaters, torches and propane bottles.  L 789-3198  YOU  Buy the House  I Open the Doors  Dru Hopla  789- 7555  790- 8558  ASPEN BROOK  REALTY INC.  \"Honesty and Integrity\"  This .home has over 2700 sq. ft.  and is located on approx. 1 acre-  new carpet, brick construction,  pellet stove and large family room.  Harrell  ASPEN BROOK  REALTY  m Wm A ft.  i  Excellent starter home or rental. New  carpet and newly painted.  ft For 23 years, there were 15 stripes on the American flag.  ft The red stripes on the flag symbolize England, and the white  stripes represent America's separation from its mother country.  ft The American flag also is called The Star Spangled Banner; The  Stars and Stripes; The Red, White and Blue; and Old Glory.  ft The American flag is older than the U.S. Constitution.  ft Francis Hopkinson, a delegate to the Continental Congress, designed  de-signed the American flag not Betsy Ross as most people learn.  ft Flag Day is the national holiday commemorating the adoption of  the American flag.  ft Memorial Day is the only national holiday when the flag is  flown at half-staff.  ft When new states join the union, stars are added to the flag on  the following July 4.  ft The design of the American flag was standardized in 1912 by  President William Howard Taft.  Source: Citizens Flag Alliance News USA  NEED A REAL ESTATE LOAN?  1ST AND 2ND MORTGAGES  QUICK APPROVALS  BAD CREDIT OK  CALL KENNY AT PREMIER FINANCIAL MTG  1(800) 781-9333  I I Consumtr  V I information  Catalog  The Greatest Thing  Since Sliced Bread  No matter how you slice it, our free Consumer  Information Catalog is great food for thought.  The Catalog dishes up more than 200 free and  low-cost government booklets on subjects such as  staying healthy, eating right, finding a job, getting  federal benefits, using credit, buying a home,  helping your kids, taking care of your car, and  much, much more.  To get your free copy, send your name and  address to:  Consumer Information Center  Department GT  Pueblo, Colorado 81009  U.S. Ceneral Services Administration  Subsidized Housing  for the Low Income  Elderly and Disabled  (Elderly must be 62 years of age)  1 BEDROOM APARTMENTS  EQUAL  OPPORTUNITY.  HOUSING f ST  TDD 298-9482 WVIIIrltA  SHARON SKERL 789-2788  Do you have qualifying  problems? Want to buy,  refinance, need a Second  Mortgage or just want to apply  by phone? Try our FRESH  START PROGRAMS - special  loans for almost every  situation. Great rates & Down  Payments as low as 3 Ask  your Realtor or call us directly.  FIRST PREFERRED MORTGAGE  1-800-254-3232  3 bedroom home-All on 1 level with  h . fireDiace. covered Datio.  789-7555 789-9238 I uuuujuu u y LuU v u u uu) n  790-5063 Mobile 1 n ? n n fl l  1 A claissnfiiecll adls!  r ill II  -GOOD LOCATION-  FftNU  MIS,  4 J ?, I  tMXKttO MttffiMilO MUMMilO MIiWCM  FULL TOE  I rv n n n n  1 Aoverase in uime  ' If ,a. . II  Jy 789-353L1 j.  The oldest road in the United States Is El Camino Real The Royal  Road built In New Mexico in 1581. It is now known as Highway 85.  I X.ftUJJaT  Rent  at  Heated Swimming Pool  WasherDryer Hookups  2 & 3 Bedrooms  wbasement or garage  Central forced air gas heat  Clean spacious townhouses located at  100 North 1350 West  Call Paulette at 789-0815 orRebeca at 789-9156  wrnrn  COOKIE  Pheasant Glen  Apartments  1 month FREE rent  with 12 month lease  Starting  $375  Cable TV  Kitchen appliances  Including dishwasher  & disposal  Full Time Professionals  Thorough knowledge of the market  20 years experience  Proven Sales Record  Winners of ERA'S 100  Customer Satisfaction Award", "parent": 22650613, "version": 1739892183486431232}, {"id": 22650621, "paper": "Vernal Express", "type": "page", "date": "1995-01-11T00:00:00Z", "year": "1995", "month": "January", "day": "11", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/49/01/4901d24d05d6d793dc94875608773258f65439cc.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/07/c5/07c5cfd5eda262405dad512c6dfbeb53dae99744.pdf", "page": 8, "ocr": "8 Vernal Express Wednesday, January 11, 1995  jl v r  Uintah County Search and Rescue  ODD  by Melanle Morrison  Lifestyle Writer  It's 12 midnight and the phone  rings. A dedicated individual is startled  star-tled from a sound sleep and reaches  over. In a raspy, almost horse voice,  he says, \"Hello.\" The person on the  other end announces quite matter-of-factly  that a child has wandered  away from a family camp and  hasn't been seen for hours.  Within minutes clothes are on and  the four-wheel drive truck and its  occupants are enroutc to be briefed  on the situation.  Such is the scenario for any one  of 35 members of Uintah County  Search and Rescue.  \"These guys deal with life and  death situations all the time, and ask  for nothing in return,\" said Sheriff  Rick Hawkins. \"They give up their  jobs and many times their livelihood  liveli-hood and give themselves to their  community.\"  Uintah County Search and Rescue  is under the auspices of the Uintah  County Sheriff's Department.  Monday evening the 1995 officers  were installed. They include: Danny  Moore, commander; Nick Eaton,  captain; Val Middleton, lieutenant;  Chuck Cunningham, treasurer; and  Denile Gale, secretary.  Members of Uintah County  Search and Rescue have started  1995 out with one of many searches  they will be involved in this year.  For two days this past weekend,  several members spent hours combing  comb-ing the roads in the 4,000-plus  square miles of Uintah County  looking for a clue as to the whereabouts  where-abouts of a member of the Ute Tribe  missing since Jan. 1. According to  Commander Danny Moore, five to  six vehicles spent two full days  each, racking up over 300 miles per  vehicle to search the Book Cliffs as  well as other areas in the southern  portion of Uintah County.  But 1994 had to be one of the  biggest years in recent history for  the Search and Rescue. They were  involved in 23 searches totaling  A . V -J ' . \"  . -  VV.V ' ' h 1 y  t t , - V i  7 . \" . s - 1  OE33 i0k '':: f ' : I  r \" 3  , - ; ----  Caleen Hulet, Turning Point director, and Janet Stevens, UBATC business instructor, discuss and organize  orga-nize the upcoming motivational conference set for Friday, Jan. 27. The conference is sponsored by  Turning Point and the U'ntah Basin Applied Technology Center.  1,567 man hours and over 16,800  miles. That equates to over $61,000  in man hours at a base of $10 per  hour; and close to $75,000 in  mileage at 30-ccnis per mile. A total  to-tal of $135,654 was saved by  Uintah County taxpayers for the donated  do-nated services of these 35 men.  In addition to the number of man  hours and mileage logged, there arc  hidden expenses that can not be  tracked. As an example, all but a  few of the current members are employed  em-ployed or self-employed. When  they arc called out on a search, the  members loose time and occasional  wages from their jobs. The majority  of members have families and the  time spent away from their loved  ones is also tremendous.  Thcv nkn n;:i;t in snrnritv mils  such as traffic control at the high  school during graduation and sport-  ing events and provide security during  dur-ing the Dinosaur Roundup Rodeo.  Over 650 hours and 2,100 miles are  logged by the group for security duties.  du-ties. Search and Rescue members are  trained in various types of  emergency situations. Members in  1994 spent hundreds of hours diving  div-ing the waters of Red Fleet in  search of David Turner of Vernal.  They used their diving expertise as  well as support people to comb the  waters north of town. This search is  still ongoing and will continue as  leads are uncovered and the weather  breaks.  Another high-profile search  Uintah County was involved with  was assisting Duchesne County in  ihe search of a Utah Highway Patrol  pilot whose helicopter went down  last summer. Doyle Thorne was  found dead in western Duchesne  County after his copter crashed  while he was searching for a lost  toddler who had strayed from a  family camping trip.  Besides diving, they also provide  rescue services using snow machines  ma-chines and off-road vehicles. Last  month they rescued a snowmobiler  who was seriously injured when her  machine hit a tree. They went into  V,  Y  1995 Uintah County Search and Rescue members are: (sitting, left  to right), Val Middleton, Sheriff Rick Hawkins, Danny Moore,  Chuck Cunningham, Nick Eaton; (middle row), Terry Shiner,  Howard Carroll, Merlin Walker, Harley Hales, Mike Schaefermeyer,  Ellis Tait, Keith McDonald, Julius \"Chunky\" Murray, Arden Stewart,  Drex Bowden, Mike Gardiner; (back row), Paul Johnson, Sam  an area north of East Park on snow  machines and using a sled, brought  the patient out far enough so Life-Flight  Life-Flight could land and fly her directly  direct-ly to Salt Lake City. All of the  members are First Responders,  trained in advanced CPR and first  aid. Seven members are certified  Emergency Medical Technicians.  \"We use whatever is available that  the members have,\" said  Commander Moore. 'This includes  snow machines, four-wheelers,  boats, horses and four-wheel drive  vehicles.\" All of the equipment is  donated by the members as well as  the fuel and insurance that is required.  Search and Rescue was organized  in 1960 under Sheriff Norman  Fletcher. He wrote in a history of  the group, \"Soon after I took office  in January, 1959, 1 was very much  aware of the fact that we were very  short of man power in case of an  emergency; one deputy sheriff. I  had been thinking about a group of  men that a few years before had  tried to form a jeep posse and it had  failed.  \"About this same time, I had discussed  dis-cussed my feelings with Bill Mott,  deputy sheriff, and Jay Abplanalp.  Both had four-wheel drive units.  They were each very excited and  urged me to do something about it,\"  Sheriff Fletcher wrote.  He explained in the writing that  after considering organizing, he selected  se-lected men who had four-wheel  drive units and who were equipped  with horses and trailers. He wrote  letters to men who were considered  \"public spirited\" and invited them  to an organizational meeting.  Sheriff Fletcher asked for assistance  from a unit in Price to help get  Uintah County's unit off the  ground.  Other units throughout the state  were also organizing during this  time and Utah led the nation in this  type of organization. But a big concern  con-cern Sheriff Fletcher had was that  the patrol have a wide range of  skills and was not just a \"jeep  posse.\" Jay Abplanalp was appointed  appoint-ed as the first commander of the 17-member  17-member organization.  Following the unit's first call-out,  an airplane crash on the Colorado  stateline, they decided that there  Tech Cemtieir to Dnostt  mmotiivatiioirDaD comtfeireirDce  It's time to end the winter  BLAH's! \"Beyond Yesterday  Focusing on Today\" is a one-day retreat  re-treat from the hectic world sponsored  spon-sored by the Uintah Basin Applied  Technology Center and Turning  Point on Friday, Jan. 27 from 9 a.m.  to 3 p.m. The conference will be  held at the UBATC, 1100 East  Lagoon Street, in Roosevelt. Simple  ideas for taking care of self and  family will be taught. This seminar  will guide its participants toward a  new, refreshing way to think about  themselves, their priorities, family  and self-esteem.  t  The keynote speaker is Suzanne  Hansen, a professional motivator,  speaker, author, mother, radio and  TV personality. Her enthusiasm and  positive attitude will enhance the  lives of all who attend.  Additional workshops will be presented.  pre-sented. 'This is the Moment\" will  help jKsoplc to deal with today and  learn that today is what matters  most. \"What I Want to Be is Up to  Me\" is a workshop for parents to  Howard, Blaine Watson, Doug Jensen, Udel Birch, Mike Holmes,  Doug Timothy, Mike Adams and Nate Inouye. (Not pictured, Denile  Gale, Chad Crosby, Gary Maxson, Harold Cook, Phil Dittmer, Phil  Timothy, Ron Gibson, Mike Knibbe, John Jorgensen, Jerry Dimick,  Bill Calder, Don Preece.)  was a real need for radios for the  group. A fund raising drive was  launched to raise enough money to  purchase radios. They were assigned  as-signed a radio frequency and  bought some used General Electric  equipment and a base station with a  tower topped the court house was  installed. As Sheriff Fletcher explained,  ex-plained, \"We were on our way.\"  Even though the group is trained  for several types of emergency situations,,  situ-ations,, humans are not the only  benefactors of Search and Rescue's  services. During the floods ot 1983,  the group assisted in rounding up  stranded farm animals that were  trapped by swift moving water.  Hunting season is Search and  Rescue's busiest time. 'There are so  many times we are called out to  find a lost hunter and the families  have no idea where to start,\" said  long-time member, Ron Gibson.  \"We don't get called until late when  the hunter doesn't return home and  by that time it is dark and we don't  have much to go on.\" When that  happens, members become detectives.  detec-tives. They gather information from  friends and relatives and then try to  figure out where the hunter may  have gone.  Commander Moore said that  many times if they wait a couple of  hours after the call, the lost person  returns on their own. \"Sometimes  we will pass the lost person on our  way to the search,\" Commander  Moore said. \"Or else we will be notified  no-tified that they have returned  home.\"  The 35-membcr group for 1995  includes: officers, Danny Moore,  Nick Eaton, Van Middleton, Chuck  Cunningham and Denile Gale;  learn how to help their children  know that they can become whatever  whatev-er they choose; whether male or female.  fe-male. Maurices from Vernal will  present the workshop \"Fun, Fashion  and Flair.\" They will make a presentation  pre-sentation on dressing in today's  fashions and accentuate the positive.  posi-tive. \"Does It Hit Home?\" has information  infor-mation about domestic violence.  Learning how to add to and build on  the good relationship you have with  your spouse or significant other will  be the subject of \"Kindling the Fire  Without Being Burned.\" \"Combat  the Fat\" is a workshop that will  teach how to eliminate the fat in diets  di-ets for a healthier lifestyle. \"Rolling  in the Dough\" is not about money,  but ideas on saving time by using  Rhodes frozen dough to create  tempting and delicious items.  \"Kids, Gangs and Violence  Why?\" will address the more common  com-mon reasons that youth have turned  to this type of lifestyle. Effects of  home environment, media and peer  pressure will be discussed. \"Good  Stress, Bad Stress Managing it  All\" will provide a definition of  trainers, Sam Howard, Howard  Carroll and Arden Stewart; squad  leaders, Udell Birch and Mike  Holmes; assistant squad leaders,  Mike Schaefermeyer, Mike  Gardiner and Jerry Dimick; quarter  master, Paul Johnson; members,  Terry Shiner, Merlin Walker, Harley  Hales, Keith McDonald, Julius  \"Chunky\" Murray, Drex Bowden,  Blaine Watson, Doug Jensen, Doug  Timothy, Mike Adams, Nate  Inouye, Chad Crosby, Gary  Maxson, Harold Cook, Phil  Dittmer, Phil Timothy, Ron Gibson,  Mike Knibbe, John Jorgensen, Bill  Calder and Don Preece.  As with any volunteer organization,  organiza-tion, money and the lack of it seems  to be a big problem. Search and  Rescue members provide all of their  own equipment, vehicles, fuel and  time to Uintah County. They also  receive money through fund raising  drives and have a small budget from  the county through the sheriff's office.  of-fice. Currently they are looking to  buy a new sled to carry equipment  in by snowmobiles and other winter  emergency items. The cost of the  new purchases is estimated at  around $5,000.  , Uintah County Search and Rescue  does not collect from victims or the  families for their services.  Commander Moore said that about  50-pcrcent of the time they receive  a thank-you note and an occasional  donation following a rescue.  So why does someone devote so  much time and money to an organization?  organi-zation? Members seem to agree that  it's for the good feeling of helping  their neighbors and friends and  making a difference in their community.  stress, how it affects a person physically  physi-cally and emotionally, how to manage  man-age stressors because they are always  al-ways going to be there. Learn ways  to protect yourself against unwanted  advances or attacks. Attend the  workshop titled \"Aware or Beware.\"  \"Creating a Designer Look\" is a  workshop demonstrating ways to  add pizazz to homes by utilizing a  variety of color, patterns and fabrics  as well as ideas for wall coverings  such as stenciling, wall paper, paint,  etc. \"Where There's a Will There's  a Way\" will be presented to teach  how to plan for the future as well as  the future of children and posterity.  The cost of the conference includes  in-cludes lunch. Free day care will be  provided as space is available.  Registration forms are available at  the Turning Point office at the  UBATC in Roosevelt. For more information  in-formation call 722-4523 or 789-1942.  789-1942. Deadline for registration is  Jan. 23.  In addition to door prizes, participants  partici-pants will be eligible to win a  night's stay at the LC Ranch  Honeymoon Lodge. f", "parent": 22650613, "version": 1739888676128686081}, {"id": 22650622, "paper": "Vernal Express", "type": "page", "date": "1995-01-11T00:00:00Z", "year": "1995", "month": "January", "day": "11", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/9f/15/9f15935f551abc81f0515fcc60e293ea4d229659.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/09/25/0925bda5e1db5a8fb23206978d3ea783c15a077f.pdf", "page": 9, "ocr": "7\" 1  7 J-nlr.V '  . i t . f ' , ' \" ; \" I  8 v \" . . , - , 4 I.  ' ' ' x .  V I'  Randy Mayne and Christine Vickers  Vickers and Mayne set  February wedding date  Mr. and Mrs. Howard Vickers of  Vernal, are-pleased to announce the  marriage of their daughter,  Christine, to Randy Mayne, son of  Mr. and Mrs. Scott Mayne of Sandy.  The couple will be married in a  ceremony, Saturday, Feb. 4 and will  be honored at a reception following  the ceremony at the Silvercrest  Reception Center in Sandy from 7  p.m. to 9 p.m.  Christine is currently employed at  Nationwide Insurance. She is a  1992 graduate of Highland High  School and has been attending Salt  Lake Community College.  Randy is a 1992 graduate of  Hillcrest High School and is a student  stu-dent at the University of Utah. He is  employed at the Jon M. Huntsman  Center.  Following their marriage, the couple  cou-ple will make their first home in  Sandy.  Clarke and  Leininger marry-New  marry-New Year's Eve  Newborns  A daughter was born to Joe  Honcycutt and Amy Williams on  Jan. 1. She weighed 8 lbs.\"  A daughter was born to Scott and  Stacy Allred on Jan. 5. She  weighed 8 lbs. and is named  Sydney Dorene Allred.  A daughter was born to Frank and  Darla Crowther on Jan. 7. She  weighed 6 lbs. 3 oz.  A son was bom to Corry and Kim  Hulet on Jan. 9. He weighed 7 lbs.  and is named Keaton Corry.  Joseph Walter Clarke, Jr., son of  Elsie and the late Joseph Walter  Clarke, Sr., and Debroah Jean  Leininger, daughter of Louis and the  late Sally Lambries, were married  Dec. 31 in a private ceremony at the  World Vision Assembly of God  with Pastor Stan Airas officiating.  Joseph is the sound engineer and  production manager for country  western singer, Chris Le Doux.  Deborah attends Utah State  University with graduation set for  March of this year.  The couple will continue to reside  in Vernal.  Ruby Wallace celebrates  80 years young  Long-time Vernal resident, Ruby  Wallace, recently celebrated her  80th birthday during a family gathering  gath-ering at the home of a daughter,  Donna and Ted Workman in Vernal.  She was joined by her other daughter,  daugh-ter, Ilene (Bruce) Maddux of Boise,  Idaho and many of her grandchildren  grandchil-dren and great-grandchildren.  Mrs. Wallace worked for several  years as a waitress at the Grill Cafe,  the Vernal Cafe and the  Commercial Cafe. She was manager  manag-er of the lunch counter at the  Quality Drug and assistant manager  at the Hotel Vernal. She and her  husband, Earl Batchelor, bought the  Gateway Cafe from Harold and  Margie Thatcher. This was a home  away from home for many oil field  and local people. Several class  graduation banquets, civic and club  meetings and dances were held  there.  Her social affiliations include the  Vernal Duplicate Bridge Club; vice  president and program director of  the Uintah Club; a member of the  Council on Aging; secretary for the  night Relief Society and care of the  nursery in the LDS Church.  \"  Ruby Wallace  She traveled with her husband  Earl, to many places before his  death. They visited Kuwait;  Cartagena, South America;  Bengazi, Libia and Rome, Italy.  Ruby and her husband, Art  Wallace, enjoy traveling, gardening,  fishing, dancing and playing cards.  i  Vernal City  SECRET WITNESS  Program 789-8888  1  Acute Cut  Welcomes  Sue Ann Hughes  to the staff  Tue - Sat 9 a.m. to 6 p.m.  789-0064  -1 y .  f ' i \" I, ' ' ,  : ,  't ' ' '  Vernal Express Wednesday, January 11, 1995 9  7 t  i.  f  '  t  ,Kt  s  Reed J. Sleight and Stacy Atwood  Atwood and Sleight to be  honored at reception  1 1  4 i.  Tristen Harlow and Kyle D. Calder  Mr. and Mrs. Mac Atwood of  Vernal arc pleased to announce the  marriage of their daughter, Stacy B.,  to Reed J. Sleight of Vernal, son of  Lynn and Marie Sleight of  Duchesne.  They will be married Saturday,  Jan. 14 and will be honored at a reception  re-ception from 7:30 p.m. to 9 p.m. in  the Davis 4th LDS Ward Chapel.  The bride is employed at Day's  Market and the groom has worked  for the Pepsi-Cola Company for the  past ten years.  Following their wedding, the new-lyweds  new-lyweds will make their tiome in  Vernal.  Harlow and Calder to  exchange wedding vows  Tristen Harlow, daughter of Don  and Nolen Paugh of Las Vegas,  Nev., and Cal Harlow of Vernal,  will become the bride of Kyle D.  Calder, son of Jeff and Kerri Calder  of Vernal and the late Kelly Dean  Goodwin, in a wedding ceremony,  Saturday, Jan. 28 in the Ashley 1st  Ward Chapel.  They will be honored at a reception  recep-tion following the wedding from 7  p.m. to 9 p.m., also in the Ashley  1st Ward Chapel.  Following their wedding, the new-lyweds  new-lyweds will continue to reside in  Vernal.  IHlospitl:aDvG)DyuDeeirsbiriglh);eirD cdays  One of the oldest and most dedicated  dedi-cated volunteer organizations in  Ashley Valley is the hospital auxiliary,  auxil-iary, often called the \"Pink Ladies.\"  And among the numerous volunteers  volun-teers is their oldest member, Mollie  Stockton, who turned 88 this past  November.  Mrs. Stockton has been a volunteer  volun-teer for 15 years at Ashley Valley  Medical Center after retiring from  30 years of service in the nursing  field in Las Vegas, Nev. She says,  \"I've always like nursing and just  couldn't stay away from the hospital.\"  hospi-tal.\" Mrs. Stockton moved to Vernal  to live near her daughter, Mrs. W. F.  Morton, 15 years ago following the  death of her husband and her retirement.  retire-ment. She says a lot has changed in the  medical field since she first became  acquainted with it She explained  that she began her nurses training  after high school and then met her  husband and was forced to quit because,  be-cause, \"nurses couldn't be married.\"  It wasn't until several years later  that the singlemarried rules were  lifted and Mrs. Stockton went back  to school to continue her lifelong  desire to help people. She graduated  as a licensed practical nurse and  worked on the surgical floor at what  was formerly the Clark County  Memorial Hospital. She preferred  the surgical floor because, \"I liked  to see my patients get better and go  home.\"  At the age of 88, Mrs. Stockton  says that volunteering as a pink lady  is great for senior citizens who enjoy  en-joy getting out and mingling with  people. But the organization is always  al-ways looking for dedicated and responsible  re-sponsible ladies to help. The commitment  com-mitment is minimal; just a few  hours a week and the desire to want  to help other people.  Mrs. Stockton's duties as a pink  lady doesn't require the same technical  tech-nical knowledge as a nurse, but the  caring and compassion goes hand-in-hand.  Her duties, as well as the  Marriages  Michael Brandon Johnson and  Traci Richardson, both of Vernal,  Jan. 4.  Robert Kurt Hunt and Amanda  Hope Richins, both of Roosevelt,  Jan. 5.  Mark Eugene Williams and  Michelle Elison, both of Tridell,  Jan. 5.  Reed J. Sleight and Stacy B.  Atwood, both of Vernal, Jan. 6.  Jess Vem Richens and Connie M.  Chappell, both of Vernal, Jan. 6.  Tren S. Horrocks and Maria  Louise Horrocks, both of Vernal,  Jan. 9.  Timothy Kent Redmond and Kris  Lynn Kendall, both of Salt Lake  City, Jan. 9.  i  1  i  I :  \" \".j  Hospital volunteer, Mollie Stockton helps make heart patient, Carma Clark comfortable during her stay  at Ashley Valley Medical Center. Stockton is one of numerous \"pink ladies\" at AVMC.  duties of all the other pink ladies, is  to tend to the comfort of the patients  pa-tients during their stay at the hospital.  hospi-tal. Sherry Stealer, chief clinical officer  of-ficer at AVMC calls the pink ladies,  \"patient advocates. They do so  many things that we tend to forget  just how much they do.\" Stetder  says that if the pink ladies were not  there, the hospital would be forced  . to hire more people to do the same  work.  Living a long and active life runs  in her family. Mrs. Stockton's  mother passed away at 106 years  old and at the age of 102, she rode  as a passenger on the back of a motorcycle  mo-torcycle in a Wyoming parade.  When she's not at the hospital,  Mrs. Stockton enjoys keeping in  touch with her 13 grandchildren, 47  great-grandchildren and 4 great-  great-grandchildren. She also enjoys  en-joys knitting (for which she is well  known) and playing pinochle and  bingo at the Golden Age Center.  She is also a board member of the  Uintah Club.  The pink ladies keep water pitchers  pitch-ers filled for patients who are allowed  al-lowed fluids, run errands, clear  meal trays, help feed patients and  assist the nursing staff with clerical  duties. They also operate the in-hos-pital  gift shop and the candy and  pop machines. From those proceeds,  pro-ceeds, the pink ladies have donated  numerous pieces of medical equipment  equip-ment to the hospital as well as items  used for the patient's enjoyment,  such as a VCR and Nintendo machine.  ma-chine. They also provide teddy  bears to newborns and toys to patients  pa-tients under the age of 8.  The pink ladies will be honored at  a dinner Jan. 25 when the new officers  offi-cers will be installed and the past  officers thanked. The 1994 officers  include, Wilma Webb, president;  Nancy Grua, vice president; Jean  Smith, secretary; lone Williams,  treasurer; and Jean Staten, parliamentarian.  parlia-mentarian. The new officers will be: Nancy  Grua, president; Jean Smith, vice  president; Leah Anderson, secretary;  secre-tary; lone Williams, treasurer;  Wilma Webb, parliamentarian; and  Verlie McCarrell is the historian.  The organization became chartered  char-tered in 1974. Leah Anderson is the  only active charter member left.  The others have either moved or became  be-came unable to dedicate the hours  to the organization.  Pr  til  The children of Lewis Ray Livingston and Irene Mary Broadbent  Livingston are honored to announce the 50th wedding anniversary of  their parents. Lewis and Irene were married in Odgen, Ut., on  January 17, 1945. They have resided the majority of their lives in  Craig, Co., where Lewis was employed as a rancher and realtor.  A summer Open House honoring the couple will be held June  24, 1995, at their residence: 870 Finley Lane, Craig, Co.  Children of Lewis and Irene Livingston include: Douglas, wife  Rozan and eight children, Meeker, Co.; Scott, wife LaRae and four  children, Mexico Torreon Mission; Lynne, husband Ron and two  daughters, Tucson, Az.; David, deceased; Mary, St. George, Ut.;  Boyd, wife Kamille and two children, St. George, Ut.; Carol, husband  Jeff and three children, Woods Cross, Ut  Here's to many more years of love and happiness, Mom & Dad.  We love and salute you for your unwavering support, years of  devotion to God, and service to community, a shining example to all.", "parent": 22650613, "version": 1739888693354692608}, {"id": 22650623, "paper": "Vernal Express", "type": "page", "date": "1995-01-11T00:00:00Z", "year": "1995", "month": "January", "day": "11", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/fe/8c/fe8c6864cf99f97abc052fbe80bec278447d43c9.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/33/d2/33d219f961910c3bee3c6c3fff244815281103e5.pdf", "page": 10, "ocr": "' n m m n  10 Vemal Express Wodnesday, January 11, 1995  Camp May Ruplo  Members of Camp May Ruple,  Daughters of Utah Pioneers, met  Monday, Jan. 9 at the home of Lyla  Bennion. Lunch was served to nine  members.  Tea iron pemnraiinig Doses  successful H994 season  The final team penning competition  competi-tion for 1994 was held at the  Western Park over the Thanksgiving  weekend. The two-day event included  includ-ed 115 teams from all over the  Uintah Basin as well as several surrounding  sur-rounding states. The event was hosted  host-ed by PDQ Penning for the second  year in a row.  Final standings arc as follows:  open division, Frank Young, Randy  Scarle, Bryce Barker, first; Claryn  Gardner, Lee Boren, Jerry Boren,  second; Cindy Young, Brett Sabcy,  Bryce Barker, third; fast-go, Frank  Young, Randy Scarle, Brett Sabcy,  first place; and Frank Young, Randy  Scarle and Bryce Barker, second  place.  The team of Frank Young, Randy  Scarle and Brett Sabcy took first in  the pro-am division. The teams of  Floyd Massey, Brett Stubbs, Cory  Stubbs and Vance Merrill, Cory  McNeil and Joe Hacking placed  second and third, respectively.  Other competitors included Bryce  Olsen, Alana Searle, Randy  Vincent, Tamara Vincent, Lee  Boren, Rhctt Scarle and Cindy  Young. The team of Frank Young,  Randy Scarle and Brett Sabcy won  first in the fast-go in the pro-am division.  di-vision. The team of Leah Harrison, Kirk  Harrison and Lorin Owens placed  first in the novice division. Coming  in second and third were the teams  of Phil Timothy, Jcncssa Davis and  Brindy Merrill, and David Swctt,  Sonja Soulc and Megan Lewis.  Kent Boren, Scott Slaugh and Mike  Soulc earned first place in the fast-go,  fast-go, novice division.  The team of Randan Vincent,  Randy Vincent and Tamara Vincent  placed first in the mixed category.  Second and third were taken by the  teams of Casey Spcirs, Garth  Horrocks, Joricl Horrocks, and Brett  Sabcy, Cindy Young and Alana  Scarle. The mixed fast-go was taken  by Casey Spcirs, Garth Horrocks  and Joriel Horrocks.  In the ladies division, the team of  Linda Stubbs, Cindy Merrill and  Teresa Boren took first place.  Second place went to the team of  Leah Harrison, Tamara Vincent and  Ilcne Fcdelleck.  Four places were awarded in the  youth division. First place went to  the team of Dusty Olscn, Alana  Searle and Josh Horrocks. The  teams of Alana Scarle, Dirk Olscn  and Dusty Olscn; Dirk Olscn, Alana  Scarle and Josh Horrocks; and Josh  Horrocks, Dirk Olscn and Dusty  Olscn finished second through  fourth, respectively. First place in  the fast-go went to Dirk Olsen,  Alana Searle and Josh Horrocks.  Joe Hacking finished first in the  single division with Randy Vincent,  Frank Young and Rhctt Searle finishing  fin-ishing second through fourth, respectively.  re-spectively. Randy Vincent finished  first in the fast-go in the singles division.  di-vision. Since team penning was introduced  intro-duced in the Basin two years ago,  the sport has really taken off with  membership in PDQ growing to 160  riders. Competitions throughout  Utah go on from April to  November.  'This year (1995) should be another  an-other great year,\" said Randy  Vincent, PDQ president. Anyone interested  in-terested in more information about  team penning or PDQ, can call 789-1962  789-1962 or 789-3714.  I -  I J . \"  lr & , - i (J Lj  -.4.-1  Little youth division: Shad Boren, Carson Young, Lance Stubbs  Captain Rcva Whitmore conducted  conduct-ed the meeting. The history was  given by Ezma Reynolds on historic  Lehl which was the sixth city at that  time in the territory of Dcscrct  Lesson leader Marjorie Akclund  gave the lesson on Mosiah Lyman  Hancock who was a native of  KiftlancLOhio.  The next meeting will be Feb. 13  at the home of Ezma Reynolds.  Lomahaftewa is featured  artist at Film Festival  BMHMMBl4k. liil.iMI.i,',;il;liiiiiliiilriiill A,MwmmiMMsmm'''  '  1 1 sr-  Open division first place:  Barker  Frank Young, Randy Searle and Bryce  Joe Hacking receives first place  in singles division in team penning.  Old Town Gallery of Park City,  recently announced an exhibition of  Dan Viets Lomahaftcwa's hand  pulled prints and paintings.  Lomahaftewa, who hails from the  Uintah Basin, will be honored at a  reception Saturday, Jan. 21 from 6  p.m. to 9 p.m. at the Gallery. His appearance  ap-pearance coincides with the  Sundance Film Festival and his participation  par-ticipation with the Native American  feature films. The show will be on  display from Jan. 19 through Jan.  31.  Lomahaftewa is a Native  American artist who combines ancient  an-cient imagery with modern traditional  tradi-tional techniques. He credits his  Choctaw mother and Hopi father for  his perspective on art and life. As he  explains, 'The way I've been  brought up, you don't separate your  spirituality from your lifeway.\" In  addition, Lomahaftewa fortified his  rich heritage with a Bachelor's of  Fine Arts degree from Arizona State  University in 1981.  A brilliant colorist, he combines  techniques of underpainting and  layering from the old masters with  indigenous imagery from archaic  petroglyphs and kachina spirit figures.  fig-ures. He brings these sharply angu-  (ju J SS5  \"Winter Gathering\" by Dan V. Lomahaftewa will be featured at the  Old Town Gallery in Park City during the Sundance Film Festival.  Lomahaftewa is a Native American artist living in Ft. Duchesne.  K Youth division first place: Dusty Olsen, Alana Searle, Josh  ifl n ISJI ' Horr0ckS  Novice division first place: Leah Harrison, Kirk Harrison, Lorin l . x  Owens -xj 1 x \"''  ' I I f;t  II X -M Ladies division first place:  I. , - $ I I lLi Boren  lar figures to life with radiant, jewel-like  tones and textured backgrounds,  back-grounds, creating a modem tapestry.  Lomahaftewa visually articulates  an ancestral memory that he welcomes  wel-comes all to share. Through his artwork,  art-work, one can begin to hear the music,  mu-sic, feel the rhythms, and experience  the ancient stories that he knows so  well. In his words, \"It feels good. It  is good. It is good that we have  these helpers.\" In recreating the petroglyphs,  pet-roglyphs, he takes great care to  faithfully represent the body paint,  regalia and physical movements of  the spirits, in respect for these  kachina and petroglyphic symbols.  \"My dad taught me,\" he says, \"that  part of Hopi aesthetic is correct-ness.\"  correct-ness.\" Through a Utah Arts Council  Visual Art Fellowship in 1989,  Lomahaftewa was able to pursue research  re-search on what has evolved into the  \"Primordial Spirits\" series, inspired  by petroglyphic imagery found in  northeastern Utah. The series con  tains over 100 images thus far.  \"Poem Incarnate\" from this series,  was chosen to represent the Santa  Fe Indian Art Market, awarding  Lomahaftewa as the Poster Artist in  1993.  Also another exciting announcement  announce-ment was that Lomahaftewa has  been chosen as the official commissioned  commis-sioned artist of the Utah Opera for  the 1995 through 1996 season. He  will be exhibiting the painting for  the three planned performances of  \"La Boheme,\" \"The Barber of  Seville,\" and \"Dream Keepers,\" an  original Native American opera and  dance program.  Among other numerous distinctions,  distinc-tions, Lomahaftewa's work is represented  repre-sented by the Heard Museum in  Phoenix, Ariz., and the Smithsonian  Institute, National Museum for the  American Indian in Washington,  D.C., and has been represented by  Old Town GalleryOld Town  Gallery Fine Arts in Park City for  over five years.  Home and School: i i  Vital Links w  By LILY ESKELSEN  President, Utah Education Association  Linda Stubbs, Cindy Merrill, Teresa  Mixed division first place: Randan Vincent, Randy Vincent, Tamara  Vincent  C. BRENT FOX  M.C.H. CCC-A  1-800-244-9001.  .iIMi,Ii.WiIiIiI  t  IT TitSitfJ 4 I  AntrlcfA  Spt Kh lAfuCf HtwfAg  AltKKIMn  Clinical & Industrial Audlology Senior Citizen Discount  Hearing Aid Sales & Service Medicaid Accepted  Monthly Audlology Clinic at  Ashley Valley Medical Center  151 West 200 North. Vernal. Utah  finiiERfl3a!ESPSE),gEEB 1  For an appointment call  7A9-3342 ext. 136 ask for Linda.  News items  Call  Vernal Express  789-35 H  FnelcO Tiroes  When my old students came back dates and found out how young they  to visit and we have a chance to all were and that they had died in  reminisce about the good old days battles all over the world, even  in sixth grade, I'm surprised how Africa and Asia and islands in the  often and how fondly they recall Pacific Ocean?\"  our field trips. Teachers do try to make class-  \"Hey, Mrs. Eskelsen. Remember room lessons interesting, but there  when we went to Timpanogos is something special about a field  Cave? My legs are still sore from trip. There's something about get-the  get-the hike. Hey, Mrs. Eskelsen, when ting out into the real world and ex-a  ex-a stalactite and a stalagmite meet, periencing, touching, seeing, being  what do you call 'em? Remember? a part of the lesson.  You call em a column!\" But fieid come ofteilf  \"Remember when we had our and families can help build on those  blood drive in the library and Mr. lessons that will be remembered. It  Fraser almost fainted and then we doesn't have to be a week at  went to the hospital and then we got Disneyland or a trip to see Shamu.  to see how they got the blood ready Take a hike and collect rocks or  for people and then we got to see leaves. Use the library to identify  that little boy with the plug in his them. Visit a cemetery and do cray-  chest where he could get blood on rubbings of different symbols.  without getting stuck by a needle. Ask the caretaker what they mean.  Spend an hour at a tram station,  courthouse, monument or museum.  Take pictures and nut together a  scrapbook.  Make the time. Make the journey.  like he was so cool.'  \"Remember when we went to  Memory Grove and saw the mark  ers for all the soldiers who were  missing in action from World War  II. Remember when we subtracted  their birth dates from their death Make a memory for your child.  Riley  Tingey  Shawnee  Hullinger  Congratulations  Congratulations to the following  babies for passing their first milestones:  mile-stones: Riley James Tingey, son of Dave  and Kim Tingey, birthday Jan. 3.  Shawnee , Darlene Hullinger,  daughter of Mary Hullinger, birthday  birth-day Jan. 4.  Pamper yourself with a getaway  to the luxury lodge everyone is raving about!  For reservations call today!  This offer is limited  Bring your sweetheart for dinner, take a room at  half price and we will even throw in breakfast!  (801)454-3737", "parent": 22650613, "version": 1739889745747509249}, {"id": 22650624, "paper": "Vernal Express", "type": "page", "date": "1995-01-11T00:00:00Z", "year": "1995", "month": "January", "day": "11", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/c2/59/c2594e8102ebd7abda1934e3ec64fea009ec0da3.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/19/ac/19ac7f0c7e00a18df23662c6ebb44485f04056cc.pdf", "page": 11, "ocr": "Vernal Express Wednesday, January 11, 1995 11  Community Calendar  News from  mm a m mm  n m m m i i m m  W  ' i!Irv  in i  i  Uintah County 4-H youth show horses during the 1994 season. The  meeting on Jan. 18.  CouDntty 4-H Ihioirse  Lbegjiin) iimeetiiirag ffor  The Uintah County 4-H horse  club will begin holding their winter  meetings on Wednesday, Jan. 18 at  7 p.m. in the State and County  Building on the third floor.  The club is designed to promote  ItflcPLhieters bound for Russia  by Melanie Morrison  Lifestyle Writer  Utah State University sophomore,  Shayna Kae McPheters, will embark  em-bark on one of her greatest adventures  adven-tures today as she boards a jet in  Salt Lake City bound for St  Petersburg, Russia. McPheters is  one of 60 college-age volunteers  that will be spending the next five  months in the former communist  country, teaching Russian children  the English language.  McPheters is part of the  International Language Programs  1995 humanitarian service project.  SEARCH THE SCRIPTURES  EXPOSING FALSE  DOCTRINE - 3  by Evangelist Samuel A. Matthew  Vernal clmrch of Quit  Today's article is designed to  expose the atheistic doctrine that  God Does Not Exist \"The fool  hath said in his heart, there is no  God\" (Ps 14:1: 53:1). \"But  without faith (in God) it is  impossible to please him: for he  that cometh to God must believe  that he is, and that he is a  rewarder of them that diligently  seek him\" (Heb 11:6).  IF GOD DOES NOT EXIST  . . .Why is the earth \"full of the  knowledge\" of Him (Isa 11:9)?  Why did Stephen see \"the glory  of God\" (Acts 7:55)? Why are  the monetary coins of the United  States inscribed with, \"In God We  Trust?\"  GOD IS THE CREATOR. . .  \"In the beginning God created the  heaven and the earth\" (Gen 1:1);  \"One God created us\" (Mai 2:10;  God \"made the earth and created  man upon it\" (Isa 45:12); God  \"created all things by Jesus  Christ\" (Eph 3:9); \"He that built  all things is God\" (Heb 3:4; Acts  17:24); \"By the word of Jehovah  were the heavens made\" (Ps  33:6).  GOD IS ALSO. . .Spirit (John  4:24); Light (1 John 1:5); Love (1  John 4:8); Great (Job 36:26);  Faithful (1 Cor 1:9); True (John  3:33); Good (Matt 19:17); Holy  (Ps 99:9); Merciful (Ps 116:5);  Mighty (Job 36:5); Living (Heb  10:31); One (Mark 12:32);  Eternal (Deut 33:27); With us  (Isa 8:10); Our refuge and  strength (Ps 46:1); No respecter of  persons (Acts 10:34); Not the  author of confusion (1 Cor 14:33);  The Father and King of all (Eph  4:6; Ps 47:7).  GOD IS IN HEAVEN (Ecc  5:2). . .\"Our God is in the  heavens\" (Ps 115:3). Nehemiah  \"prayed to the God of heaven\"  (Neh 2:4). Jesus taught his  desciples to pray, saying, \"Our  Father which art in heaven\" (Matt  6:9).  GOD IS NOT A MAN (Num  23:19). . .\"I am God, and not  man\" (Hos 11:9); \"God formed  man of the dust of the ground\"  (Gen 2:7); God is therefore  \"greater than man\" (Job 33:12);  thus, He rules \"in the kingdom of  U ,f5' JL . j 4  An irif  good horsemanship and sportsmanship  sportsman-ship by helping youth interested in  horses. Boys and girls grades 3  through 12 are eligible. Heber hosted  host-ed the state competition in 1994 and  Vernal will be the host for 1995.  In addition to horse shows, the  She and the other volunteers are delaying  de-laying five months of college to  volunteer their services. McPheters  plans to return to USU in the fall.  She said that following the demise  of communism in Eastern Europe,  Russia has become what is considered  consid-ered a third-world country.  Medicine, nutrition, sanitation,  economy and education that were  once maintained by the communist  government, have come to a sudden  halt. People who know little or  nothing about how to survive without  with-out government support have, in  many cases, begun to do without  the basics needs of life.  men\" (Dan 4:17). We, like \"the  Egyptians are men, and not God\"  (Isa 31:3). \"No man hath seen  God at any time\" (1 John 4:12).  MAN SHOULD BELIEVE  GOD.'. .Abraham believed God  (Rom 4:3); Paul believed God  (Acts 27:25); The people of  Nineveh believed God (Jonah 3:5)  But why? Probably because, \"He  is a God of truth\" (Deut 32:4),  \"for He cannot lie\" (Tit 1:2). The  Holy Spirit therefore says, \"Let  God be true and every man a liar\"  (Rom 3:4).  SOME OTHER THINGS  TO DO UNTO GOD. . .Know,  believe, trust and have faith in  Him (2 Thess 1:8; John 14:1; 1  Tim 4:10; Mark 11:22); Fear and  obey Him (Ecc 12:13; Jer 7:23;  Acts 5:29); Walk humbly with  Him (Micah 6:8); Draw near and  give thanks to Him (Ps 73:28;  Rom 14:6); Be a servant and  friend to Him (Acts 16:17; James  2:23); Sing and cry to Him (Ps  68:32; 2 Sam 22:7); Stretch out  your hands to Him (Ps 68:31); Be  holy unto him (Num 15:40). The  wicked and atheist should, \"Turn  . . .from the power of Satan unto  God\" (Acts 26:18).  SOME PEOPLE ARE. . .  Denying God (Jude 4); Rejecting  God (I Sam 10:19); Forsaking  God (Deut 32:15); Robbing God  (Mai 3:8); Haters of God (Rom  1:30); Rebelling against God (Hos  13:16); Not retaining God in their  knowledge (Rom 1:28). The  renowned infidel Voltaire is  reported to have cried out in his  moments of death, \"O God, if  there be a God, save my soud, if I  have a soul, from hell, if there be  a hell.\"  Please, search the Scriptures  and see whether these things are  so (Acts 17:11). You are invited  to attend our worship assembly at  2045 West Hwy. 40 in Vernal. We  meet each Sunday at 10 a.m., 11  a.m. and 5 p.m. On Wednesday  we meet at 7 p.m. Also, you are  invited to watch the 30 minute  \"TRUTH IN LOVE\" program  each Sunday morning from 8:30 -9  a.m. on VTV channel 6. Call  781-0914 for more information.  1995 season will begin with a  citato to  seasons  club also sponsors many community  communi-ty projects and fund raising events  throughout the year. Parents and  youth interested in joining are welcome  wel-come to attend the meeting. For  more information contact Jacque  Hobbs at 789-2367 or Jeanette  Bonner at 789-9549.  Shayna Kae McPheters  \"This gives the Russians a chance  to make a difference in the world,\"  McPheters said.  She and the other volunteers will  be working three hours a day with  children between the ages of 5 and  7 years old. The method of teaching  was developed by Dr. Trevor  McKee, PhD., Professor of Human  Development at Brigham Young  University. International Language  Programs has found that in less than  one year of teaching the language to  the children, using Dr. McKee's  method, the children become functionally  func-tionally fluent in the language. In  addition to speaking, children also  learn to read and write the language.  lan-guage. Each activity used takes a setting  from the home environment to provide  pro-vide a context for the language being  be-ing taught. A child may make a  cake in the kitchen, a doll house in  shop, do tumbling in the gym, act  out \"The Three Little Pigs\" in drama,  dra-ma, and make a paper mache elephant  ele-phant in art, all while speaking  English. McPheters and the others  will live with the families of her  students and says she is excited to  also learn their language and culture.  cul-ture. She said, \"I'll probably learn a  lot about body and sign language in  order to communicate in the family.\"  fami-ly.\" The $4,000 cost is bore solely by  the volunteer. They also provide  many of their own teaching supplies  which she took with her from the  U.S. McPheters was sponsored in  part by Gordon Smith, Oregon State  Senator and friend of the McPheters  family, Christensens, IGA, Smith's  Food and Drug and Wal-Mart of  Vernal.  Shayna Kae is the daughter of  Mike and Judy McPheters of  Vernal. She is a graduate of Uintah  High School where she was a member  mem-ber of the varsity volleyball team,  yearbook staff, Spanish Club and  LDS Seminary Council Since attending  at-tending USU, she has been involved  in a recreational program designed  for the disabled and has worked in  the nutrition department She attended  at-tended Ricks College in Rexburg,  Idaho prior to USU.  Jar S .  'Accepting New Patients  MICHAEL C. SMUIN, D.D.S.  General Family Dentistry  Office hours by appointment  Evening appointments available  781 -  317 W. 100  January 14  Herb Troester will be leading  wnaiife Refuge looking for bald  wildlife. The ; tour will begin  Participants are to meet at the  Annex. For more Information,  sponsored by the Uintah Mountain  Staff at Primary Children's Medical Center will conduct a semi  nar for parents and educators of children with tourettes. The free  seminar will be held at Primary Children's Medical Center In Salt  Lake City from 1 p.m. to 4 p.m. Participants should register by  caning uana sewell at 789-7501 after 3 p.m.  The Uintah County Historical Society will hold their regular meet  ing at 2 p.m. at the Golden Age Center in Vernal. The program  will be presented by Nina Jean Caldwell who will be reading notes  from Esther Campbell.  January 17  Coastal Oil Company representatives will present a program to  the general membership of the Vernal Area Chamber of  Commerce at 12 noon at the Western Park.  January 18  uuit tobacco classes will be  Public Health Department in Vernal. Call 781-5475 for more information  infor-mation and to register.  The Uintah County 4-H Horse  ing in the State and County Building on the third floor. The meet  ing begins at 7 p.m. all youth in grades-3 through 12 are welcome  to attend. For more information, contact Jeanette Bonner at 789-  9549.  The Rising Star Riders Saddle  meeting at 7 p.m. at the Vernal  committee assignments will be  discussed and membership fees  The Community Schools Program is offering an Adult Drivers'  Education Class on Wednesday and Thursday nights at 7 p.m. at  Uintah High School. The class will run until March. Cost includes  classroom and driving instruction.  High bchool, 781-3125 to register.  KIDS Coalition will be meeting with Vernal City officials at 730  p.m. at the Vernal City Offices to ask for support of the \"reduced  access to tobacco\" bill from the council.  January 19  The first book discussion in the Heroes, Heroines and Outlaws  series will be held at 7 p.m. in  purpose room. Bert Jenson from  written by James Welch.  January 20 to 21  The Klondike Derby Winter Camp (District Winter Scout Camp)  will be held for all Blazer and Boy  Meet at the Winterhawk parking  Registration forms can be obtained at the Scout office in Vernal.  For more information call 789-91 08.  January 24  All landowners along Ashley Creek, as well as other interested  parties, are invited to attend a meeting with the Uintah County  Soil Conservation District at 7 p.m. in the courtroom of the State  and County Building in Vernal. For more information,5 call the  District or NRCS at 789-2100 or  A private pesticide applicator certification workshop will be held  rom 9 a.m. to 12 noon at the Roosevelt Utah State University  Education Center's multi-purpose  David Wilson, 738-2435, 1 - 800 - 448  January 26  Quit tobacco classes for expectant parents will be held begin  ning at 6 p.m. Call the Uintah Basin Public Health Department at  781-5475 for more information and to register.  January 28  A Gold and Green Ball will be held at the Ashley LDS Stake  Center from 8 p.m. to 11:30 p.m.  Dreams\" and will feature a live  show. The semi-formal dance is  older.  Anyone interested in placing an item on the community calendar  can do so by calling the Vernal Express at 789-351 1 . All materials  must be of community-wide interest and are subject to edit.  Camp Tokawana  The Jan. 5 meeting of Camp  Tokawana, Daughters of Utah  Pioneers, was held at the home of  DeLyle Richards. Captain Theda  Washburn conducted the meeting.  After business was discussed,  Captain Washburn gave the history  of her grandfather, Alma Barney.  He helped to survey and build most  of the canals in the Panguitch  Valley.  Barbara Jolley gave a lesson on  Mosiah Lyman Hancock. He was  born April 9, 1834 and was a witness  wit-ness to events that transpired during  the early history of the church.  2805  S. Vernal  a mid-winter tour of the Ouray  eagles and other over wintering  at 8 a.m. and end : at 4 p.m  Ashley Valley Medical Center  call 789-3336. The tour is being  Club.  held at 6 p.m. at the Uintah Basin  Club will hold its first winter meet  Club will hold their first winter  City offices, 447 East Main. 1995  made, horse show dates will be  will be collected.  Call Marsha at Ashley Valley  the Uintah County Library multi  USU will discuss \"Fools Crow\"  Scouts in the Winterhawk area.  lot after school on Jan. 20.  the Extension office at 781-5452.  room. For more information call  - 21 07 or 722-3997, ext. 1 99.  The theme is \"A Carousel of  band, refreshments and a floor  open to everyone 14 years and  Shop from  your home first!  Check the ads  in the  fttiil tyrtttTblftf tUfft  M N. Vkmai Am. TW-1U1  SAVE 25  on any  i . . 1  I  Holsum  White (any size)  Old Fashioned  Italian Bread  or  French Bread  r  SAVE 25  on any  Holsum  White (any size)  Old Fashioned  Italian Bread  or  French Bread  by Lorna McKee  247-2350  Former Tridell  resident dies  in Florida  Junius Glenn Morrill, 82, formerly  former-ly of Tridell, died Dec. 23 at the  North Florida Medical Center of  congestive heart failure and pneumonia.  pneu-monia. He was living in La Crosse,  Fla. at the time of his death. He was  bom May 4, 1912 to Horace and  Alice Hoyt Hayes Morrill.  Funeral services were held in  Cainsville, Fla. on Dec. 27 and also  at the Tridell LDS Chapel, Dec. 29.  Burial was in the Tridell cemetery.  Many friends and relatives came to  Tridell to Mr. Morrill's service.  Stewart Sanders, father of Janet  Merkley, suffered a stroke last  week. The ambulance and emergency  emergen-cy medical technicians were called  to assist Mr. Sanders to the  Roosevelt hospital. Mr. Sanders,  who resides in Salt Lake City, was  spending the Christmas holiday  with the Errol Merkley family. He  is improving and will soon be released  re-leased from the hospital.  Bonnie Bagley and children of  Clarkston, spent part of the  Christmas holidays visiting at the  Ben Wilson home.  The Douglas McKee family spent  two days last week in Bountiful  where they visited the Dallas  Chopping family. They also went to  Salt Lake City to see \"Legacy.\"  Enjoying the Christmas holiday  with Vida McKee were Heidi  Cossette of Miami, Fla. and Carrie  Cossette and friend, Marty, from St.  George. Heidi is a nanny and flew  to Salt Lake City. Raydean Natani,  who was coming home for the holidays  holi-days brought Heidi to Tridell.  Sharla and Julie Halem spent the  Christmas holidays with parents,  the Ray Haslem's.  Eric and Julie Ahlbom and two  children of Provo enjoyed the New  Year's weekend with their grandparents,  grand-parents, Mr. and Mrs. Ernest  Ahlborn.  Mr. and Mrs. Rae Goodrich left  Tuesday for St. George where they  will be serving in the temple for the  next three months.  Mr. and Mrs. Enes Hatch came  home from St. George just before  Christmas where they were serving  in the temple for the last three  months.  Spending the Christmas holidays  with Mr. and Mrs. Errol Merkley  were Lori Ann and Justin Jenson  and Mr. and Mrs. Eric Merkley of  Logan.  Margaret Elison, who broke her  leg in November, is now walking  without the assistance of crutches.  Rochelle Goodrich, Salt Lake  City, spent Christmas with her parents,  par-ents, Mr. and Mrs. Ward Goodrich.  The Winford Grays of Lehi, enjoyed  en-joyed visiting in Tridell recently.  They plan on spending part of their  winter in Quartzsite where the  \"snow birds\" go to get out of the  cold.  The Ron McKee's had all their  family home for Christmas. This included  in-cluded their three married daughters,  daugh-ters, Michelle, Suzettc and Kristin  and their spouses. Also home were  their three college children, Trevor,  Russell and Shari.  Merlin Wenzcl and Edison Lyman  of Provo, enjoyed the holidays with  their mother, Velma Lyman.  Gregg Duncan, Riverton, visited  at the Aaron Simmons home last  week. Duncan is the fiance of  Brenda Simmons.  loaf of  CONSUMER Or coupon Do putcftaM  Good orty On product ftfculfld Comunw  pays v ides lai Any ofw m may cons- .  ueirul I  RfiMLcFI 8Cirrturjulorfba .  value ot tw coupon pus 8C nanoVig orond-  ed you fsdwfn on ih mta law ot ine  product loeofwd Can value MOO an. I  vrxl i tajred. prontoed or mkxtad by law '  Invcctt snowrvj ftuftcttrt pucflatM ID oow I  coupons eutyneigd tw be tfoen on reouest  Mai B IVTERSTATE BRANDS COW I  HON PO BofMOZie BPno TX8M 1  0234  m3DQ 121757  loaf of  MFR-S COUPON I EXP 2-12  CONSUMER Or coupon per purchaM  Good only on product rxfcated Contumar  pays any van hu Any other uee may corvav  IPMI  Mr \"Hr & 1 \"rt uktiaca  vu? ot tn coupon put 4c rtarvftno. promd-ad  promd-ad you redeent 4 on tie rei a ot tm  product ipeciaccl Cam value 1 100 cant  Vod i sped uiuHreei or reeexied by an  coupura tub 1 aiaj Hjet be onoan on rooueal  Ma ID tyTtftSTATE BWNOS COflPCuV I  TCN. PO Bn SBQC234. 6 Pan. IX Mtt  ISM I  41300 12175? i  I MFRS COUPON EXP2-12-95i I  0", "parent": 22650613, "version": 1739889579127734272}, {"id": 22650625, "paper": "Vernal Express", "type": "page", "date": "1995-01-11T00:00:00Z", "year": "1995", "month": "January", "day": "11", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/fe/88/fe88f9917739616325e38a2fcf0eff1ca193fcc3.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/ca/aa/caaa4f0de2952a75f71e9b97941bc3068b1705df.pdf", "page": 12, "ocr": "12 Vernal Express Wednesday, January 11, 1995,  -''';\" ' ,  ....  ' ' - y  V ' 7  ... -'  Wade Stevenson  Stevenson  returns from  Italian mission  Elder Wade R. Stevenson has returned  re-turned home from serving two years  in the Catania Italian Mission for  the Church of Jesus Christ of Latter-day  Latter-day Saints. He is the son of Russ  and Connie Stevenson.  He will speak in Sacrament meeting  meet-ing at the Glines Chapel on Sunday,  Jan. 15 at 10:20 a.m.  Wade graduated from San Juan  High School in Blanding where he  was active in football, drama and  music. He will reside in the Vernal  area until spring. He then plans to  attend Brigham Young University.  Richard Buhler  Buhler receives  Eagle Scout  Award  Richard Robert Buhler, son of  Paul and Joyce Buhler, received his  Eagle Scout Award during a special  Court of Honor, Dec. 26. The ceremony  cere-mony was held in Peoa, Utah at a  family reunion. Buhler is a member  of Troop 229 of the Maeser 3rd  Ward under the leadership of his father,  fa-ther, Paul, and Randy Dearth.  To complete the requirements for  his Eagle Award, Buhler cut willow  starts, rcrooted them, and planted  the slips along the lower end of  Bitter Creek in the Book Cliffs. This  was done to enhance riparian habitat.  habi-tat. He was assisted by Marty  Mortensen, Steven Buhler and several  sev-eral fellow-scouts.  Buhler is an eighth grade student  at Vernal Junior High School. He is  active in the wresding program, enjoys  en-joys playing football, basketball and  soccer and collects baseball cards.  He also enjoys hunting and fishing  trips.  HVI 1 k I S 1  HEEL SPURPLANTAR FASCIA  A heel spur is a bony overgrowth on your heel bone. It may be  stimulated by muscles and ligaments (like the plantar fasica) that  pull from the heel bone along the bottom of the foot. High-arched  feet are especially apt to have tightness here. Heel spurs and an  inflamed plantar fascia may cause pain when the foot bears weight.  Nathan Christiansen  Christiansen  returns  from Brazil  Elder Nathan Sean Christiansen  returned home Tuesday, Jan. 10 after  af-ter serving two years in the  Campinas Brazil Mission for the  Church of Jesus Christ of Latter-day  Saints. He is the son of June  Christiansen and the late W. John  Christiansen.  He will speak in the Vernal 8th  Ward Sacrament meeting on  Sunday, Jan. IS at 2:20 p.m.  Seniors ring  by Ada Murray  The New Year's Eve dance has  been hailed a success with 82 people  peo-ple attending to ring in the New  Year. In the absence of Brent  Anderson, Ralph Johnson played  the trumpet and Lyle Barlow filled '  in on guitar and sang. Amy Lube,  Leah Davies and Phyllis  Oberhansley took turns playing the  piano and Becky Billings joined  them while playing her guitar. In  addition, Davies also played her  keyboard during intermission.  Donuts, cookies, salads and apple  cider were served during intermission.  intermis-sion. At the stroke of midnight, balloons,  bal-loons, hats and whistles were given  out and confetti was thrown. This  being a special dance, was held on  Saturday evening. The dances will  resume on Friday nights at 8:30  p.m.  Thirty-one people attended the  dance last Friday night Russell  Billings was back to play with the  Beaux Arts  Members of Beaux Arts Club met  at the Uintah County Library's multi-purpose  room on Jan. 4 for a special  spe-cial program. Petra Jones, vice president,  pres-ident, conducted a short business  meeting then introduced her program.  pro-gram. Evan Baker presented a  demonstration of Japanese cookery  and the cultural background of  Japan. He gave everyone a booklet  called \"Japanese Cookery I and H.\"  He prepared sukiyaki, teriyaki  chicken and gyoza. He explained  Japanese meals are several small  courses. It is a tradition never to  serve large amounts of any one  thing. This is its biggest difference  in relation to other cuisines. Holly  Evans was also with her husband.  Fourteen members enjoyed the  demonstration and eating the food.  It was an informative and interesting  interest-ing evening.  The next meeting will be Feb. 1 at  the home of Glenda Landon.  Barbara Jolley will be presenting  the program.  Golden Age  1 V7-1M-1 r:fc&UtTi  Treatment: Plantar ReleaseHeel  Spur Excision  The fascia is released to relieve the abnormal stress and the bone  spur may be surgically removed.  Follow-up Ca-e:  You may have to use crutches for up to two weeks after surgery to  prevent you from bearing weight on your foot.  I:  Michael Hunting  Hunting  returns from  California  Elder Michael Alan Hunting, son  of Fred and Carol Hunting, returned  home Jan. 11 after serving two  years in the California Santa Rosa  Mission for the Church of Jesus  Christ of Latter-day Saints.  He will speak in the Vernal 4th  Ward Sacrament meeting on  Sunday, Jan. IS at 12:40 p.m. The  chapel is located at 235 East 600  South in Vernal.  in New Year  orchestra. Jean Smith was at the  dance visiting with her many  friends as well as Delia Murray.  The center will be closed Monday,  Jan. 16 in observance of Martin  Luther King Day.  At bingo on Tuesday, Dec. 27,  Ada Murray took first place with  five games and Jean Staen and  Geraldine Thacker came in second  with four games each.  On Friday, Dec. 30, Phyllis Smith,  Ruby Anderson, Marie Smuin and  Myril Bodily all tied for first place  with three games each. Hoyle  Robinson and Smuin tied for first  place with four games each on  Tuesday, Jan. 3.  Thought for the week \"The  clock of life is wound but once, and  no man has the power to tell just  when the hands will stop at late or  early hour. Now is the only time  you own. Live, love, toil with a  will. Do not wait for tomorrow, for  the clock may then be still.\"  Current Topics  Members of the Current Topics  Club met on Wednesday, Jan. 4 at  the home of Yvonne Millecam with  Isla King as co-hostess.  Dr. T. R. Seager presented a program  pro-gram on wild flowers and petro-glyphs.  petro-glyphs. The current topic was given  by Colleen Martin.  The next meeting will be Jan. 18  at the home of Conine Pease.  Expres.  And  Expritt  TMty Stamen  789-3511  Complete Advertising Coverage  of the Uintah Basin Area  P.O. BOX 1000 - VERNAL, UT 84078  5T  mews  ft  1  1  S,  Digger Rasmussen  UHS senior  becomes  published poet  Digger Rasmussen, a senior at  Uintah High School, received good  news recently that his untitled poem  about staying drug free has been  published by The National Library  of Poetry.  The National Library of Poetry  seeks to discover and encourage poets  po-ets like Rasmussen by sponsoring  contests that arc open to the public  and by publishing poems in widely  distributed hardback volumes.  , Rasmussen has been writing for  the past few years and says his favorite  fa-vorite subjects and ideas arc his  own thoughts and feelings.  Digger, the son of Sandra Berg of  Yorba Linda, Calif, and Gale  Rasmussen of Vernal, was bom in  Vernal. He lived in California for  the past ten years when; he excelled  in sports, including football,  wrestling, baseball and skiing. His  hobbies and interests include hunting,  hunt-ing, fishing, welding and working  with wood.  Digger is the grandson of Garth  and Joy Horrocks and Max  Rasmussen, all of Vernal.  Morrills entertain  guests  Ron Morrill's mother, Karma  Lund of Salt Lake City, also his  nephew Brandon Machuta and his  father, Kim Bradbury of Sandy,  spent three days over New Year's  weekend with the Morrills.  Rona Edrington of Lehi, spent the  three day New Year's weekend with  parents, Kay and Jo Edrington. On  New Year's Day, the Edringtons entertained  en-tertained eight family members for  dinner.  No  r  and Save At The Old Price!  r  i  i  i  i  SUBSCRIBE TODAY Use This Coupon  Name  I Address  ,' City  One Year  In area $17.50  Out of Area $28.00  Out of State $31.00  I I L  Ex  News from  fnnmiitimimmmm  by Clara Robinson  784-3463  Sams family  roasted  The Forest Service hosted a  farewell dinner and program for  Steve and Andrea Sams at the Hub  prior to Christmas. They have been  transferred to Ketchican, Alaska.  About 100 guests, friends and  community members were present  They represented Ashley National  Forest and other forest and region  offices where Sams has served over  the years. Some people came from  Sl George and Jackson Hole, Wyo.,  as well as other areas.  Jim Scott of the Flaming Gorge  Ranger district was the master of  ceremonies. Following a delicious  dinner, Scott and those attending  had fun roasting Mr. and Mrs.  Sams. True to the tradition of  Hollywood roasts, each person who  had something to say had their turn.  The couple were presented with a  large array of special and gag gifts  and they were roasted with both serious  se-rious and funny comments.  The evening was rounded out with  dancing. Music was provided by  Steve Henderson who performed a  variety of country and western  songs in honor of the couple.  Sams has been the District Ranger  for the Flaming Gorge National  Recreation Area for six and one-half  one-half years. He has been involved  with numerous projects during that  time. Most recently they completed  a cut-through of Horseshoe Canyon  to make a safe passage for boaters.  He was also involved with the renovation  reno-vation of Hideout Boat Camp and  the completion of Little Hole and  the Spillway recreation facilities.  Andrea Sams has taught home  economics at Manila High School  for the past four and one-half years.  She is well-known for her innovative  innova-tive methods that lend a practical  application to modern life. She has  shown her dedication in the many  hours spent beyond what was required  re-quired as well as buying supplies  for classroom activities when the  school budget didn't allow for the  expenditures. Both her present students  stu-dents and those who have graduated,  graduat-ed, remember and appreciate her efforts  ef-forts as a high school teacher.  John Kelly Iverson II of Manila  married Brandy Elizabeth  McAllister of Vernal, on Thursday,  Jan. 5. The ceremony was held in  the Jordan River LDS Temple.  They were honored at a reception  time to waste...  Subscription  Rates  Are  Going Up  February 1,  1995  Subscribe Now  Coupon Good until Jan. 31,  State  Clip and send with payment to  The Vernal Express  P.O. Box lOOO  Vernal, Utah 84078  Or stop In our office at 54 N. Vernal Ave.  VERNAL  on Friday, Jan. 6 in the Jensen LDS  chapel in Jensen, and Saturday, Jan.  7 in the Manila LDS chapel.  Iverson is the son of Mr. and Mrs.  John Kelly Iverson of Manila. Ho is  the grandson of ' Mr. and Mrs.  Howard Iverson of Manila and Mr.  and Mrs. Joe E. Duran, Sr. of  Cokeville. The groom is a graduate  of Manila High School and is employed  em-ployed by the Forest Service.  The bride is the daughter of Mr.  and Mrs. Wayne T. McAllister of  Vernal. She is a graduate of Uintah  High School. The couple plan to reside  re-side in Manila after they are married.  mar-ried. A full courtroom with many left  standing was the scene of Gene  Briggs retirement gathering. His  friends and county employees gathered  gath-ered on Dec. 30 for an open house  and program.  The program opened with Sheriff  Gaylen Jarvie as master of ceremonies.  cere-monies. Sheriff Jarvie was reported  as introducing the following presentations  presen-tations with his enjoyable, dry sense  of humor.  Sherry and Corinda Briggs performed  per-formed two songs. In country style,  they sang \"The River\" and \"Wind  Beneath My Wings.\"  Next Jarvie introduced the speaker,  speak-er, Vernon Carr who is with Carr  Printing Company. Carr is the election  elec-tion specialist for the State of Utah.  He has known Briggs since Briggs  was first elected in 1967. Carr's talk  was on previous clerks and the  many facets of Briggs job as  Daggett County Clerk, Auditor,  Treasurer and Recorder. The four  jobs have been combined since he  first look office but will be divided  for the first time this year.  Mr. and Mrs. Howard Iverson  were visited by Mr. and Mrs. Jack  Frost during the holidays. They are  from Red Bay, Ala.  The Manila Ward hosted about  100 people of all ages at their annual  annu-al New Year's eve party. Everyone  enjoyed an evening of fun, games  and dancing followed by breakfast  Donkey basketball was well attended  at-tended Monday, Jan. 2 at Manila  High School gym. Participants rode  bareback as they attempted to play  basketball and shoot baskets. Points  only counted if the rider made the  basket while still on the animal.  Some of the donkeys didn't want to  be ridden and bucked off the players.  play-ers. One consistently threw its rider.  The Manila Booster Club is sponsoring  spon-soring a fund raising event Call  Peggy Briggs for more information  on Manila sweats: hooded sweatshirts,  sweat-shirts, sweatshirts, pants, shorts and  hats.  The Daggett County Assessor's  office will be closed on Thursdays  beginning in Jan. 199S.  1995  -Zip.  J  IT", "parent": 22650613, "version": 1739892415995576320}, {"id": 22650626, "paper": "Vernal Express", "type": "page", "date": "1995-01-11T00:00:00Z", "year": "1995", "month": "January", "day": "11", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/24/a4/24a4ccdc8cb4580b7a67c6bd21e0c182733c275c.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/b9/6f/b96f3c2d7e8f688d47d7c5fd436e9d762ee8f27e.pdf", "page": 13, "ocr": "Vernal Express Wednesday, January 11, 1995 13  Tm mm  l'TVr  TTjiljWfj- \"I if IT i it \"  Ricks honor roll  Five local students were listed on  the 1994 fall semester honor roll at  Ricks College. Students with honors  must earn at least a 3.5 GPA and  carry at least 14 credit hours.  Students from Vernal included  Heather Michelle Caldwell and  Samuel B. Hacking. From Tridcll gj  arc Holli McKcc, Amy Jane '  Mcrklcy and Brcnda Simmons.  1  Vernal City  SECRET WITNESS  Program  Roof is nearly complete on new Dinaland Golf Course Pro Shop. The building will be open by spring  It is less square feet than the old Pro Shop, but it is a better constructed building. Vernal City is seeking  seek-ing a concessionaire to operate the dining area.  (HBO J  Mm  FOR LOADS OF  RESULTS  CALL:  Express  CLASSIFIEDS  789-3511  K II  n x II s s  R U  Select Group CEILING FANS  At Close Out Prices  p Premium by SALE PRICED  tMERSON S-l QCH99  Made In  the USA Reg. Price $199!  CUMBERLAND' $KaQ9  52\" FAN y  (of  e return  Select Group  TRACK HEADS  $12\"  Values to 31\"  Select Group  HANGING FIXTURES  20  OFF  Q  In Stock  MINI BLINDS  $Roo  Jf Each  PI  l  s V M  -v WW'J.t MW  Select Group  TABLE LAMPS  30 - 50  OFF  J  ,I,'II-Hl' .  Bmtafl  Select Group  TRIM for RECESSED CANS  99 to $5\"  Values to $16\"  RECESSED CANS  EL-7IC  $099  W Each  PRICES on Overstocked Items  BATH BARS OUTSIDE LIGHTS, ETC.  n  -''Minim  . J- 4  ' '-I  1  i Hi  1 'l  II 4a lli iLf iW iO ii A ii tiW'uJ I  I golden corral  1 1 2 lb  I madsnatedl  1 steak  I ii I V ' J 1 1  I II 1 II  I ill I Great Taste. Great Prices, Great Values I  i I 1046 West US Hwy. 40, Vernal, Ut.  I mi 789-7268 M I  ill Offer Expires Jan. 31, 1995 A  I !55i Offer not good in conjunction at m I  I inso with any other promotion 4r m. I  I llisk V .ant I  I iniESOi tr .flaao I  II IlilOOilllilOlli. ' HBBHBB!IHWfir  KSSISSlllBlan.iiSSSSSSSM", "parent": 22650613, "version": 1739893196343738373}, {"id": 22650627, "paper": "Vernal Express", "type": "page", "date": "1995-01-11T00:00:00Z", "year": "1995", "month": "January", "day": "11", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/c6/b2/c6b2cc073227d153b7e739f7440ad678bd52e8d6.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/59/e9/59e938655bc4cc072fd00d97843728ff682ceea9.pdf", "page": 14, "ocr": "14 Vernal Express Wednesday, January 11, 1995  GSasCsetifoaDD teamms toegiin) miew yeav wBtilfD vficftones  Utes rip Miners,  prepare for  Cougs & Wasps  by Eric F. Pye  Sports Writer  Uintah's basketball affairs have  been on shaky ground lately which  is why last Friday's 83-60 victory  over Park City was such a shot in  the arm. Despite the 23 point victory  victo-ry though, Coach Doug Moon was  less than impressed with the play of  his team.  \"It's always nice to get a victory,  but we should have won the game  much more convincingly. The kids  have to learn how to apply themselves  them-selves and play with a lot more focus  fo-cus than we did Friday,\" Moon said.  In case you might be thinking the  Ute mentor is being a little too demanding  de-manding consider, the Miners were  coming off a 40 point loss to an under  un-der 500 Granite team. Park City had  not won a game all season (0-12).  Despite practicing for over a week  on a press defense, the Utes were  unable to execute against a poor ball  handling team. Uintah gave up 18  points in three of the four quarters.  And finally, the ultimate indicator  of a sluggish defense fouls were  a dominant factor as the two teams  combined for 76 fouls. Five players  fouled out of the game with six others  oth-ers finishing with four.  \"It would be accurate to say I was  disappointed, not with the score or  even our effort,\" Moon explained,  \"I thought the kids played hard and  gave it everything they had. Giving  up 60 points is not all that bad. Our  execution defensively was not there.  We didn't help out and several times  our players completely lost their  man when we were in man-to-man  coverage. It didn't hurt us that much  against Park City, but if we accept  the kids performance in this game,  they will think it's acceptable in our  next game. The bottom line is this  team is capable of playing much  better and I expect them to play to  their potential every time we step on  the floor.\"  The first quarter began with forward  for-ward Jeff Jaussi and shooting guard  Rhett Deets combining for 14 of the  Utes 19 points. Deets hit two of his  four-three pointers in the period. All  five of Uintah's starters scored. Park  Tiger League signups  Registration for the Tiger League  wrestling program will take place  Monday, Jan. 16 and Wednesday  Jan. 18 at 5:30 and 9 p.m. at Vernal  Junior High School.  The Tiger League program is  Crouse Reservoir  scheduled to fill  in 1996  Biologists at the Utah Division of  Wildlife Resources (UDWR) are already  al-ready making plans to restock  Crouse Reservoir. 'The fish are being  be-ing ordered,\" said Chad Crosby, regional  re-gional fisheries manager. \"We plan  to stock calchablc and fingcrling  rainbows into Crouse when it fills,  hopefully in the spring of 1996. The  catchablcs will provide fishing opportunities  op-portunities during the summer of  '96 and the fingerlings will be large  enough to catch the following year.  We've tried brook trout and cutthroat  cut-throat trout in the Diamond  Mountain lakes before but rainbows  seem to do the best. They grow  quickly and are more calchablc than  the other species.\"  Crouse Reservoir was drained  several years ago when the oudct  structure was damaged beyond repair.  re-pair. \"The head gate was broken,\"  Crosby said. \"We couldn't replace  it. The dam needed to be replaced  anyway. It has a history of failing  because when it was built, it wasn't  given a clay core. The soil was just  pushed up and there wasn't anything  any-thing to anchor the dam or seal it.  \"When construction crews began  working on the dam they discovered  several old drainage systems which  ' V'-- r' , V K  Point guard Steve Murphy dishes off as he drives the lane.  Murphy's handling of the offense has steadily improved.  City, playing without the services of  two 6'-6\" plus players Coach Moon  expected to see, moved the ball  around well enough to get several  easy layups and stay within one  point at the quarter.  The second quarter was more of  the same from both teams. Uintah  had five different players score with  Deets leading the way totaling 13 in  the quarter. The lead was seven at  43-36 at the half.  The third period proved to be the  big difference in the contest  Starting center Dan Darlington was  whisded for his fourth and fifth  fouls just three minutes into the second  sec-ond half. In came 6'-6\" Clint  Sorenson. Sorenson plugged up the  open to all youngsters K through  sixth grade. Weigh-ins will take  place along with registration. The  cost will be $15 per participant. For  further information call Keith or  Greg Stensgard at 789-1639.  had to be dug out or plugged. They  also found trees, brush and other debris  de-bris inside the dam which have contributed  con-tributed to the dam's instability.  \"This summer, construction crews  removed material from the inside of  the dam and then built a core of  clay and keyed it into the base of  the reservoir. Crews also plugged  cracks in the Uintah Basin quartzitc  on the north end of the dam to stop  leaks and rebuilt the spillway. When  the project is finished, Crouse  Reservoir will be about the same  size and approximately 25 feet  deep.  \"If the snows continue, we anticipate  antici-pate being able to completely fill  Caldcr and Matt Warner reservoirs  with this year's spring runoff,\"  Crosby said. \"Once full, we should  be able to meet the irrigation commitments  com-mitments and still keep both lakes  productive (about 34 full). Most of  the water will be held in Matt  Warner, the upper most lake. During  the winter, wc will monitor the oxygen  oxy-gen levels of the lakes. If the lower  lakes have a lack-of-oxygen problem,  prob-lem, wc can release oxygenated water  wa-ter from Malt Warner to keep fish  alive downstream in cither Caldcr or  Crouse reservoirs.\"  middle, getting two blocks and  changing numerous other shots. The  Miners did not hit a field goal until  there was just one-and-a-half minutes  min-utes left in the period. By then,  Uintah had built a 20 point lead and  gained control of the contest  \"That third period is how we  could have played the entire game,\"  Moon said, \"the kids really got after  them on both ends of the floor.\"  Uintah held the Miners to six  points, four of them from the free  See Basketball page 15  Pineview Invitational next  Utes finish third in their own tournament  by Eric F. Pye  Sports Writer  The Uintah wrestling team entered  their own Tournament of  Champions last Friday with a point  to prove, but by the conclusion of  the tournament Saturday night, that  point was still in question.  \"We had a great start and first day.  Our middle and end weren't so hot,\"  Coach Stensgard said in commenting  comment-ing on his team's third place total of  183.5 behind champion Union's 228  and second place Payson's 196 total.  to-tal. \"Union wrestled a great tournament  tourna-ment and deserved the championship.  champi-onship. They have several tough  kids and will be one of the favorites  when region and state roll around.\"  Both the Cougs' and Utes fared  well the first day. Union placed nine  wrestlers in the semi-finals Saturday  while Uintah went one better with  10 into the semi's. But that is where-the  where-the similarities ended. While the  Cougars were advancing seven of  ihcir nine into the finals, Uintah  could do no better than two of ten.  The Utes had iheir opportunities  too. Uintah went head to head with  Union three times in the semi's,  coming out on the losing end in all  three.  \"I'm not really sure what happened  hap-pened in die semi's. More than anything,  any-thing, it was just one of those limes  when things went wrong for us all  the way down ihc line at the same  time,\" Stensgard said. \"Several of  the kids were leading in the third  period and cither ran out of gas or  got caught in a move and pinned. It  was very frustrating to watch, especially  espe-cially considering how hard we  have been working and how well  we did the first day.\"  The closest of the semi-final  matches was at 152, where the Utes  Randon McKcc was wrestling  Union's Jcramy Jcppson. McKee  was clinging to a tenuous 1-0 lead  with lime winding down in the third  period. With just one second left on  the clock, Jcppson twisted out of  McKcc's control and earned an escape  es-cape point to send the match into  Lady Utes will  ralif nn 4ha (hin n' and the coach was subsiituung  iciy VII lilt; Dig U freeiy. The team coasted home to a  to be comnetit ivo 43\"25 viclorv-In aI1 Coach Barkcr  iu oe compeim ve was ablc to play 14 playcrsa rare  by Eric F. Pye  Sports Writer  The Lady Ute basketball team  traveled to Park City last Friday in  search of more offensive punch.  What they discovered instead was a  swarming, intense defense which  smothered the Lady Miners with futility.  fu-tility. \"We have spent a lot of time in  practice trying to improve our offense  of-fense output At the same time, the  coaches know defense wins  games,\" Coach Barker said. \"We  would have like to score more  points, but we were pleased with  our defensive effort.\"  Coach Barker should be pleased.  His Lady Utes held Park City to 12  first half points and just 16 points  Lady Utes hustle pays off  ; wtJP jlj \" t - . v Mi trl If llr 1  '- MY \"'\"II nil .m )i .1.1.1 11 u.Jim mi 1 u..m. I 4 , I- mmmmmvmf nlljimmin  i tjA I  M . ' . .  ...... -fl- jJ'J k \"G 1  Lywuvfl.' BBBJW Mil  Eta .?.. , nqBa8flflBHa-lli,  D.J. Lewis keeps his opponent at bay during 160 pound championship match. Lewis was one of  only two Utes out of ten who qualified for semi-final match to advance into finals.  overtime. In sudden death, Jeppson  won die match with a  takedown much to the delight of  the large Union contingent on hand.  After die first day of competition,  Uintah held a slim 1.5 lead over  Union with 81.5 points to Union's  80 and Payson's 76. After the semifinal  semi-final round and another round of  wresde backs, Uintah totalled just  174.5 to Union's 206 and Payson's  180. Only D.J. Lewis at 160 and  Brady McClellan at 171 advanced  into the championship round  Saturday night. That left 12 Utes  still in the wrestle backs vying for  places and team points. Only three  wresders did not place. \"One of the  toughest situations in wresding is to  keep giving everything you have in  the wresde backs,\" Stensgard said.  \"You're disappointed, tired and  have to really fight a mental let  down. I was really proud of the  team. They gave great efforts all the  way through the tournament.\"  The two wresders Stensgard  pointed to in the wresde backs were  See Wrestling page 16  ,.fl'.1.''ivr\"'  through three quarters. By then, the  team had built a 17 point lead at 33-  luxury in a lineup which usually  goes just six or seven deep, \"the  kids really got after them early on  defense. Holding any team to 12  points in the first half is quite an accomplishment,\"  ac-complishment,\" Barkcr said.  While the team iced Park City's  offense, Melissa Busch was heating  up her shooting touch. The Lady  Ute senior forward pumped in 10  first quarter points and 14 first half  points. Playing sparingly the second  half, Busch added another five  points for a game high 19 just six  short of the entire Park City output.  Marci Christcnsen followed Melissa  in scoring with eight, Dea Madsen  contributed seven, Naoni Barker  six, Jenny Murray two and Susan  Emmett one.  The next day (Saturday), Uintah  again as the girls manage a jump ball  J fx j N '\"Z ? - J .- - .  Jkj  Coach Stensgard (right) and  Chris Kiever's injured shoulder  took on a Grand Junction team  Coach Barkcr had never defeated in  his eight years of coaching at  Uintah until Saturday. Displaying  the same defensive tenacity which  shut down Park City, the Lady Utes  were equally generous to Grand  Junction in handing the Colorado  team a 46-43 defeat at the junior  high school.  \"We started a little slow, almost  tentative,\" Barkcr said, \"but when  we inserted Susan Emmett, she really  real-ly picked us up and gave us a collective  col-lective spark.\" The sophomore center  cen-ter immediately hooked up with  Busch for an easy layup resulting in  two of her six first quarter points.  Busch was her usual scoring self  hitting four of eight free throws and  adding another five points from the  field for nine first quarter points.  When Emmett entered the game,  Uintah trailed 10-2. When she left  at the end of the first quarter, the  See Lady Utes page 16  call from 'Mr.' Parkinson.  HHHSal5Sa . 1 1 i 1  trainer Sharrick Peck check on '  during 189 pound match.  . v, .  4", "parent": 22650613, "version": 1739885981272637440}, {"id": 22650628, "paper": "Vernal Express", "type": "page", "date": "1995-01-11T00:00:00Z", "year": "1995", "month": "January", "day": "11", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/ef/f8/eff8803a85c05a9117f0dfc90ecea364da38a218.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/65/1f/651f82fc39b714ebcfe6ca7f1ef238611849163e.pdf", "page": 15, "ocr": "Vernal Express Wednesday, January 11, 1995 15  Everybody wants to read  iVERHAL  the  99  'A' I aomio  and for lots of good reasons  t  3  I Pis r i'- ,  Adult City  League  basketball  standings  txpress  1  J M 1  IB I  iHWii ! Mill ..TV , .  IS  Somehow Jeff Jaussi gets this shot off inside during recent  game. Utes will need Jaussi's offense to be competitive.  Basketball  continued from page 14  throw line as the team gained a 62-42  62-42 advantage.  In the fourth period, Park City  went to a trapping press in an attempt  at-tempt to get back into the game.  Uintah hit IS of 24 free throws in  the period with Corey Enloe going  10 of 10 from the line. The team  made 25 of 42 free throws for the  game. Rhett Deets was again the  leading scorer with 26 followed by  Enloe with 20, Jaussi with 16,  Murphy seven, Sorenson and Eaton  four and Sparger and Darlington  two each.  Uintah plays host to Union  Wednesday and Wasatch Friday.  The games take on added importance  impor-tance since they are both region  contests and at home. 'These two  games will go a long way in determining  deter-mining how the rest of our season  goes,\" Moon concluded, \"we'll see  how badly the kids want to make  the playoffs.\" Both games are  scheduled for 7 p.m. varsity tip-offs.  W L  WcldonCons. 6 0  ZionsBank 5 1  J-WestOilfld. 5 2  Ft. Duchesne 2 5  IGA 2 5  Smith's 1 5  'B' League  W L  Jiffy Pawn 6 2  Chalet 3 1  Marta-Co. 5 3  Mick's Barbershop 2 4  Subway 2 6  Cracked Pot 1 3  J-Wcst Transport 2 5  Leading Scorers  Brett Weldon 117  Keith Blackhair 115  Travis Anderson 111  Todd Seifert 96  Travis Caldwell 95  Three Pointers  Vic Mitchell 18  Travis Anderson 17  Kenny Page 16  Randy Downing 14  Quin Horrocks 13  ; ' '  f\"\" 9. , - '  '.,-' -i  v , ' S  8 V Tr '' - ' ill  ,y, ' .,', If  Ti  Youth  Bowling  League  High Rollers  w  Hasty Pawn 10  Chevron USA 9.5  WarhawkEnt. 8  Boys High Game  Rory Rusell 266  Jacob Wilson 235  Jacob Cuckow 206  Boys High Series  Rory Rusell 589  Jacob Wilson 548  Jacob Cuckow 489  Girls High Game  Brandy Curtis 186  Autumn Piva 171  Carlie Wilson 168  Girls High Series  Autumn Piva 589  Carlie Wilson 462  Krystal Senko 452  Corey Enloe drives to the basket for another two points. Enloe's  penetration will be a big key in next two region games.  National  Dart  Association  Vernal Area  w  National  Pool  League  Vernal Area  , Early Rollers  w  Sav On Propane 7  Western Petroleum 7  GR Wireline 7  Boys High Game  Kevin Jensen 158  JefferyWilcken 158  Matt Sand 154  Clay Caldwell 139  Cody Cunningham 133  Boys High Series  Kevin Jensen 390  Cody Cunningham 364  Jeffery Wilcken 362  Girls High Game  KaraWarby 190  Jolay Guffey 154  Jessica Curtis 149  Bobbie Allred 127  McKensic Birchell 122  Girls High Series  KaraWarby 472  LindseyLee 341  Jessica Curds 338  The Strikers  w  Uintah Auto & MobilelO  Sunshincrs  8  Gateway 2  Weston 2  Weston 1  Office 2  Bed Rock 2  Bed Rock 1  Gateway 1  Office 1  97  83  81  64  59  54  48  45  Top Five Players  Alan Beck  Brian Hicks'  Vince Oliver  Bill Morrow  James Garcia  Wins  29  25  23  23  23  PridcCo Rentals 7  W  Gateway 2 48.5 Boys High Game  Office 3 42.5 Ronnie Mecham 209  Gateway 1 41 Jason Rushton 174  Office 2 32.5 Todd Ostler 158  Weston 1 30  Weston 2 22.5 Boys High Series  Office 4 16 Jason Rushton 506  Office 1 10 Ronnie Mecham 447  Todd Ostler 445  Girls High Game  Top Five Players Rashael Dunn 201  Betty Bowles 150  Wins Daisy Phillips 148  Sonny Kempton 34  Terry Jablonski 34 Girls High Series  Merlin Martinez 33 Daisy Phillips 419  Bill Bailey 30 Carlie Wilson 418  Alan Beck 30 Lindsey Cheshire 397  i  L  2  2.5  4  L  1  1  1  L  2  4  5  Hundreds Of Items Reduced To Clear Rega  We've Just Entered The 2 Coldest Weeks  Of The Year - There's A Lot Of Winter Left!  WOMENS  DADIIAC (S  Choose from Andy John,  Woolrich, Hot Spices  n o  I 0  OFF  Fleece Jacket  List $85  Prism Jacket  List $110  Powder Jacket  dlx systems Parka . . . $Rn  List160 OQ99 LISl bU  Systems Jacket  mens vest  List $95  Outerwear  39\"  49\"  99  AA  3  39\" List 'i5  78  99  mam  7&m  Systems  Jacket  99  2 Parkas in 1 - At The  Best Price We've Seen  Compare to $150  A Columbia parka systems and jackets  V Sportswear Company  tsugaooo Qg99 Whirlibird g(J99  Gizzmo  129  99 Longs  Peak  134\"  J9\"  Powder d 41A99 Falmouth  Keg L&V jacket  Limited Qty. Mens and Ladies Styles  Sorry, No Rainchecks or Special Orders At These Prices  carhantt  Coveralls  Single Insulated Style  9680ZD  Priced At  Below  cost n aoo  Reg. 89MtJ3f  No Rainchecks  Knit Winter  Headwear  i3  Off  Ski Gloves  P Youth  iP 99  Sweaters  10  Off  All Remaining  Stock  foless- n  Check These  Out Before  You Buy!  Kids Coats  Because Its There  Group 1  Super Quality, Great Buy!  2000  oo  Suggested Retail 7000  Group 2  Suggested Retail 7000  4ft  n  Ladies Name  Brand Jeans  1 Huge Group  o)99  2  Values to 39\"  Guaranteed The Lowest Prices On All Our Ski  Equipment - The Prices Are Not A Misprint!  Plus This Is Name Brand Mdse.  SKIS - Starting at SO03  BOOTS - Starting at 70W  POLES and GOGGLES extra 20 Off  BARRECRAFTER SKI RACK 59\"", "parent": 22650613, "version": 1739886028606406656}, {"id": 22650629, "paper": "Vernal Express", "type": "page", "date": "1995-01-11T00:00:00Z", "year": "1995", "month": "January", "day": "11", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/47/3a/473aecc554e07a7f3b3fc847ae0cb50be05eef13.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/d2/bc/d2bca5939dbfc6ee8338821c563c49cddfcd54d9.pdf", "page": 16, "ocr": "16 Vernal Express Wednesday, January 11, 1995  A  V  C7R  r  5T-' .  Brady McClellan shoots and gets the single during semi-final  round. Brady was one of only two Utes to advance to finals.  Wrestling  continued from page 14  heavyweight Mike G lines and 125  pounder Dallon McKee. Both wrestled  wres-tled five matches to finish fifth and  third respectively. McKee contributed  contribut-ed 15 team points while Glincs  added 14. \"Mike has probably improved  im-proved more than any other wrestler  right now,\" Stcnsgard said, \"his attitude  atti-tude and confidence are growing  daily, as is his ability on the mat.\"  In the finals, Union nailed the  door shut with three championships  at 112 (Marks), 135 (Mcacham) and  215 (White) while the Utes remained  re-mained shut out. Both Lewis and  McClellan lost tough decisions. D J.  went down 6-3 to a West wrestler  after trailing 3-0 heading into the final  fi-nal period. Brady fell 13-8 to a  Payson man after trailing 5-4 after  one and 12-6 at the end of two periods.  peri-ods. Lewis' second place finish  earned 22 team points at 160 while  McLcllan's second at 171 earned  the team 24 points.  As for the rest of the team; Josh  H&slcm finished fourth and earned  13 points at 100. Jarrcn Sullivan  earned three points at 106 and did  not place. Chet Atwood finished  sixth and earned seven team points  at 112. Greg McKee did not place at  119 and earned two points. Jimmy  Lewis at 130 finished sixth and totalled  to-talled 12 points. Brett Haslcm finished  fin-ished sixth at 135 and grabbed nine  points. Brad VanTasscll earned 19  points and finished third at 140.  Isaac Smuin earned two points at  145 and did not place. Randon  McKee finished fourth and added  14 points at 152. Chris Kicver finished  fin-ished fifth at 189 and had 12 points.  Grizz Oleen finished fifth also at  215 and added 15 team points.  Following the Utes in fourth place  and perhaps showing the strides the  team has made in two weeks was  Moffat County who had beaten  Uintah in the Rock Springs tournament  tourna-ment with 178.5. West finished  fifth with 164 followed by  Mountain Crest in sixth with 158.  Uintah will warm up for the  Pineview Tournament this weekend  with a region match at Lehi  Thursday.  nre :\"r'\"f rJfi&fcv  Jenny Murray (left) and Deena VanTassell converge on ball to shut down the penetration.  Lady Utes  continued from page 14  team had grabbed a 16-12 lead.  The second and third periods featured  fea-tured the same type of intensity and  defensive effort form Uintah. The  Lady Utes led 25-24 at the half and  35-31 after three. Grand Junction  suffered through a seven point third  quarter and was held to just six  points until late in the fourth period  when the Colorado team began  bombing away from the three point  line to make it close in the end.  Melissa Busch was again the leading  lead-ing scorer with 18 points followed  by Dea Madsen with 12, Emmett  with nine, Barker with five,  Christensen and Jenny Murray one  each. The two victories leave the  team at 8-4 for the season.  The team will try to carry their  defensive momentum into two critical  criti-cal region matchups this week as  they host Union Wednesday and  Wasatch Friday. \"Both those teams  are extremely tough,\" Barker concluded,  con-cluded, \"we will have to play our  best to be competitive.\" Both girl's  varsity games will begin play at  5:30 p.m.  Adult Coed  Volleyball League  The Uintah Recreation  Association is now accepting registration  regis-tration for the upcoming Adult  Coed Volleyball League which will  begin play January 17.  Leagues will be played on the following  fol-lowing nights: 'C League on  Tuesday nights, 'A' League on  Wednesday nights and 'B' League  on Thursday night at the Vernal  middle School. Cost for the league  is $20 per player.  Brady McClellan can't get the reversal before period ends in 171 pound championship match. i; V . i -  i 1 1 ilii : i  THIS IS A  NEWSPAPER  AD ABOUT  NEWSPAPER  ADS.  I.  t's an advertisement for advertisements.  This newspaper ad will tell your how effective newspaper ads  can be for your business.  Because every week adults go one-on-one with a newspaper.  Just exactly like you're doing right now.  At this very moment, you're reading and enjoying while you  get information and entertainment. Your concentration and  attention are focused on this ad.  And this ad alone.  That concentration, very simply, is the power of newspaper.  Radio and television wish they could command that kind of  attention from their listeners. But, too many times, radio and  television commercials become little more that background noise.  When people turn to their paper, they turn there with  interest. Which means that's where your advertising message  needs to be.  With all the choices available, it's difficult deciding how best  to advertise your business.  But everything becomes a little simpler when you remember  one rule.  -jSi,  s  Melissa Busch gets off the running jumper against Grand Junction Saturday in team's 46-43 win.  t Warehouse  ire Clearance  CO-OP  TIRES  Good deals on great tires - Step up to CO-OP Tires  CO-OP Golden Mark  70,000 Mile - \"S\" Speed Rated  $195  W W P17&70R13  P18570R13 $54.95  P18570R14 $61.95  P21570R14 $71.95  P20570R15 $68.95  P21570R15.....$72.95  P20565R15 $66.95  P21565R15 $72.95  CO-OP Weather Mark  45,000 Ml Steel Belted Radial  $32  95  P15580R13  P18580R13 $40.95  P18575R14 $40.95  P19575R14 $42.95  P20575R14 $44.95  P21575R14 $49.95  P20575R15 $45.95  P22575R15 $49.95  P23575R15 $50.95  CO-OPCountry Squire AS  Lt Truck Steel Belted Radial  $7Q95  f if  SQQ95  Lt23S75R15C  U23585R16E  31X10.5R15B... .$92.95  8.75 R1 6.5 D $91.95  9.50 R16.5 D $98.95  Lt24575R16E....$99.95  kCO-OPCountry Squire AP  Lt Truck Steel Belted Radial  $fiQ95  WLt23575R15C  U23585R16E $93.95  31X10.50R15B $92.95  8.75 R 16.5 D $91.95  9.50 R 16.5 D $98.95  U24575R16E $99.95  All Position Tire with  excellent milage.  mm  ROOSEVELT  West HWY 40  722-2542  VERNAL  990 So. 1500 East  781-1616  TIRE CENTERS  Price includes; Mounting & Valve stems.  Computer Balancing Available  n", "parent": 22650613, "version": 1739894790561988609}, {"id": 22650630, "paper": "Vernal Express", "type": "page", "date": "1995-01-11T00:00:00Z", "year": "1995", "month": "January", "day": "11", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/92/67/92675ee87e6bd931ad0fff973196c48bb949c5d1.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/f6/ea/f6ead530a7cf957e73a39bacecb395007a484ed0.pdf", "page": 17, "ocr": "Swimmers  by Eric F. Pye  Sports Writer  The combined Ute swim team had  been couped up at home longer than  any other time in the season. Thai's  why the duo meet at Richfield last  Friday and Cedar Invitational last  Saturday were a welcome relief.  \"When we got to Richfield and  found out the limited number of  swimmers they had, we (the team)  decided not to keep team scores,\"  Coach Worthcn said. \"Everyone  was just happy to be competing in a  different environment with timing  equipment and we didn't want to  humiliate them.\" It was a positive  gesture which turned out to be 100  percent accurate. Both boy's and  girl's teams swept nearly every  event.  \"Richfield has a clean 'fast' pool.  The team went into the meet looking  look-ing for fast times in their individual  events and we accomplished that,\"  Worthcn explained. \"I felt our tear-down  tear-down period (two-a-days) was successful  suc-cessful and the times we got out of  both competitions reflected  that and they will continue to improve  im-prove when we start to taper.\"  After the Richfield meet Friday  afternoon, the team drove down to  Cedar City for Saturday's  T 4  Jeremy Worthen comes up for  ntty i miawa r  Wl' \"  a  -\"y W V XJ O O Q  Team members from both Cedar City and Uintah stretch over  the edge to see who won in the 100 fly. Utes Travis Richardson  was edged out by just .14 of a second.  Cl-j \"Thank You\" for supporting  We couldn't  9 L-lAI'll\"''''  nan roung  Rhett Searle  Vernal Elks Lodge  Rocky Mountain Anchor  Neola Team Penning  Boren Paint Horses  Stubbs & Stubbs  Von Fletcher Trucking  Ponderosa Oil Field Service  Service Insurance  Leonard Heeney  Dan's Tire  Balcron Oil  B & D Mobile Home Movers  RV Center  Esquire R.V.  Home Town IGA Super Center,  Vernal  Sav on Propane  Vincent Brothers  Sunshine Ranch  Blue Mt. Paints, Randy &  Tamara Vincent  G & H Garbage  show well at Cedar Invitational  Invitational which featured all the  southern Utah 3A teams and  Uintah. \"Cedar City gave us an opportunity  op-portunity to look at the southern  part of the state and sec how we  stack up,\" Worthcn said.  Competing without two of their  swimmers, the Lady Ute swim team  finished third with 292 points, 28  behind Dixie who had 326 and 173  behind Cedar's 465. Pineview finished  fin-ished fourth with 127, Snow  Canyon fifth with 22 and Enoch  sixth with 20.  The boys fared even better, placing  plac-ing second with 315. Cedar finished  first with 454 while Dixie was third  with 166, Snow Canyon fourth with  121, Pineview fifth with 59,  Richfield sixth with 53 and Union  seventh with 15. \"I was pleased  with our effort and considering  Cedar had the pre-knowledge of all  our times, strengths and weaknesses,  weakness-es, our placing was excellent also,\"  Coach Worthcn said.  The team's next meet will be Jan.  19 at Carbon.  The following results are from the  Uintah-Richfield match held last  Friday, Jan. 6 at Richfield.  Girls Results:  air during 100 fly event.  doit without you  J & J, Lanie Kerlin  Smith's Food King  Zions Bank  Ponderosa Feed & Tack  Dave Jolly Chev- Olds  Lapoint'ss Kountry Kitchen,  Claryn Gardner  I FA, Vernal  Dry Fork Saddle  Country Side Vet.  FX Riverdale Farm,  Don & llene Fedelleck  Bull Ring  Last Chance  Skillet  Weston Lamplighter  Jim Redding Saddle  Top Stop  Connie & Ned Cook  Glendale Speirs  Rattler Rope  Centennial Livestock Auction,  Ft. Collins. Colo.  jj  200 Free (State qualifying time)  , 2:09.26  Win 2:21.51  Jessie Perry (1)-2:21.51  Yvonne Allen (2)-2:33. 14  Laurel Pittman (3)-2:38.29  200 1. M .2:21.54  Win 2:44.72  Emily Wilkinson (l)-2:44.72  Denver Olmsted (2)-2:48.62  Cheryl Slaugh (3)-3:20.79  50 Free :25.90  Win 29.48  Hillary Law(l)-29.48  Britnie Dean (2)-31.13  Kaue Brixey (4)-35.74  Diving 310.85 (10 rounds)  Win 181.25  Ryshan Slaugh (4)-145.55  100 Fly 1:05.64  Win 1:16.33  Hillary Law (1)-1: 16.33  TeralynAllred(2)-l:26.65  Mikcn DUlworth (3)-l:38.33  100 Free :58.42  Win 1:10.98  TericroscHill(l)-l:10.98  Amber Wiswcll (2)-l:11.17  Katie Brixey (3)-l:21.90  500 Free 5:55.72  Win-6:26.58  Denver Olmstead (l)-6:26.58  Heather Trujillo (2)-7:01.27  Erin Bradley (3)-7:28.05  100 Back 1:05.08  Win 1:19.84  Emily Wilkinson (1)-1: 19.84  Yvonne Allen (2)-l:23.16  Ramanda Jones (3)-l:39.77  100 Breastl: 15.88  Win 1:21.87  Britnie Dean (1)-1:21.87  Jessie Perry (2)-1:24.79  Courtney Hutchins (3)-l:50.52  Relays  200 Medley 2:04.23  Win-1:52.55  J. Perry, H. Trujillo, H. Law, E.  Wilkinson (1)-1:52.55  200 Free 1:50.00  Win 1:45.36  Y. Allen, B. Dean, H. Law, E.  Wilkinson (1)-1:45.36  400 Free 4:07.04  Win-1:58.96  A. Wiswell, H. TrujUlo, T. Allied,  L. Pittman (l)-4:58.96  200 Free 1:51.80  Win 2:03.95  Ed Davidson (l)-2:03.95  Joey Winterton (2)-2: 12.95  200 1.M. 2:06.99  Win 2:25.23  Ryan Dean (l)-2:25.23  Travis Richardson (2)-2:29.95  50 Free :22.78  Win 23.98  James Morton (l)-23.98  Mark Padigimus (3)-27.55  Kris Wentworth (Union)- (5)-28.24  Diving 326.05  Win 183.20  Jake Allen (1)-183.20  MarkNunley(2)-161.80  Chandler Peisley (4)-130.85  100 Fly :56.42  Win 1:10.42  Scott Wiswell (1)-1:10.42  Joey Morton (2)-l:38.08  100 Free :50.04  Win 56.87  Travis Richardson (l)-56.87  Scott Wiswell (3)-l:07.12  500 Free 5:06.07  Win 6:26.05  Jeremy Worthen (l)-6:26.05  WiUiam Barton (3)-8:01.96  iOOBack :57.83  Win 1:07.21  Ryan Dean (1)-1:07.21  Ed Davison (2)-l:08.70  JMark Padigimus (3)-l:14.02  100 Breast 1:05.02  Win 1:11.71  James Morton (1)-1:11.71  Kris Wentworth (Union-3)-1:14.84  Joey Winterton (2)-l: 13.06  Relays:  200 Medley Relay 1:45.82  Win 1:54.31  J. Winterton, E. Davidson, T.  Richardson, J. Morton (1)-1:54.31  200 Free Relay 1:36.89  Win 1:43.68  M. Nunley, T. Richardson, J.  Morton, J. Winterton (1)-1:43.68  400 Free Relay 3:25.81  Win-4:05.14  James Morton, J. Winterton, R.  Dean, E. Davidson (1)-4:05.14  The following arc results of the  Cedar City Invitational meet held  last Saturday in Cedar City.  Girls Results:  200 Free  Win 2:13.60  Hillary Law (2)-2: 15.07  Britnie Dean (7)-2:26.80  TericroseHiU(9)-2:32.68  Miken DUlworth (14)-2:42.57  200 1. M.  Win 2:27.39  Jesse Perry (5)-2:4 1.93  Amber Wiswell (ll)-3:30.38  Vernal City  SECRET WITNESS  Program  789-8888  50 Free  Win-26.22  Emily Wilkinson (4)-28.30  Yvonne Allen (6)-28.81  Mikcn DUlworth (9)-29.91  Erin Bradley (15)-33.38  Diving  Win N.A.  100 Fly  Win 1:08.50  Laurel Pittman (4)-1:20.50  Heather Trujillo (5)-1:20.77  Yvonne Allen (12)-1:33.93  100 Free  Win 57.77  Hillary Law (2)-l:02.06  Emily Wilkinson (4)-l:03.05  Amber Wiswell (10)-1:11.80  500 Free  Win N.A.  Denver Olmstead (4)  TerieroseHill (8)  100 Back  Win 1:08.80  Jessie Perry (3)-l:13.90  Britnie Dean (5)-l:14.16  Ramanda Jones (12)-1:39.26  Katie Brixey (13)-1:44.30  100 Breast  Win 1:16.40  Heather Trujillo (6)-1:24.78  Laurel Pittman (10)-1:31.19  Teralyn Allied (11)-1:35.12  Relays:  200 Medley  I . r i - i -1 vf r t. ir f: ; ( r  m njh j lifer  Hillary Law waits for teammate Britnie Dean to touch wall in 200  Win 2:02.32  J. Perry, T. Allred, J. Morton, E.  Wilkinson (4)-2: 16.06  200 Free  Win 1:51.21  Y. Allen, H. Law, E. Wilkinson, S.  Morton (3)-2:00.50  400 Free  Win4:22.63  D. Olmstead, H. Law, J. Perry, B.  Dean (4)-4:44.94  Boys:  200 Free  Win 2:05.32  Ryan Dean (2)-2:06.04  Scott Wiswell (6)-2: 16.27  Jeremy Worthen (8)-2: 17.88  200I.M.  Win 2:17.28  Ed Davidson (2)-2: 17.66  Mark Padigimus (8)-2:44.41  50 Free  Win 23.04  James Morton (3)-24.08  Joey Winterton (4)-24.82  Joey Morton (8)-25.37  Mark Nunley (ll)-27.29  Diving  Win N.A.  100 Fly  Win 1:02.56  Travis Richardson (2)-l:03.14  START THE NEW YEAR RIGHT!  With A New Home From  8  S  B  U  b\"  tf  tf  tf  tf  tf  tf  tf  tf  tf  tf  C  CHECK US OUT!  Triple wide 42X60 3 bedrooms  Double wides from 28 X 40 to 28 X 80  Single wides from 14 X 52 to 14 X 80  Available 16 wides from 16 X 60 to 16  789-9390  Io-OKoKoKqIoKoK  Vernal Express  ! l -' --ni'umi if -rnm mi  l wl vut r ;'Jr L h  1 : j . v H h: II L  Mark Nunley catches some true air during diving competition.  Nunley hit this forward pike well enough to win at Richfield.  Jeremy Worthen (6)-l:11.38  100 Free  Win 51.11  Joey Winterton (3)-55.18  James Morton (4)-57.12  Joey Morton (5)-57.89  Kris Wentworth (10)-1:04.59  500 Free  Win N.A.  Ryan Dean (1)  Scott Wiswell (4)  100 Back  Win 59.93  Travis Richardson (3)-l:05.90  Mark Padigimus (8)-l:14:85  100 Breast  Win 1:10.98  Ed Davidson (1)-1: 10.98  Kris Wentworth (3)-l:14.69  WiUiam Barton (12)-1:31.08  Relays:  200 Medley Relay  Win 1:50.77  J. Morton,  Richardson, J,  1:58.06  200 Free Relay  Win 1:40.14  M. Padigimus,  E. Davidson, T.  Winterton (3)-  J. Worthen, T.  Richardson, R. Dean (3)-1:47.32  400 Free Relay  Win 3:44.09  J. Winterton, J. Morton, J. Morton,  E. Davidson, (l)-3:44.09  b mm  1540  Wednesday, January 11, 1995 17  free relay during Cedar meet.  HONEST.  MORE FOLKS FEEL  THAT NEWSPAPER  IS THE MOST  BELIEVABLE  MEDIUM  We can 'i lie.  A recent study showed that more people  feel newspaper is the most believable medium.  medi-um. Not television  Not radio  Not magazines.  But why?  It's probably because we know that  newspaper lays it all out in black & while.  Right in front of you.  The places, the people, and the prices.  The offers, the promises and the claims.  It's all there to read, think about and keep.  And that goes for the advertisements, too.  When people turn to their paper, they turn  there with interest. Which means that's  where your advertising message needs to be.  With all the choices available, it's difficult  deciding how best to advertise your business.  busi-ness. But everything becomes little simpler  when you remember one rule.  mm VBtHAl  Express  789-3511 54 North Vernal Ave.  O  tf  tf  W  tf  tf  tf  tf  tf  tf  tf  tf  tf  tf  tf  tf  tf  tf  tf  tf  tf  tf  X 80  W. Hwy. 40, Vernal, Utah  4", "parent": 22650613, "version": 1739894962567249920}, {"id": 22650631, "paper": "Vernal Express", "type": "page", "date": "1995-01-11T00:00:00Z", "year": "1995", "month": "January", "day": "11", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/e8/97/e897d26c0d5b2d51e13accd6c1fc23dbb1512db6.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/f0/8f/f08f15333c2ca95808a1dfd10789ed600e2824b6.pdf", "page": 18, "ocr": "18 Vernal Express Wednesday, January 11, 1995  Comments Harpers Corner  on draft EIS road closed  proposal  accepted  Written and oral comments on the  draft environmental impact statement  state-ment for the Blanchett Park Dam  and Reservoir proposal will be accepted  ac-cepted through February 27.  The dam and reservoir have been  proposed by the Uintah Water  Conservancy District for the purpose  pur-pose of providing supplemental irrigation  irri-gation water during the growing  season, and flexible water delivery  to benefit water users in the Lapoint  and Dry Fork upper Ashley  Creek drainages.  The Forest Service has identified  the \"no action\" alternative as its  preferred alternative because analysis  analy-sis suggests the proposed dam and  reservoir will not meet the  Conservancy District's purpose.  The document identifies problems  associated with water budget, water  delivery and water holding as reasons  rea-sons for selecting the \"no action\"  alternative.  Members of the Uintah Water  Conservancy District board disagree  dis-agree with the findings of the draft,  which had to be completed by the  Forest Service after the original  contractor BlOWest failed to produce  pro-duce a draft EIS that was acceptable  to the Forest Service.  Acting Forest Supervisor Brent  McBeth encourages people to comment  com-ment on the draft. Copies are available  avail-able at the Supervisor's Office, 355  N. Vernal Avenue, or they can be  requested by calling 789-1181.  McBeth and his staff are available  to meet with groups and individuals  to discuss the draft.  After the comment period ends,  all comments will be considered  and McBeth will decide which alternative  al-ternative best serves the public interest.  Dinosaur National Monument  Superintendent Dennis Huffman has  announced that the Harpers Comer  Road has been closed for the season  following recent snows and low visitation.  vis-itation. Superintendent Huffman explained  ex-plained that the road is kept open as  long as possible but that ice and  snow depths have reached the point  that it is not practical to plow the  road and it is unsafe for most vehicles  vehi-cles to attempt.  The Harpers Corner Road begins  at monument headquarters on U.S.  Highway 40, two miles east of the  town of Dinosaur, Colo. The 32  mile scenic drive is popular with  sightseers who wish to gain a view  into the canyon systems of the  Green and Yampa Rivers, as well as  those who plan to visit Echo Park at  the Junction of the two rivers.  Although closed to normal vehicular  vehic-ular travel beyond the Plug Hat  Picnic area, Huffman explained that  it is open to snowmobilcrs and cross  country skiers throughout the winter.  win-ter. Snowmobilcrs may travel the  road for approximately 25 miles  from Plug Hat to the main park  boundary.  Winter travelers on Harpers  Corner Road should be properly  equipped to deal with rapidly  changing weather conditions or  equipment breakdowns; however,  there are many rewards for those  who choose to visit the area in the  winter. The vistas from the slopes  above Dinosaur National  Monument's rugged canyons take  on a new dimension in the winter  and a large variety of wildlife can  also be seen.  Visitor information services are  available seven days a week during  the winter at the Quarry Visitor  Center from 8 a.m. to 4:30 p.m., and  on Monday through Friday at the  Park Headquarters Visitor Center  during the same hours.  Library offers  Cowboy book series  The stereotype is well-known: the  lean cowboy, the innocent school  marm, the silent Indian and the fast-drawing  fast-drawing outlaw. That has made  these images such a part of  American culture and are the accurate  accu-rate portrayals of personalities and  lifestyles which existed on the west-  em frontier?  These questions and many others  will be explored in a Thursday  evening book discussion series at  the Uintah County Library beginning  begin-ning Jan. 19.  The series, Heroes, Heroines and  Outlaws Reimagining the Mystic  West, consists of six discussions,  based on six different books. Each  book has been chosen to present a  unique perspective on the story of  the American West and the legends  that have grown around it The  characters explored in these books  challenge the way people perceive  this exciting chapter in the country's  history. At the same time, the series  will expose more of the present  western experience. These characters  charac-ters include a famous outlaw, a band  of Blackfect Indians whose traditional  tradi-tional lifestyle is being threatened  by white settlers, a Chinese girl sold  into slavery in California and a  cowboy whose territory is modern  Albuquerque. Each session will be  led by a knowledgeable scholar,  who will help create an interesting  and informative discussion of issues  raised by the book, issues ranging  from the part that women played in  the frontier lifestyle, to ways in  which our present expectations are  colored by our notions of Western  history.  The series will begin Jan. 19 with  a discussion of James Welch's  \"Fools Crow,\" the story of a band of  Blackfeet Indians trying to survive  in Montana during the 1870s. Next  will be \"The Virginian,\" a famous  early western which helped to create  the heroic image of the cowboy.  Other readings will be Edward  Abbey's \"The Brave Cowboy,\" a  novel which explores traditional  western characters by placing them  in our own time period; \"Thousand  Pieces of Gold,\" RuthAnn Lum  McCunn's look at the life of a  Chinese woman immigrant in the  West; \"Billy the Kid, a Short and  Violent Life,\" by Robert Utley, the  biography of a young man who became  be-came a legend; and Larry  McMurty's \"Buffalo Girls,\" a novel  focusing on Bill Cody's Wild West  shows, theatrical productions which  captured the imagination of  America.  The local program is provided by  The Book Groups: Exploring  Literature in Company, a project of  Human Pursuits: The Western  Humanities Concern, a project designed  de-signed to encourage reading and  discussion among out-of-school  adults, and funded in large part by  the National Endowment of the  Humanities. Participants are encouraged  encour-aged to prercgister and to pick up  their first book at the library.  To  Your j  Health  Women's health  By Gloria Johnson  Uintah Basin Public Health  Department  The miracle cure for what ails you  has been discovered. Unfortunately,  it doesn't come in pill form. You  have heard it before. You arc hearing  hear-ing it again. It's a new year and  seems appropriate. The miracle cure  for what ails you is ...exercise. Did  you guess?  An inscrvice on women's health  issues recently repeated the fact that  exercise is the miracle cure. The  benefits are many: good mental  health, toned muscles, burned fat,  increased cardiovascular health, reduced  re-duced blood pressure, good cholesterol,  choles-terol, healthy weight, increased energy  en-ergy and the list goes on. Do you  believe those arc the benefits of increased  in-creased activity? Then the big question,  ques-tion, what arc you doing about it?  Take some action. Literally. Make  it a part of your lifestyle. Whether it  is walking, skiing, aerobics, gardening,  garden-ing, housework, and this list goes  on, loo. Movement is the main denominator.  de-nominator. Move more. Use the  stairs. Park at the back of the lot.  Play with children. Dance. Move.  Other issues on women's health  was covered in this inservice.  Maybe you have heard the slogan  \"five a day.\" What this refers to is a  mixture of five servings of fruits  and vegetables a day. Really, it is  not hard to do when you understand  what a serving is. Most servings are  small ranging from a half a cup or  piece of fruit to a cup of raw vegetables.  veg-etables. This element of eating  fruits and vegetables, along with  grains (one slice of bread, one-half  cup of cereals, rice or noodles) is  right next to exercise in gaining and  maintaining belter health.  If premenstrual syndrome (PMS)  is a problem, the recommendation  from dieticians and health care  providers is a healthy diet (a  lifestyle) not a program) and exercise.  exer-cise. Postpartum depression a problem?  prob-lem? A healthy diet and exercise is  the prescription. Prevention of heart  disease and other chronic illnesses?  Maybe you guessed. A healthy diet  and exercise.  Our physical health and mental  health are intertwined. A healthy diet,  di-et, exercise and good physical and  mental health go hand-in-hand.  Good health feels better than bad  health. Strive for good health.  You'll feel belter. It's not any harder  than having bad health!  !f you have  a sports tip call  Express  789-3511  Vernal Theater  Starts Friday  Opens 7:00 Starts 7:30 Only  LEGENDS  Brad Pitt  Rated R  Tri Cinema  Theatre  r  Starts Friday  7:15 & 9:10  RUDYARD KIPLING'S  THE  JUNGLE BOOK  Ratwl PO  Starts Friday  7:30 & 9:15  DEMON  KNIGHT  Rated R  (T) Friday  CJ3 7:40 & 9:20  FIGHTER  Rated PO 13  U\" jpdlait  Snow Survey and Water Supply  For further information contact Nick Lundstrum, USDA-NRCS. 240 West Hwy. 40,  Roosevelt Utah 84066, (801 ) 722-4621  Natural Resources Conservation Service (formally SCS)  As of Mon, Jan. 9th, 1995  SMnTFi ciTP I n FVATinw j SNOWWATER CONTENT I , 30YEAR TPERCENT  Sainaae ffSl -: Onches of water) -U. AVERAGE OF  Trail Lake 9,960 12.7 5.5 8.9 12.4 72  DuchesneRiver  Rock Creek 7,900 5.0 2.5 3.6 '\"'4.4 82  Rock Crook ' ' '  Lake Fork Basin 11,100 9.3 8.1 10.0 10.9 92  (Lake fork river)  Brown Duck 10,600 9.5 , 6,1 '10.1 9.5 106  Lake Fork River (West of Moon Lakd) . - . . -  Lake Fork 1 10,200 8.0 5.1 7.6 5.8 131  Yellowstone River (East of Moon Lake)  Five Point like 11,000 8.7 '' 6.2 ' 9.0 9.0' 100  Yellowstone River -  Chepeta 10,300 8.2 4.2 8.4 6.6 127  Whiterocks River  MosbyMtn. 9,500 5.5 3.4 ,11.9 ' 4.8 248  Whiterocks River & Mosby Creek  Trout Creek 9,400 5.6 2.8 6.2 4.9 127  Ashley Creek ,  Kings Cabin 8,730 6.9 3.2 7.3 5.8 126  Brush Creeks ' - -  Hickerson Park 9,150 3.9 3.1 2.4 2.8 86  Sheep Creek (North Slope) . ..  Hole-In-Rock 9,150 3.7 3.3 ' 3.2 2.5 128  Beaver Creek (North Slope) - ' '  Indian Canyon 9,100 5.1 2.0 5.1 4.6 111  Strawberry River & Argyle Creek  Currant Creek 8,000 7.4 '' 3.7 5.9 '5.0 118  Currant Cr & Strawberry River  East Willow Creek 8,250 5.5 1.9 4.9 2.5 196  Willow Creek (Book Cliffs) ;  Provisional Data from snow pillows at snotel sites, subject to revision.  Rabies clinic  set at Armory  The annual rabies clinic will be  Jan. 28 from 10 a.m. to 1 p.m. at the  National Guard Armory, 200 South  500 East  Dr. Ed Oscarson of Ashley Valley  Veterinary will be offering all small  animal vaccinations at a reduced  cost. All Uintah Basin residences  are welcome, and encouraged to  come and bring their pets to the  National Guard Armory.  A reminder that dog licenses are  due for the 1995 years. Uintah  County, Vernal City and Naples  City dog licenses will also be offered  of-fered at the clinic.  YOU CAN TRUST  .BLOCK  Income taxes are our only business.  We have more experienced preparers than anyone  in the business.  We stand behind our work.  We provide year-round service.  We are reasonably priced.  We are conveniently located.  We offer complete electronic filing services.  390 West Main, Vernal 789-3335  WEEKDXTS 9 AM TO 7 PM, SAT. 9-9. APPOINTMENTS AVAILABLE BUT NOT NECESSARY  Tj  Cheek out ihm \"GO IH THE SHOW\" Vehicles!  1990 FORD  TEMPO AWD  1993 SUBARU  IMPREZA AWD  Air Cruise Cassette  New Rubber  5,500  Low 15,000 Miles Stereo  Air Pwr Locks & Windows  ::ii2,oo(r  or... Do you need a \"SPORTY APPEARANCE\"?  1992 FORD  THUNDERBIRD LX  1992 FORD  THUNDERBIRD LX  V-8 Power Loaded  Sunroof  13, 200  V-6 Power Leather  & Cloth Interior  12,000  or... Do you need \"FULL SIZE\" Comfort?  1985 LINCOLN  TOWN CAR  eg  Fully Loaded One Is A One Owner  \"FULL SIZE LUXURY\"  1982 CADILLAC  FLEETWOOD 3ROUGHAM  One Owner \"New Paint Runs Good  \"PRICED TO SELL\"  MANY MORE INCLINING 9 TEHPOTOPAZ UNIT. PRICED TO SELL & EQUIPPED RIGHT!  SHOWALTER FORD  99 East Main  789-3825  1A0 East Main  789-3818  Plus Tax & License  335 West Main  789-38S", "parent": 22650613, "version": 1739884649969090561}]}