{"numFound": 12, "start": 0, "numFoundExact": true, "docs": [{"id": 22658300, "paper": "Vernal Express", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/01/8f/018f6999eb052941afeb57b0ce88da2b4aae0488.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/0b/df/0bdf758f418a84cb8a8d83543df2ef58c6d2a7b6.pdf", "page": 1, "ocr": "UTAH PRESS AS3XIAT  337 W 200 S S5005  SLC, UT 841C1  Ifeth lab slmt down page 3 1  Eyegfeatcs collected page S  Restrictions lifted - pae 13  Root with VOOT p 14  Ladies vis at home page 18  Express online: www.vemal.com  Chepk  Inside  J Single Copy &  Swain  pushes for  airport: site  By Steven R. Wallls  Express Editor  Location, location. Location is  everything in teal estate, and it is  important for the Vernal Airport  Squeezed between Highway 40,  2500 South and 500 South, the  Vernal Airport has no place to grow,  unless additional property is  acquired and homes are moved.  An extensive airport study done  five years ago concluded that the  least expensive location for the airport  air-port is its present location in Vernal  City.  About 30 locations for the airport  were looked at After the study  Uintah County Commissioners and  the Vernal City Council agreed the  best spot for a larger airport would  be the Sunshine Beach area, about 9  miles east of Vernal. The National  Pari Service has filed an objection  to the Sunshine Bench location  because of concerns about noise.  Airport Manager Tom Wardell  said the Park Service has not determined  deter-mined how much noise from aircraft  is too much, but because the  Sunshine Bench site is about three  miles from Dinosaur National  Monument's boundaries, the noise  might have an impact  More recently Commission Lloyd  Swain has proposed to the  Roosevelt City Council, that the  Roosevelt Airport be closed along  with the Vernal Airport and a new  \"regional airport\" be built 12 miles  west of Vernal in the McCoy Flat  area. The location is likely more  expensive than expanding the existing  exist-ing site or dealinc with poise problems  prob-lems at the Sunshine Bench site.  In my mind the existing location  is not possible because it would  require the county to condemn property,  prop-erty, and the present commission  will not condemn property,' said  Commissioner Lloyd Swain.  The Roosevelt City Council has  not formally approved the proposal  and Vernal City, which owns one-fourth  one-fourth of the airport, has not heard  the proposal yet  The airport has recently been  awarded $115,000 from the  Community Impact Board to conduct  con-duct a financial plan. The funds will  be matched with funding from the  State Aeronautics, the , Uintah  Special Service District and Uintah  County. The study, which will take  about six months, will determine the  detailed costs of putting the airport  at each location.  This is something the FAA has  requested,' said Wardell.  The study will look at soil conditions,  condi-tions, approaches, costs of closing  the present airport, and services to  the new airport '  Wardell said the study five years  ago didn't consider these factors,  nor did it address a complete  replacement of the runway if the airport  air-port stays put  \"The 50 year old asphalt is crumbling,'\"  crum-bling,'\" Wardell said. \"There is a  chip seal over the top, but underneath,  under-neath, it is crumbling.\"  See Airport on page 11  'uYQcaaOs  0 jl r  After years of waiting, ground is finally broken for the Uintah County Care Center and Adult Day Care  extension by County Comrnissioners Uoyd Swain and Cloyd Harrison; board member Karl Breitenbach;  Care Center Administrator Shawn Matheson; care giver Mary Goodrich, board members Gary Showalter,  Keith McDonald, Lsn Gotfredson, Duane Hafl and Ed Bufloch; Grants Commissioner Heather Hoyt and  im Biown from Wadman Construction h Ogdea  \"IfECDAY, September 12, 2001  \"r. s  Phyllis Phillips, Judy and Coleman  attacks.  By Steven R. Wallls  Express Editor  While firefighters and emergency  personal worked outside the  Pentagon and Trade Center, a group  of about 100 residents gathered  around the south steps of the Uintah  County Building in an interfaith  prayer and candle vigil.  Pastor Stm Arias said Tuesday  morning after viewing the terrorists  attacks and answering many telephones  tele-phones calls, he was moved to the  point of fear.  \"The goal of terrorism is to divide  us and breed distrust,\" Pastor Arias  said. \"No. we are not going to let  them do that-Soon  that-Soon after the attacks, the Vernal  Airport, like others across the country,  coun-try, was closed to all incoming and  outgoing aircraft except for the military,  mil-itary, said Tom Wardell, airport  manager. \"I wondered if the faxed  order from the FAA included private  pri-vate aircraft and they the FFA  called after the fax and confirmed  that it did,\" Wanfcll said.  Schools stayed in session and the  county employees stayed on the  job. Federal employees at Flaming  Gorge Dam were put on alert  \"Neighbor to neighbor we need to  face this,\" said Pastor Arias at the  vigil. \"On our currency is says 'In  break giromdl foir Care Center extension  n '  - i - v i  V  v  '  u  f  Ayers hold candles during interfaith prayer vigil to address terrorist  God we trust' it is an important  point to petition God.\"  \"I am more concerned about  you,\" Pastor Arias said. \"You represent  repre-sent the life of this country.\"  President Norm Nelson, Maeser  Stake, at the vigil said that families  should gather together and offer a  prayer so that families can stand  firm during incidents of ugliness.  \"I have the same feeling in my  gut that I had 50 years ago come  this November,\" said Duane Hall,  Utah State Commander to the  National . VFW Legislative  Committee.  Then with a battered helmet and a  rifle in his hand Hall said he asked  , God not let the travesties of war  happen to his county, his home  town or his family.  \"Today's events make my blood  turn cold,\" Hall said  He noted that the Japanese  Commander Yamamoto, as he  returned to Japan after the devastation  devasta-tion caused at Pearl Harbor, was not  thrilled with what had happened.  \"He said, 'We may have awakened  awak-ened a sleeping giant,'\" Hall said.  Hall said that when you are under  attack you never lower the flag to  half mast He was glad that the  three flags in front of the court  house had stayed at half mast during  dur-ing the morning. He said he did not  i. ;a .  jj  4 i-  i X  Veroal, Utah 84078  v V..  -  disapprove of them being lowered  to half mast in the afternoon, but for  the remainder of the vigil he asked  that the flags be once again hoisted  to the top.  Dennis Hatch, Uintah Stake presidency,  presi-dency, said that he recently sent his  son to basic training continuing a  long family tradition of service to  country.  \"I told him that after he gets back  he will never see the flag go by  without a feeling of pride,' Hatch  said.  One by one the members of the  clergy offered prayers for peace,  comfort, and love. After candles  were lit by those at the vigil. Pastor  Arias urged the group to offer  prayers among themselves.  . Pastor Arias told those at the gathering  gath-ering to take the same message to  their neighbors who were not present  pre-sent \"We should not address this  alone,\" he said. \"We have nothing  to fear, but fear itself,\" said Arias  Clergymen participating in the  vigil were Stan Arias, Phil Daggett,  Dennis Hatch, Norm Nelson, Marty  Young and David Popham. .  Later Tuesday night motorists  lined up at local service stations to  fill up with gas, fearing that prices  might double or triple before the  next day because of the terrorist  attacks.  By -Virginia Harrington  Feature Writer  County Commissioners Cloyd  Harrison and Lloyd Swain joined  Uintah ' County Care Center  Management Board members,  County Attorney Glen Vernon, Care  Center employees, grants writer  Heather Hoyt and Tim Brown from  Wadman Construction of Ogden in  a ground breaking ceremony for a  new addition to the Care Center last  Thursday.  Mary Goodrich, whose husband is  a resident in the Center, took firm  hold of a shovel and contributed her  efforts to the occasion.  Care Center Board Chairman  Keith McDonald said the board was  put together over a year ago to help  provide improved management and  to work toward completion of the  extension. He commented that there  is a long waiting list of people in  By Steven R.  . Waills  Express Editor  The change in  government 13  years ago in  Grand County is  similar to the  change that is  facing Uintah  County voters  this November,  but there are  some definite  differences.  When Grand  county residents  voted for the  change in 1992, there was nothing  in the Utah Code to guide them  through the change. They voted 56  percent in favor of a seven member  nonpartisan county council which  has been at the head of county government  gov-ernment since its election in 1993.  Not every resident in the county  has liked the change, but attempts  to change the form of government  or recall the council member have  failed by wide margins.  \"There is no recall law in Utah, it  is almost impossible to remove art  elected official from office,\" said  Sam Taylor, co-publisher of the  Times Independent, the local newspaper  news-paper in Moab. Taylor was answer-'  answer-' ing questions from members of the  Uintah Committee for a Better  Form of Government Friday.  Taylor said he remembers the  event that convinced him to support  the change in government.  It was a public meeting with  about 200 people in attendance  where commissioners, were going  to select the executive director of  the Travel Board. The commissioners  commis-sioners made their selection before  listening to public input,\" Taylor  said.  Grand County Council member  Jerry McNeely also remembers that  during a debate of the League of  Women Voters, one of the council  members said he was running, \"so  be could get more county contracts.\"  con-tracts.\" . Differences between the Grand  County form of government and  what is proposed in Uintah are:  The Grand Council Council is  non-partisan, much like school  board members.  The Grand County Council  does not require an administrator,  but it now has one. '  There is a recall provision for  the Grand County Council members.  mem-bers. Grand County has also implemented  imple-mented term limits in its council.  The Grand County Council  makes all of its decisions in open  meetings.  \"With three commissioners there  was always an odd man out\" said  Taylor.  need of the Care Center's services  and that it is exciting to see this  ground breaking finally happen.  Board member Dr. Karl  Breitenbach said he and other members  mem-bers of the board were very happy  to see the day finally come when  construction could begin. \"The  community has been wanting this  day to come for seven years,\" said  Breitenbach. Other board members  present were Len Gotfredson, Ed  Bulloch, Duane Hall -and Gary  Showalter.  Shawn Matheson, administrator  of the Center for the past seven  months, said there have been many  changes in the way the Center has  been run during the last several  months, with significant decreases  in financial losses compared to past  years. He also said the County  Commissioners' and Management  Board should be thanked for their  foresight in planning for this new  109th Year No. 37 20 Pages  1 1 f .  Dr. Rod Anderson discuss a council form of government  gov-ernment with Grand County Councilman AJ  McLeod.  \"Now decisions are not made by  a two-man dictatorship,\" said  Councilman Al McLeod.  Council members stated that their  biggest opposition was for being  nonpartisan.  \"There is still some who want to  vote for all the council members,  but that is a small issue,\" said  Councilman McNeely  Councilwoman Joette Langenaise  said that she believes the Utah  Association of Counties is an asset  to them despite UAC's perceived  opposition to the council form of  county government.  Council members spend about 15  to 20 hours a week in meetings.  The Grand County Council meets  twice a month, but also holds open  workshop meetings the other  weeks.  Not all county officials are  thrilled with the Grand County  form of government  \"There are pros and cons to any  change,\" said Fran Townson, Grand  County Clerk Auditor.  Townson has been the Grand  County Clerk Auditor for 16 years,  is retiring this year. \"If I had the  energy I would work to change it  back to a three-man commission,\"  she said.  Her objections were:  It takes too long for the council  coun-cil to come to a consensus. \"Each  council member brings their own  agenda to the table and time after  time items are tabled,\" she said.  More costly. She said the  move from a part-time three-man  commission to 7-man council and  administrator tripled the council's  budget  There are no Utah Codes that  direct the procedures for dealing  with such issues as recalls. \"There  is no provision for filling the  vacancy for a nonpartisan council  member who has been recalled\"  Dr. Rodney Anderson, chairman  of the Committee for a Better Form  of Government said he was buoyed  up by his meeting with the Grand  .County Council.  \"We know it is working in Grand  County, although there are some  See Proposal on page 11  addition to the building. \"The community  com-munity should be proud of this  facility. It will be the nicest in Utah  with the best staff to resident ratio  in the state. We can look forward to  the Center's continuing to meet the  needs of the community for some  time to come.\"  Commissioner Cloyd Harrison  said the Care Center has been  examined and reexamined by the  Commission for years. \"When  Lorin Merrell left office, he asked  the commission to continue to try to  meet the needs of the community  and we are now at the point of  breaking ground We need to thank  Herb Snyder and Traditions Health  Care Organization for keeping-the  costs down and saving us nearly a  million dollars.\" Harrison added  with a wry smile. \"As we age, the  facility becomes more important to  See Care Center on page 12  i  K COPY", "parent": 22658299, "version": 1739888815749726209}, {"id": 22658301, "paper": "Vernal Express", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/e8/ed/e8edfe2281bee31b765f135eaaa30601eacd4136.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/bf/14/bf14408ce94f443e4c51287ceedc4f0d05eccc14.pdf", "page": 2, "ocr": "2 Vernal Exprets VVedrs3ay Snbef 12. 2-Xi Opinion and Commentary  ( SET YDUR SHOaTlrV IRON REA0V  VJCUZ. I'M HJNr4A CALL YOU v.  fc GREAT Blfr FAT BULL E  JACK-STRAWS  by Jack Warns  i-i mm- hi  Credit scoring on insurance  According to the Utah Insurance IVpurtmrnt credit  sewing has bcetsne a he issue between those selling  and pun. having homeowner and auto insurance ia  l'uh Inficmattoa about a person' credit history is  InmslaU-d into a score that nuny insurer use, along  with other (actor Lie loss history and dming record,  to dcseUtp homcow ner and auto insurance premium  ard to permit or deny coverage.  Ie purveyors of credit conrig have recogrued that  it can ruse negative unpad on individual and consumers  con-sumers and a a result have disallowed the use of certain  cer-tain criteria in their development of a credit score,  such as ethnic group, age, mania) status, nationality,  gender, address, religion, and income.  Pie l'uh Insurance Department ha received a number  num-ber ol complaint from l'uh residents regarding the  use trf credit storing by their homeowner or automobile  automo-bile insurance companies.  hie man reported that he had been with the same  automobile insurance company for 20 year. He had  no history of accident or tickets in that time, he paid  for everything in cash and had no credit card and no  debits, or mortgage. When he asked the insurer why  Ins premium was increased by S2O0 every sit months  he was told it wa because hi credit score was low.  He didn't have enough credit  A young couple wa cleared by their bank for a  home loan. They purchased the home and at the same  time purchased a few new appliances. When their  homeowners insurance came in the mail there was an  unexpected $170 increase. They were told that it was  due to their credit scene Each application for credit to  purchase an appliance for their home created a hit on  their credit record and affected their credit score.  Aw omen called the department in tears due to the  situation she felt her insurance carrier had put her in.  She had three teenage driver who had been responsible  responsi-ble for two auto accidents resulting in extremely high  automobile insurance premium she was trying to pay.  I he lin.il straw came when at the renewal of her auto  policy her insurer had checked her credit score, which  wa low, and now her auto premium was even higher.  She the a had to decide whether to pay for the premium  premi-um or buy food.  In l'uh there are currently 197 insurers se.Mmg personal  per-sonal auto insurance and 138 insurers selling homeowner  home-owner insurance. The deparunent has not verified  whether these insurance companies are using credit  scoring to underwrite and prve their insurance products.  prod-ucts. The word w ithin the industry is that most are.  The use of credit scoring ia Utah is not prohibiied.  The credit score is designed to serve the interests of  insurance companies. While credit scoring serves a  useful purpose for insurance companies and makes  their operation simpler and more efficient, k is questionable  ques-tionable how well some insureds with lew credit  scores are treated as a result  The Insurance Department feels that in order for  credit scoring to he appropriate for use in underwriting  underwrit-ing consumer insurance, credit scoring needs to be  enhanced.  \"Consumer who have their insurance premium  increased or coverage dropped because of a low credit  score must be given specific reasons for the low credit  score,\" suted Commissioner Merw in U. Stewart  \"It is common knowledge that credit reports are  often inaccurate. If the credit score is overly sensitive  to late payments it can inappropriately work to the  consumer's disadvanuge. Sometimes a single late  payment, even if associated with a traumatic injury,  illness or death in the family, will cause ones credit  score to drop to a level that negatively impacts premium  premi-um rates and coverage. As a result consumers should  be given the opptntunity to correct their information,  Stewart stressed.  \"Credit sewing is appropriate if the . consumer's  interest is also protected. An insured and his or her  agent need to know the specific reason for an increase  in premium or why the insurance company has discontinued  dis-continued coverage on a person's home or their automobile.  auto-mobile. They do not want to simply be told it is  because of their low credit score. This has little meaning  mean-ing and is impossible to reconcile, the Commissioner  explained.  PUBLIC FORUM  LETTERS TO THE  EDITOR  What is your opinion? The Express welcomes letters  let-ters Irom its readers concerning any subject pertinent  perti-nent to the Uintah Basin. There are no restrictions  as to contents, if not libelous or vindictive and of  reasonable length (two typewritten double spaced  pages). Letters must be submitted exclusively to  the Express and bear the writer's full name, signature,  signa-ture, phone number and address, letters for the  sole purpose of expressing thanks to individuals or  groups will not be printod in the forum. Letters may  be mailed, faxed at 789-8690 or through e-mail at  editor vernal com. The name or names of those  submitting letters must appear on all published letters.  let-ters. All letters are subject to condensation. Letters  express the opinion of the writer and are not necessarily  nec-essarily the opinion of the Express Editor.  Pornography  Dear Editor,  We feel that as members of our community, we each  have a duty to help keep Vernal free from pornography,  a cause of so many social ills. As Phil Buress has said,  \"Soft core pornography and legal pornography are the  worst because they start our children on the path to  addication \" Here is Vernal, as in many cities, there is a  problem, although many of us have grown so accustomed  accus-tomed to it that we hardly recognize it for pornogaphy.  Every time we shop in local stores we are shocked,  embarrassed, and somcthimcs alarmed at the picture  displayed on magazine cover, usually at just the right  height for children to view. It seems the magazines with  familiar title have gradually grown worse and worse  without anyone noticing. We're beginning to feel that  it's not enough to cover our children's eves or to leave  them home when we shop we don't want to see it  cither. We ask the residents of Vernal, as members of  our community, to help keep our community clean.  Show your concern. Write to or talk to the managers of  local stores. We are sure that most, if they realize it is a  concern to their customers, will be willing to cover the  magazines inappropriate for children. Thank you for  your help in making Vernal a better place.  BENJAMIN AND JULIE FLAKE  Vernal  wm VERNAL  Express  (ISSN 0892-1091)  Published every Wednesday for S24 per year in shopping area and  $36 per year out of shopping area within state and $39 per year out of  state within USA by the Vernal Express Publishing Company, 54 North  Vernal Avenue. Vernal, Utah 64078. Periodicals postage paid at Vernal,  Utah 84078.  POSTMASTER: Send address changes to VERNAL EXPRESS, P.O. ,  Box 1000, Vernal Utah 84078.  Jack R. Wailis -Publisher  Steven R. Wailis Editor and co-publisher  Virginia Harrington.. Feature writer  VicW Fekft .. Public Notices  Richard Harrington .. Advertising  Sara Moon Advertising  Jody Smuin Ctrcutaton a Classified Ads  Phone: 435-788-3511 FAX: 435-789-8690  Website: www.vamal.com a-mai: wJrtorOvemal.com  DEADLINES  News  Display Advertising  Classified Advertising  Pubiic Notices  ..Monday 12 noon  Monday 5 p.m.  Monday 5 p.m.  -..Monday 3 p.m.  .  Don't compound evil  Dear Editor,  Along with all America, we were stunned and horrified  horri-fied as we watched the coverage of the terrorist attacks  on America. We can't even comprehend what must be  in the hearts of the perpetrators. No condemnation  could be too strong.  At the same time, we have been shocked at America's,  eagerness to place blame within minutes of the attack  and Palestinians tend to be equated with terrorists,  like all Utahns are thought to be Mormons.  From July 2000 to August 2001, my husband, family  and I lived in the West Bank (also known as Palestine  or, in Israel, as the \"territories,\" meaning the territories  under Israeli military occupation.) We were on sabbatical  sabbati-cal leave from Utah State University along with another  couple from USU. As we helped establish a new university  uni-versity in the governate of Jenin, we came to know  many Palestinians our students, our friends, our  neighbors. Although some Palestinians are terrorists,  they are few. Yet Americans often stereotype the entire  culture based on those few. The people we knew were  kindhearled, compassionate and loyal friends, and  already we have been contacted by friends in Palestine  who expressed their sorrow and concern for our suffering.  suffer-ing. We received the following e-mail in the afternoon  of Sept. 11, 2001, from American Protestant missionary  neighbors still in Palestine.  \"We are in Zebabdch the Palestinian village we lived  in, safe and sound. We have been watching the television  televi-sion with disbelief and horror for the past several hours.  During that time, many of our friends and neighbors  here have expressed their concern and grief for the  enormous tragedies today in the United States. Like us,  they are stunned by the unfathomable loss..., We-and  they-are also deeply saddened by the reports of  Palestinians celebrating-not only because of the ugliness  ugli-ness and wTongness of that response, but also because it  runs so counter to the character of the people here  whom we have come to know and love.  \"Despite our many differences (cultural, linguistic,  religious, political...) we are held together by a common  com-mon humanity that today shares a broken heart  Please know that the thoughts and prayers of many  Palestinians are with those touched by the horror of  today. \"Elizabeth and Marthame Sanders\"  Please, let's not compound the evil of this day by  indiscriminately hating innocent people.  CAROLYN M. SQUIRES  Vernal  Lost child  Dear Editor,  I would like to take a minute and thank all those law  enforcement agencies and my wonderful neighbors for  helping me find rry 2 12 year old son, Brycen, and our  family dog.  On Monday, August 20, around 10:30 a.m. Three of  my children had gone outside to play in the backyard  which is fenced and we had an elastic bungee cord  keeping the gate closed. I still don't know which child  undid the cord, but when I went outside to load my  children into the car around 1 1 a.m., Brycen was  nowhere to be found. I called my husband at work and  told him that I couldn't find Brycen, or our family dog,  and I had searched the house and our yard. I also called  my sisters and asked my neighbors to help me locate  my son. When my sisters got to my home, we called  911 and within minutes the Uintah County Sheriff's  Department, Naples City, and the Utah Highway Patrol  all responded. The Sheriff's Department immediately  had Search and Rescue on the case. The Law  Enforcement and our neighbors were searching the  fields, roads, their own yards and houses and everywhere  every-where we could think to look. It took two hours to find  my son. He had crossed Bonanza Highway and walked  almost a mile through a field. He had followed our  family pet. My husband, Brandon, had a feeling to look  down a field that was about a half a mile from our  w 5i  11 tf a y .. i  r r . c  X 2  Tuesday's tragic events  By Governor Leavitt  Seldom has the world witnessed a  human tragedy as shocking as  today's events. Our hearts are full  of grief as we mourn for the victims  and their families. These egregious  acts are a sobering reminder that  there are evil people who will do  outrageous and unthinkable acts to  cause pain in this world.  Even as we watch in amazement,  we have no information that indicates  indi-cates that public safety in Utah is at  : \" ,' 4 t  risk. All state buildings remain  open and fully operational. We are  taking reasonable precautions,  including restrictions on deliveries  to state buildings and a requirement  that all state workers wear their  identification badges. Public safety  officials remain in constant contact  with our federal partners. Some  portions of state government, such  as the National Guard, are in a  heightened state of readiness.  Today's events raise inevitable  inquiries about public safety during  the 2002 Olympic Winter XJames.  Public safety and security have  always been top priorities. We have  a strategic plan to execute and we  will take all possible measures to  deploy it properly. Today's tragic  events only strengthen our resolve  to do all that is humanly possible to  assure the Games are conducted  successfully.  home and saw our dog. He knew Brycen had to be with  the dog. There was a some woman at her home at the  end of a dead end road that had my son by the hand and  was looking for his parents. We feeling very lucky to  have gotten our son home safely.  I just wanted to say thank you to everyone who was  here to help my family be reunited, I don't know all the  names of those wonderful people who came to help,  but thank you just the same. You know who you are.  Just to let you know we now have a padlock on the  gate and only two keys can open it, and my husband  and I have them. I never realized how fast a child could  get away from you and get so far. I thank my lucky  stars that there are people out there who are still willing  to lend a hand with no questions asked for those of us  who are in need of their help.  BRANDON AND MAND Y COTTAM  Vemal  Government proposal  Dear Editor,  I am writing in response to the recent ads from The  Committee for a BETTER Form of County  Government This is the committee proposing the  County Council form of government I am appreciative  of die positive tone and informative nature of the committee's  com-mittee's ads. In an age when it seems personal attacks  and emotional arguments are the rule in politics rather  than the exception, I appreciate a group that believes  the voters have the intellect to review a proposal and  decide for themselves. I have visited the committee's  web page (www.7countycouncil.com) and there read  their \"Plan\" for county government. I agree with their  plan and would encourage all to read the plan for themselves.  them-selves. I agree with the idea of better representation for  all county residents. I agree with the idea of a professional  profes-sional County Manager. I will be voting \"For\" the  County Council. As the election draws nearer I, for  one, will find it interesting to watch the campaigning  and see whether the ads (either for and against the  County Council) will be positive and informative.  VINTDEGRAW  Vemal  Escort  Dear Editor, .  I would like to thank the Vemal City Police for their  traffic control at the intersection by Thompson's  Mortuary on Aug. 20 and for their escort at the funeral  procession of \"Polly\" Karren.  They must have been invisible because they weren't  seen. Also a thank you to the person driving the white  SUB that drove right through the middle of the procession  proces-sion to get through that intersection.  I also could not help but notice the disrespect of the  people who were in such a hurry. I guess they could not  show their respect by pulling to the side of the road and  stopping for a funeral procession. If you are in such a  hurry, why don't you start out earlier so you have some  time to stop. You all know who you are. Thank You.  DELORIS \"SIS\" DEMBOWESKI  Vernal  Lost student  Dear Editor,  I would like to express my concern about what happened  hap-pened to my 5-year-old who was starting Connections  for the first time on Wednesday, Sept 5.  When this program was announced to us, we were  under the impression our children would be safe, in the  care of adults. But my 5 year old was not She was  found scared on Highway 4. Where were the adults and  care givers who were suppose to be watching her during  dur-ing this time. Thank goodness a man and his wife  found her and contacted the school when the man contacted  con-tacted the school about the child an hour had gone by  and the child's mother had not been contacted.  Why was I not contacted as soon as two children  reported she had left the school?  The helpers for Connections searched the inside of  the school and not once did they look outside for her.  She got home unharmed, but will the next child be so  lUcky.  N1CHOEL GREEN  Vemal  Optional plan  Dear Editor,  Garth Heaton stated in his Aug. 29 letter to the editor  that \"The Vemal Chamber of Commerce in not sponsoring  spon-soring the Optional Plan of Uintah County  Government\" .  However; it is interesting to note that key persons initiating  ini-tiating and supporting this change are Mike Goddarct  past president of the Chamber, Greg Hawkins, past  executive director of the Chamber and Jill Goodman,  current president of the Chamber. In fact Mr. Heaton,  himself, is the chairman of the Economic Development  Council of the Chamber.  It seems to me that the \"grassroots\" effort in favor of  this change seems to be rooted in the same place.  JANEAN LEKAS ' '  Citizen of Uintah County  Debate  Dear Editor, .  In keeping with the importance of a knowledgeable  and enlightened electorate's civic responsibility of fully  understanding an issue before it the Libertarian Party  of Uintah County is offering to host a public debate on  the question of local government by a three member  county commissioner vs. a seven member county council.  coun-cil. , ' .-- ;  The proposed debate would be designed to explore  the pros and cons in depth, and should require three  proponents from each side. ' v - y  The moderator of the debate will be respected' member  mem-ber of the community agreeable to each side as well as  the date and location of the event ; '  It is hoped that Mr. Ralph Preece, leading proponent  of the current commission for of local government and  Dr. Rodney Anderson, leading proponent of the council  for will accept this important invitation and responsibility.  responsibil-ity. I may be reached at 789-4888.  BRUCE A. DANIELS,  Chairman Libertarian Party of Uintah County - j  POOR C  MKtmmrft9 ifiM Kim,)'' mimuijH, iii", "parent": 22658299, "version": 1739886708378304512}, {"id": 22658302, "paper": "Vernal Express", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/b0/21/b021c0a49ff619c7a31133913ce87246829501e0.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/57/ee/57ee148c3e8be1ee29cd718ec815e963429b07ec.pdf", "page": 3, "ocr": "Vernal Express Wednesday. Septerrvber 12.2001 3  Congressman Cannon  reacts to Tuesday's events  Congressman Canaoa issued the  following statement today from  Washington, DC  One of the inhere risls of beujg  an open and free society is our susceptibility  sus-ceptibility to cowardly acts.  But one of the inherent strengths  of the America spirit is that we. as  a people, wiE act be intimidated by  cowardice. Those who committed  these acts ttaderestimate the resolve  of (he American people to defend  our freedom and pursue justice.  President Bush will have the full  support of the Congress as he  designs an appropriate response to  this senseless violence. The United  States' reaction to these acts of war  must be swift and strong. We will  find and punish those responsible  for today's malevolence, even as  H; lot  ' IT -flaw '  Travis Jay Shannon AMn  Berg Water  II  fo4r for.  a tv.  Judy Lynn Scott Eugene  Watson Welch  JVf  Michael Aron Heath Wade  Barber Anderson  Sheriff's  Warrants  As of Monday, Sept 10, 2001,  warrants of arrest have been issued  from 8th District Court for the following  fol-lowing individuals:  Travis Jay Berg, bom Oct 5,  1976, is wanted on a $500 warrant  Shannon Alvin Walter, bom  Feb. 27, 1970, is wanted on a  $10,000 warrant  Judy Lynn Watson, born May  3, 1972, is wanted on a $6,000  warrant  Scott Eugene Welch, bom  Feb. 28, 1962, is wanted on a  $10,000 warrant  Michael Aron Barber, bom  July 27, 1975, is wanted on two  no-bail warrants.  Heath Wade Anderson, bora  Feb. 1, 1976, is wanted on a  $10,000 warrant  Persons with information about  the location of these individuals  are urged to contact the Uintah  County Sheriffs Department 789-2511;  789-2511; Central Dispatch at 789-4222  789-4222 or use the Secret Witness  Line, 781-5400.  ( V v..  Denise Lucero  Case  the perpetrators hide among innocent  inno-cent men, women and children.  We are a narica of law, and while  our response most be decisive, it  also must be focused The civil liberties  lib-erties of all within our borders are  paramount, regardless of mho is  responsible for these acts of terror.  lYornan  charged with  possession  of drugs  A Vernal  woman was  arrested by  Uintah County  Sheriff's  deputies  Sunday on suspected  sus-pected drugs  and drug para-p  para-p h e r n a 1 i a  charges.  When  Corporal Anthoney Byron stopped a  vehicle for a traffic violation, he  detected an odor of an alcoholic  beverage on the drivers breath.  After obtaining consent to search  the vehicle, a small quantity of  alleged rnethamphetamine was  located. She was arrested and taken  to the Uintah County Jail.  While at the jail. Corporal Byron  asked the suspect when she had last  used drugs and bow. She answered  that she had used a pipe. Corporal  Byron asked where the pipe was  located and she stated that it was at  her home. He asked if they could  retrieve it and she said they could.  Corporal Byron then took the suspect  sus-pect to her home to locate the pipe.  When they went in, and she gave  them the pipe. Corporal Byron  observe a small bag containing  what appeared to be marijuana. He  took that as evidence and returned  her to the jail.  Denise Lucero Case, 36, of Vernal  was charged with possession of  methamphetamine, possession of  marijuana and possession of drug  paraphernalia. Her bail was set at  $5,925.  Colorado  man killed  in hsadon  A two vehicle headon collision  Sunday killed one person and seriously  seri-ously injured another.  At about 7:21 a.m, Gary Jarvis,  37, and Michael Jarvis, 27, both of  Colorado were traveling north on  SR-45 in a 1997 Ford F-250 pickup.  pick-up. They had been working all  night on a drilling rig for Pattersen  Drilling Company on the 7 p.m. to  7 a.m. shift At milepost 23, Gary  apparently fell asleep at the wheel  and drifted over into the southbound  south-bound lane hitting a tractor trailer  head-on. Gary was dead at the  scene. Michael was transported by  Life Flight to the U. Of U. Hospital  with head injuries.  The truck driver John Price, 44, of  Casper, Wyo., sustained minor  injuries. He was treated and  released at Ashley Valley Medical  Center.  Bill  CANDIDATE FOR  VERNAL CITY  MAYOR  have been honored to be your mayor for the past  4 years and I have enjoyed It very much. '  We have accomplished many things in Vernal. I  would like to have an opportunity to continue in helping  to accomplish more good things in the future such as:  the Cobblerock Park, and the continual need in streets,  sidewalks, sewer and water improvements.  I will appreciate your vote on Nov. 6 general election.  Traffic stop leads to search warrant  for IVIeth iab at Roosevelt residence  . A traffic stop shortly after mid-Bight  mid-Bight on Monday September 10,  2001. resulted is a search warrant at  a Roosevelt residence where a  taethamphctaiziije laboratory w as  seized by Uintah Basin Narcotics  Strike Force Agents and local law  enforcement officials.  The search warrant was executed  at approximately 1 1 :30 am Monday  where narcotics officers discovered  what is believed to be the first \"Nazi  method\" mehamphetarnine labore-tory  labore-tory seized in the stats of Utah. This  \"Nazi\" method is mov ing to the  western states from the East and has  been suspected to be moving into  the western U.S. This method uses  different pre-cursor chemicals to  manufacture mem rather than the  typical iodine and red phosphorous  method. Chemicals used in the  \"Nazi\" method are anhydrous  ammonia, and lithium or sodium  metals. The \"Nazi\" method typically  typical-ly has a methamphetamine yield of  90-95 with less hazardous waste  and converts pseudoephedrine to  methamphetamine through a reaction  reac-tion process with various chemicals.  The search warrant was executed  at 193 West 100 South in Roosevelt  JL  1 17- iimnn  3TT : -ft  -! I '  Fill  I  1  )  Larry Jones  Materials used for making meth were taken from a Roosevelt residence  resi-dence this week.  and 2 males arrested. Booked into  the Duchesne County Jail were  Billy Richards, 37 of Roosevelt and  Larry Jones. 3 1 of Kansas. Richards  was booked for possession of a  methamphetamine laboratory; 2  counts of distribution of metham-phetanune;  metham-phetanune; possession of methamphetamine  metham-phetamine and possession of paraphernalia.  para-phernalia. Jones was booked for  possession of a methamphetamine  laboratory; and unauthorized pos  session of a concealed firearm  (handgun). Further investigation  may result in additional charges.  The Uintah Basin Narcotics Strike  Force now has five of their agents  certified by the Drug Enforcement  Administration to handle methamphetamine  metham-phetamine laboratories. Due to the  toxic nature of these labs, agents are  required to use special suits and  breathing apparatuses to handle the  evidence.  j  Bilty Richards  B t W o o o o o o o o o ( ft o ) o  ' a.  HL7  '4  4  4  nn  uuuu  o.  nn  1  IKTuI  We all vote for our county officials, but are we all  heard when it comes to our problems? For those of  us in Ballard, Dry Fork, Lapoint, Maeser, Naples,  Jensen and the other outlying areas, do our county  commissioners understand the special problems  each of us face? With the council form of county  government, we will have someone we know, a  neighbor, a friend, on the council. He or she will live  just down the road. We can talk to them. They  understand. They will be our voice. We will have  equal representation in our county government. This  is important to YOU. Think for yourself. Vote  \"FOR\" the council form of government.  Naples on September 19th at 7 pm  at the Naples City Offices  Vernal on September 26th at 7 pm  at the Vernal City Offices  Other meetings to be announced  www.7countycouncil.com  councileasilink.com  rv  mm  f 1  i 1  .Jk  MS  P.O. Box 790099 Zip 84079  A b  On Nov. 6  Paid Political Ad  (Paid Political Advertisement)  OPY )  A  ,mwm.im;m r&-  VOTE FOR  Bill Kremln, Jr.  9", "parent": 22658299, "version": 1739886129078861824}, {"id": 22658303, "paper": "Vernal Express", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/b2/37/b237ae43ba05550a171381f07b1e53a5295f192a.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/b3/e9/b3e9fe8d7abfa773a7cc2c1b2ccb0f6b1378c96e.pdf", "page": 4, "ocr": "4 Vernal Express V.ednes Seenoer 12. 2X1  Obituaries  r ' i  v (  LoweB leavitt  Lowell S. Leavitt  Ijtmcll Sniih 1-CjvM vas c-HcJ  home in hi Heavenly I auVr ifl  V-pt V 2l. Icll as Kirn in  Si (nHKge In Smith and Ijun  Bovckr Udvitt May IS. 1936.  Ik met his svnctthoirt tf 44 yean,  CariJ LukuiLs. vhile in the Son ice  in S'HJih ('41 \"lua  Ik earned the nickname tf \"Cd  HanJ\" alter nuny years of hard  vutik in llic oilfield As a faithful  member vf uV I DS Church, Lowell  served in many pmIwmh, including  the stake hewdeixy. ihe Bishopric,  Sunday School, and nuny more Ik  was pinbahly best known for hi  missionary vsoik by example.  1,ovm il had mi many friends  through his church service, hunting,  breed and racing quarter hcrses, and  his great passion in life. team penning.  pen-ning. He touched the lives of so  many with his.quick wit and generosity  gen-erosity His great love of hie was  passed on to all who knew him  through his jokes, stories, and tall  tales.  Iiwcll is preceded in death by his  fathers, Smith l eavitt and John E.  Clark, his children, Darrel. IVnise  and David, and hroihor, Darwin  Ixavitt  Ik is survived by his wile, Carol,  Raitgcly. Colo; daughter. Diane  (Brandon) Booth. Salt lake City;  mother. I -aura (Boh) Steele. Vernal;  sisters. K.tlhy (Dan) Robbins.  Vernal. I'atncia Walker. Salt tjke  City; brothii. Mitchell (Colleen)  Claik. Vernal; sister in law. Christie  Ix'avnt, and grandson, David  Ixivull Jensen, Sandy.  funeral services were held  Monday. Sept 10 in the Ashley  Stake Chavl with Bishop An id  Sullivan conducting.  Carol Ixavitt ottered the family  prayer with prelude and postlude  music played by Maureen Johnson.  Kick Robbins gave the invocation  and Danny Robbins read a poem.  Speaker was President Jim Dunn.  Kathy Dcets and Gcri Benedicto,  accompanied by Brian Litton, sang  \"Daddy's Hands\" and \"Goodbye  My Friend.\" and Ron Walker sang  \"High On The Mountain.\"  Gary Carter gave the benediction  and Mitchell Clark dedicated the  grave.  Pallbearers were Denny Pkins,  Brandon Booth. Mitchell Clark,  Robby F.kins, David l-owel! Jensen,  Bobby Atwood and Newell Warren.  Honorary pallbearers were Troy  (Buck) Pollard. Kelly Leigh,  Michael Robbins, Dennis Downs,  Ken Hayden, John Ncibcrger. Rick  Robbins. Wayne Penncll and Bob  Cott.  Interment was in the Vernal  Memorial Park with a flag presentation  presenta-tion give by the America l.cgion  under the direction of Thomson-Blackbtirn  Thomson-Blackbtirn Vernal Mortuary.  Compassionate sen ices were  offered by ihe Vernal 2nd and 9th  Wards.  To our family, many  We are truly grateful for the kindness shown to us during the loss of our  beautiful baby girl Aislyn. Thanks to Barbara at St. Paul's Episcopal  Church for her kindness and compassion, Rula at Vernal Floral for the  beautiful casket spray, and the many other beautiful floral arrangements  sent by others. To all our many neighbors, family and friends for the food  brought to our home before and after services, especially Sharon. Special  thanks to the officers and paramedics, who responded so quickly and the  medical staff at Ashley Valley Medical Center. All of your kindness and  generosity shown to us during this time has truly been appreciated.  The family of Aislyn Sharee Johnson .  V  iJOffiHigA OiJSDB-  Joe I. Gurule  Joe I. Gurule. 76, our beloved husband,  hus-band, father, grandfather. arJ great  grandfather died Sept 6. 2CCI at his  home surrounded by his lev :ng lie  and family. He was bora May IS.  1925 in Canon PUu. NM He married  mar-ried Margaret Dckxet Garcia on  Oct. 21. 1946 ic Delta. Cob. She  died AprJ 16, 198. He rhea married  mar-ried Phyllis Luna on June 6, 9189 in  Vernal.  .e was a member of the Ca&olic  Church. He loved working with bit  hands, horseback riding and being  with his grandchildren. They loved  giring camping and liked to take  cart of sheep. He enjoyed watching  wrestling and boxing.  Joe is survived by his wife.  Phyllis; children. Pauline (Glen)  I omuls, Lapoint; Larry Gurule,  I spanola. N M ; TJ. (Rosiu)  Gurule. LaVerkin; Theresa (Gary)  Hoffman, Vernal. Emily (Bill)  Ziegler, Carbondale. Colo.; Tommy  Gurule. Vernal. Jo Ann (Pablo)  Maes. Liberal. Kan.; step-children,  Jr. (Jennie) Luna, Blaine. Wash.;  Renee (Vic) Delta. Colo.; LeRoy  (Betty), Vernal; Diane (Vincent)  Rodarte, Vernal; three sisters, Eva  Chacon. Canon Plaza. N.M.; Lydia  lankford. Phoenix, Ariz.; Betty  Lar.Lford, Vernal; one brother, Chon  Gurule. Capilin, Colo. Joe is also  sunived by 40 grandchildren and  33 great-grandchildren; and many  nieces and nephews.  He was preceded in death by his  first wife. Margaret De lores; par-  Anthony L. Davis  Anthony Lynn Davis, 17, of  Vernal, died Sept. 10, 2001 in a  motorcycle accident He was bom  Feb. 23. 1984 in Roosevelt, a son of  Ame'don (Ned) Theron Davis and  Deborah Ann Johnson Davis.  Anthony was a member of the  Church of Jesus Christ of Latter-day  Saints. Maeser 3rd Ward. He w as an  Eagle Scout and was a senior at  Uintah High School. He was the  owner of \"Scorpion\" web page  design. He loved sports, especially  caving and snow boarding. He  enjoyed motorcycles and hanging  out with his many friends.  Anthony is sunived by his parents,  par-ents, Amcldon (Ned) Theron and  Deborah Ann Davis; brothers and  sisters, Patrick and Dawnesia Davis,  Jared and Stephanie Davis, Tyroan  and Jackie Jo Davis, Michelle Ann  Davis, Stephanie Wanneta Davis,  Eric Ellis Davis, Lalauni Dawn  Davis; grandparents, Theron and  Lola Davis, Dean and Clifta  Johnson; great-grandparents, Elmer  Caldwell, Frank Johnson, nephew:  Patrick Davis, niece; Jessica Davis;  many aunts, uncles and cousins.  Funeral services will be held  Mew IhonQirs  announced aft  moiniyiniiieinvft  Migrations at Dinosaur National  Monument have started. Seasonal  staff members are moving on, and  new hours for the Dinosaur Quarry  Visitor Center and the Headquarters  Visitor Center in Dinosaur, Colo.,  have been changed to 8 a.m. to 4:30  p.m. every day with the exception  of Thanksgiving, Christmas and  New Years Day.  friends and neighbors  Til  r  V  - r' .  Joe Gurule  ents; daughter, Anna; son, Tomas;  two sisters; and one brother.  Funeral mass was held Monday,  Sept 10 in the St James Catholic  Church with Father Jan Benardz  officiating.  Pallbearers were Cole Horrocks,  Kory Gurule. Quint Horrocks, Koby  Gurule. Isidro Gurule, Jimmy  Ziegler, Kenneth Gurule and Justin  Ziegler.  Honorary pallbearers were Joe  Vigil, Christopher Luna, Matt  Rodarte and Johnny Ziegler.  Interment was in the Vernal  Memorial Park under the direction  of the Spafford Funeral Home.  Anthony Davis  Friday, Sept 14, 2001 at 11 a.m. in  the Maeser 3rd Ward Chapel, 2575  North 1500 West. Friends may call  Thursday from 6 p.m. to 8 p.m. at  Thomson-Blackburn Vernal  Mortuary, 15 East 100 North.  Burial will be in the Rock Point  Cemetery under the direction of  Thomson  Blackburn Vernal  Mortuary.  All other parts of the park remain  open, including self-drive auto  tours, hiking trails, roads and  campgrounds. Entrance fees and  camping fees are still being collected.  collect-ed. Further notice on campground  closing will be issued as they occur.  Fire restrictions have been lifted,  though extreme caution with fire is  always expected and enforced.  wish to extend  . r jk tm ,nmiiii  W  ,,; ; ,  and appreciation to our relatives, friends  and neighbors for their many acts of  kindness, messages of sympathy and  beautiful floral tributes, during the  recent passing of our husband, father  and grandfather, Laddie Richards.  1 tH t  r . Vernal ELbs lodge IN o. AolO 1  mourns  Jack  1. 1 n  exalted Killer rresident;  Brothers BJ, Conrad and Kasey Blanchard place bouquets of carnations at the Veterans Memorial in front  of the court house to honor the multitude of victims in Tuesday's terrorist attacks. Earlier in the day, their  parents Kim and Phil Harper, placed bouquets of mums at the memorial.  Sewing conference  Women's to be September 24  health  tests  available  TriCounty Health Department in  conjunction with the Utah  Department of Health announce that  more women aged 50 to 64 throughout  through-out Utah may now be eligible to  receive free mammograms and Pap  tests throughout the Utah Cancer  Control Program.  Catherine Hoelscher, Utah Cancer  Control Program coordinator, said,  \"Our program has expanded the  income limits to offer \"more free  mammograms and Pap tests to  women whose earnings are higher  than the old income limits and to  women who may not be able to  afford their insurance deductible.  \"It was disheartening when some  women had to be turned away  because their income was just over  the old income limit They made too  much money to meet the guidelines,  yet they didn't make enough to pay  for a mammogram, which costs  about $100 on average. With the new  guidelines, more women will qualify  for free mammograms and Pap  tests.\"  These services are available in  Uintah and Duchesne counties  through TriCounty Health  Department  Temperatures  Erecjfii  Courtesy of Sunrise Airlines  our heartfelt thankss  1 xt nonr  Dale High Low  Sept 4 90 50  Sept 5 92 51  Sept 6 86 48  Sept 7 77 43  Sept 8 74 32  Sept 9 83 30  tke loss of  Voyles'  1 - r .1 .  VV V  . ' \"-  Submitted by Ronda IL Olsen,  USU Family Consumer  Sciences agent  USU Extension Senice is sponsoring  spon-soring \"Sew Creative,\" a sewing  conference which will be held  Monday and Tuesday Sept 24 and  25 at the USU Uintah Basin  Campus. 978 E. Lagoon Street, in  Roosevelt For participants desiring,  one hour of college credit will be  available by attending the entire  conference and completing a project  pro-ject This is an upper division  course that may be used for re -certification.  By popular demand Elizabeth  Liechty will be presenting a hands-on  hands-on workshop entitled Tailored  Collars and Lapels on Monday from  I p.m. to 5 p.m. During this time  participants will be shaping collars  and lapels using fusible interfacing  and special press techniques which  will allow them to tailor custom  suits and coats. Enrollment in the  workshop is limited to the first 20  participants who pre-register.  On Tuesday activities will start at  8:30 a.m. with registration followed  by an opening kick-off beginning qt  Phone number offered to  those with disabilities  Starting Oct 1, 2001, the  Telecommunication Relay Service  (TRS) will be easier to reach by  dialing 7-1-1.  According to Glenda Stewart,  Public Relations Director for UBTA  - UBET Communications, 7-1-1  will soon be the only number customers  cus-tomers need to dial to reach Relay  Utah, 24 hours a day, seven days a  week.  TRS provides a communications  link between people with hearing or  speech disabilities using a text telephone  tele-phone (TTY) and people who use  voice phone. Although existing 800  numbers will remain in effect  implementation of 7-1-1 dialing  nationwide will make it easier to  use TRS, especially if you are traveling  trav-eling from state to state.  1 ne Jtvay family would like to thank all those  who helped snd showed their love during the  past few years in caring for and helping Dad. t  There are special people who went out of their  way such as Current Topics Club, Bridge Club,  Ladies of Elks, Venial 4th Ward Relief Society  and Bishop Ray Martinsen and all our many  friends who brought food to our homes and  donated to Camp Wapiti. '  The flowers were so beautiful and the help  and love shown by Frank Thomson and Mitch  Blackburn will always be remembered. A special  spe-cial thanks to all who participated in the services.  ser-vices. Lyle Harlow was outstanding in singing  to dad on so many occasions and for his songs  at the. service. Thanks to Annette, Dawn,  Eleanor and Laura for  . The Alvin  9 a.m. were participants will enjoy  a fashion show and an introduction  to computerized pattern drafting  where they will learn the pros and  cons of this concept  Presenters at the conference will  be from USU, Extension as well as  local artists and businesses.  Sessions will include: Chenille  Techniques. Ultra-Suede Applique,  Sweedish Weaving (kit available)  Cathedra Window, Enhancing  Apparel With Cameos, Fleece  Update, What's New in Sewing A  Embroidery Machines, Home  Decorating, Quick Embellishment  Techniques, Shirret Rugs (kit available).  avail-able). Children's Gifts, Maderia  Applique, Tailoring With a  Difference, Time-Saving Sewing,  and Paper Piecing.  As a seamstress do you have a  storage of un-sewn fabric or patterns  pat-terns you no longer use? On  Tuesday at noon participants will  have the opportunity to bring items  if they desire for a Trade Yow  Stash Fabric and Pattern Swap!  For registration information and  fees, call Ronda Olsen at 781-5452,  or Barbara Mathis at 738-1143.  By dailing 7-1-1, you will reach a  TRS center. A communications  assistant at the center will set up a  connection between the TTY caller  and the phone user. The assistant  will \"relay\" the discussion by typing  typ-ing in the voice conversation and  speaking the test message. All communications  com-munications assistants have been  specially trained to help conversation  conversa-tion flow with ease and accuracy.  All calls are handled with total privacy.  pri-vacy. There is no charge for dialing 7-1-1.  You can also use the existing toll  free 800 numbers to reach the TRS  center. For emergencies people  should continue to use 9-1-1,  because 9-1-1 centers have TTYs  and are prepared , to handle emergencies.  emer-gencies. the beautiful music.  \"Air Kay Family  i  v '", "parent": 22658299, "version": 1739893259244666880}, {"id": 22658304, "paper": "Vernal Express", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/f7/7a/f77abf07f5af77bb7c87b5966cb836a17c75a2f6.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/d0/ff/d0ff5e0072d145a9ebb39988340b49b70b50c046.pdf", "page": 5, "ocr": "Vernal Express Wednesday. September 12, 2001 5  Harrisonis webd  art awards  At the Museum of Northwest  Colorado Regional Ait Show in  Craig. Colo, Vernal artist Garth  Harmon won Best of Show in the  professional category and his  wife. Carmen, won a third place  ribbon in the advanced artist  group. The show runs through  Sept 27 and was judged by Jerry  Aniolin, who is becoming well  known throughout the western  states for his striking murals.  Garth's colorful winning piece  was done in Mexico using his  mother-in-law's blue and white  ceramic pot with pink orchid Pie  de Vaca (foot of the cow) surrounded  sur-rounded at the base with mandarin  man-darin oranges.and two varieties of  bananas, leaves of the orchid  being ethereally presented in a  dark green background. Carmen's  work is that of a single magenta  cosmos bloom from her garden,  the stem and leaves emerging  mystically from a darkened background.  Carmen, with a minor in art  from Utah State University,  remembers well the principles  taught her and is one of Garth's  best critics. Garth has studied  extensively at some of the best  workshops in the country and, in  1996, was one of 59 people out of  3,100 applicants juried into the  prestigious Knickerbocker Artists  U S A. He is also a member of the  American Society of Classical  Realism.  Some of the galleries representing  represent-ing Garth are the Flaming Gorge  Lodge; Alpine Art Center in  Alpine, Utah; Southam Gallery in  Salt Lake City; Freedom Gallery  in Provo; Trails West Gallery in  Borrego Springs, Calif.; Akala  Gallery in LaJoJla, Calif and Pa-Jos  Pa-Jos Gallery in Pinedale. Wyo. On  Sept IS. Garth will be a guest  artist of the Jackson - Hole  Chamber of Commerce Fall Art  Festival for the sixth time.  DaifirDGond! MonoimftaiuH aondlies  to peir? ati FSdldlDo Fa5o  Be An Informed  M VOTER!  In response to the advertisement VOTERS OF  UINTAH COUNTY BEWARE, the petition was  to place an initiative to change our form of county  coun-ty government on the ballot. It was written in  plain English and explained in plain English. It  was never about a study nor was it presented to  the public as a study. The first mention of a study  was after the petition had gone to the State  Attorney General, and he made his decision that  the petition was legal and the initiative could be  placed on the ballot. It was then that Deputy  County Attorney Glen Vernon informed the  Uintah County Commission that a study group  could be formed to prepare a voter information  pamphlet. This study, as well as the printing and  mailing of this pamphlet to every registered voter  in Uintah County, would be funded by taxpayer's  money. This was voted on and pass unanimously  by our county commissioners.  (Paid Political AdverUsment)  The Diamond Mountain Dandies  will perform at the Fourth Annual  Hddk Fair in ihe Crossroads Senior  Center. Roosevelt, at 3:30 p.m. on  Sept 22.  The Uintah School of Music and  the Arts' Diamond Mountain  Dandies bring fiddling to a true toe-tapping  toe-tapping level. Fiddling on their  beads, swapping bows and fiddles  and precision synchronized triple  and double fiddling, the Dandies  please audiences whenever they  play-Director  play-Director Ora Fay Oviatt. who  plays keyboard with the group,  started the group in 1989. Through  the years they have performed  throughout the western states,  including Disneyland in California.  During a five year rebuilding period,  peri-od, the group returned to the studio  to regroup, emerging again last  summer under the lead fiddle of  Merietta Lainhart, one of the original  origi-nal Dandies.  Lainhart moved back to Utah after  an eight year absence, during which  she performed professionally in  southern California and Louisiana.  Lainhart has brought the Dandies  to a new height of proficiency as  they perform a wide variety of  Bluegrass favorites as well as Celtic  standards. During a recent concert  tour in Denver, the group charmed  audiences with their haunting rendition  rendi-tion of Ashokan Farewell, their  rousing arrangement of Boilin'  Cabbage and Lainhart's rapid performance  per-formance of Orange Blossom that  challenged the back-up musicians to  match her speed. In addition to fiddlers,  fid-dlers, the Dandies perform on keyboard,  key-board, guitar, bass and a variety of  percussion, including the Lumber  Jack and washboard.  Fiddlers for the Dandies are  Lainhart as lead fiddle, Carly  Egbert, Don Heath and Paul  Wackowski. Oviatt plays keyboard,  Bart Parslow plays guitar, TJ Batty  is on bass and Pave Burfit performs  the percussions.  Forecast for Vernal, UT  AccuWeather.com  Clouds and  tun; DFMzy.  Brady aary  jrd7 f Friday  Ootids and  aun. peasant.  Parta aunn  Saturday  O  Abundant  .72746  Sunday  MosVy tunny.  V 73738 j  Monday  Sunandaoma  rV?  Tuesday  78745y79i  Parfly tunny.  747 j  Thu 6 57am 7 30 p m  Sat 6 S9 a w 7 27 pm  Moo 7 01 a m 7 24 p m  MOO PHASES  Last tanr FM Ft  Thu ?04am 5 ?S p m  S! 4 30am 6 M p m  Mon 7 04am 0?pm  Regnal Tvelew's Cmt s  Waonaaoay Thuraday Fnoay Saturday  C M U MLaWMLaWMLaW  . Caspar WY 71 45 pc 67 45 e 70 45 ah 63 41 pc  ) O I O AotSZ,  ftaa. t taa. 17 aaa. M Oct 1  AocvWaathar, Inc. 62001  Tmc PealFeel Tewefatuwe\"  A composM r aaacM at (Bmparatu. mm, humaay, mm  rKy. ckx!. pfaapitation. and nisvatan on tia Human body  Oayarvw. WY 7246pc 6244c 6944sn 62 42 pc  Ducnaana. UT 76 51 pe 75 50 pc 76 48 t 72 49a  CUM IIM. Iff . ft aT'WTTI MC'tft'lB K,jK&MZ3K3  Evanaton. WY 71 54 pc 70 50 pe 70 50 pe 69 49a  IdanoFata.  Ogdan. UT  76 45 pc 75 44 pc 75 40 ah 72 41 pc  78 53 pc 76 53 pc 76 51 73 49t  Wadnaaday  Sim... 40  Noon . .  6 p.m. .  60  67  Thursday  8 a.m. .. 4T  Noon . . . 65  6 p.m. . . 67  Saturday  8 a.m. . . 53  Noon . .  6 p.m. .  Monday  8 a.m. .  Noon . .  6 p m. .  66  64  35  63  72  Friday  8 a.m. . .  Noon . . .  6 p.m. . .  Sunday  6 am . .  Noon. . .  6 p.m. . .  Tuesday  6 a.m. 51  Noon .  6 p.m.  51  70  68  45  62  64  77  74  Pocatato. O 79 47pc 77 45 pc7644t 74 40 t  mtawarwW!!Wawr  Pkwo. UT 7652pc 7650pc 76 50t 7348  Range CO 79 49 pc 7846pc7945ah 78 41 a  Rooaavat, UT 75 49 pc 74 46 pc 75 47 pc 72 47 t  St Gaorga. UT 6665a 90 64 I 90 64 t 90 64 I  (W): a-atmy a prf etoudf 4-ctoody ah thoim,  t imwajiaTiiiwa, i an aMnoa Vumat. aw now. Inca  Build a nest egg for  winter with, your  unused items-advertise  items-advertise in the '  classifieds!  Come into the  Vernal Express  54 N. Vernal Ave.,  or call  789-3511  The Evolution Of  Your Favorite Toy  JSalWcftMM  lhf an(  TkrM-aatMW  Sm cutunf hwyto  ST II Lswi Tract  M-a.y.KMM  LTIULewi  B ate mum tact  tD4 A t prj;  v8MMaaM I  2nmiMiaai  'MflAf  MM  A we'w (ram, w Im t-tvt mt fir few 1aifha aw  tt9tfs.$to0 it I JofM Dseni ataetir mv yi  MeclwN. WsR Jatv) Dtrfj rac Vm  i aucr atm hM tw  MtM'a1M.  WrljQrVaO8)rV.OOn  To Locate A John Deere Dealer Near You, Call:  888-MOW-PROS fjofl Free &m69-7767)  is  f  y  or iHF ATtaarTailF7 Jk.  \"Moon Lake Electric's involvement  helps us provide top-level patient care\"  Brad LeBaron, Administrator C0 Uintah Basin Medical Center  To meet the needs of the growing population,  the Uintah Basin Medical Center knew it  needed to expand, but capital was limited,  so it was critical to find ways to cut costs.  r  Searching for solutions  from the ground up  Uintah Basin Medical Center was no stranger  to Moon Lake Electric. Both Moon Lake's CEO  and its Member Services Director had served on  the hospital's board. So when talk of cutting  costs came up, Moon Lake had an answer. As  Brad LeBaron, hospital administrator and CEO  recalls, \"Our current architect was proceeding  with a traditional natural gas system when Moon  Lake proposed a ground-source heat purnp.\"  ' , ' 4 11 \" \" \" \" 1 '\"  ymt V u' V \"\"S.  ) . yy  t  fci AawTrri i r ii Miiiiir win a gwrwm mm!  Russ Cowan, Moon Lake Member Services Director ; Brad LeBaron, Uintah Basin Medical  Center AdministratorC0; Grant arl, Moon Lake General ManagerC0  A r f 7  - tomumi I f fy  Vjl fS 1 0 StlaUMrM  V  Geothermal heat pumps circulate fluid  through tubing buried underground to transfer  heat from the earth into buildings. '  Keeping the money where it  belongs in the hospital  After both Moon Lake and the hospital  completed an analysis of the heat pump,  it was found to be far inore cost effective,  allowing the hospital to spend the money  on more important things. As Brad says,  \"With the savings we'll recoup from putting  in the heat pump, we can continue to  purchase the necessary medical equipment  and provide top-level patient care.\"  \"We're as concerned about the  hospital's costs as they are.\"  Helping a hospital isn't what you'd expect  from an electric utility, but Moon Lake  Electric isn't your typical utility.  It's a cooperative. As Moon Lake General  Manager and CEO, Grant Earl, points out,  \"Uintah Basin Medical Center and  Moon Lake Electric have a lot in common.  We're both community based, and we're  both locally owned and controlled,  so we have a common interest in adding value to the community.\" That level  of community concern is what \"power to bring you the best\" is all about.  From investing in higher education to supporting community events,  Moon Lake is committed to delivering the services needed to make this  area the best it can be. \"\"\"V  ( )Moon Lake Electric  . jjLv' Power to bring you the best.  At  1  aayfra jafVgXj LaaiijffKii  aahaajJkajNB  1  r  I  r  i  I  1  4'  iir wTia.vy.ff.,n,;,f  \"?etfi!H 40i", "parent": 22658299, "version": 1739894706700025856}, {"id": 22658305, "paper": "Vernal Express", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/3f/1a/3f1a2226f0f673ad3d4b3463704175ed939d0258.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/f3/bd/f3bdb4723ee6dd70454cf68341add175e449fe18.pdf", "page": 6, "ocr": "6 Vernal Express  I!  : c  K BUC HIRING  A public hearing of the  Venial City Planning  Commission has hern  scheduled fi Strptemrw  II, 2X)1 at 7:00 pm. to  consider tequesl of  Vernal City to vacate 150  North Sirert fnm 1100  West, east to the school  tlistiKt property. The  public heai in; will be  hcUl ib the Vernal City  Council chambers, 447  La4 Main, Vernal, Ctah.  Property owner and  other interested persons  are uryed to attend.  Iter, a public heainig  ol the Vernal City  Council will be hclJ  September IV. 2001 at  7: M) p.m. to tttnsiikt Uie  filial recommendation ol  the Vernal City Planning  Commission regarding  the above street vacation  request The public hearing  hear-ing shall he held in the  Vernal City Council  chambers, 447 Kast Main,  Vernal. Utah, lor further  information, contact  Rush 11 IVarsin, Vemal  City offices. 447 Last  Main. 7X92255  during regular business  hours.  Anyone ibjcclmg to the  proposed street vacation  must file a written objection  objec-tion with Vemal City.  In compliance with the  Americans with  Disabilities Act, individuals  individu-als needing special  accommodations during  this meeting should notify  noti-fy Russell Pearson, 447  last Main, Vernal, Utah  at kast five days betire  the hearing at (435) 789-2255.  789-2255. Published in the Vernal  Express August 22, 2V,  S-pt. 5 and 12, 2001.  PUBLIC H LA RINK  A public hearing of the  Vernal City Planning  Commission has been  scheduled for September  II. 2001 at 7:00 p.m. to  consider a request of  Vemal City t: vacate a  portion of 300 Niirth  Street from Vemal  Avenue west to I(X) West.  The public hearing will  be held in the Vemal City  Council chambers, 447  East Main. Vemal, Huh.  Property owner . and  other interested persons  are urged to attend.  Later, a public hearing  of the Vemal City  Council will be held  September 19, 2001 at  7:30 p.m. to consider the  final recommendation of  the Vernal City Planning  Commission regarding  the above street vacation  request. The public hearing  hear-ing shall be held in the  Vernal City Council  chambers, 447 East Main,  Vemal. Utah. For further  information, contact  Russell Pearson, Vemal  City offices, 447 East  Main. (435) 789-2255  during regular business  hours.  Anyone objecting to the  proposed street vacation  must file a written objection  objec-tion with Vernal City.  In compliance with the  Americans with  Disabilities Act. individuals  individu-als needing special  accommodations during  this meeting should notify  noti-fy Russell Pearson. 447  East Main. Vernal, Utah  at least five days before  the healing at (435) 789-2255.  789-2255. Published in the Vemal  Express August 22. 29  and Sept. 5 and 12. 2001.  PUBLIC NOTICE  The Uintah County  Board of Adjustments  will be considering the  following request:  James and Lace Honert  A variance to construct  a residence on a parcel of  land that does not have  the required 10 acres. It  contains 5 and is in the  Recreation. Farming and  Mining Zone. It is located  El2, SE14. SEI4. SE  14, section 12.T3S. R20  E. SLM. Taylor  Mountain, Uintah  County, Utah.  Appeals can be mailed  to Uintah County.  Building, Planning &  Zoning. 152 East 100  North, Vemal, UT 84078.  The Board of  Adjustments will meet on  Wednesday, September  19,2001 at 12:00 p.m. in  the Commission  Chambers located on the  2nd floor of the State and  County building at 152  East 100 North, Vernal,  Utah, to discuss the variance.  vari-ance. - For more information,  please contact Dale  Peterson, Zoning  Administrator at 781-5336,  781-5336, during regular  business hours.  Published in the Vernal  Express Sept 12,2001.  Wednesday, September  NOTICE TO  WATER USERS  The State Engineer  received the following  Applications) to  Appropnate or Change  Water (Locations in  SLB&M unless otherwise  designated.)  Persons objecting to an  application must file a  CLEARLY READABLE  protest stating FILING  NUMBER. REASONS  FOR OBJECTION.  PROTESTANTS' NAME  AND RETURN  ADDRESS, and any  request for a bearing.  Protest must be filed with  the State Engineer, Bos  146300. Salt Lake City.  UT 84114 6300 (801-538-7240)  on or before  October 2. 2001. These  are informal proceedings  as per Rule R655 6-2 of  the Division of Water  Kichu.  (LEGEND: Pointis) of  Diversion POD. Place  of Use POU. Nature of  Use USE)  UINTAH COUNTY  APPLICATIONS) TO  APPROPRIATE WATER  45-5908 (A73605):  Marlene Wilhelm  QUANTITY: 2.0 ac ft.  SOURCE: 6 in. well Oft.  to 50 ft. deep. POD:(l)S  1063 E 550 from W 14  Cor. Sec 22. T4S. R2IE.  (Vernal) USE: Irrigation:  from Apr I to Oct 31.  total acreage 0.5000 acs.  POU: NW 14 SWI4 Sec  22.T4S. R2IE.  APPLICATIONS) TO  CHANGE WATT  45-5549 (a25917):  William Pteston and  Brenda Joanne Durant  proposes to correct the  POD A USE of w ater as  evidenced by 45 5549  (A65056).  HERETOFORE:  QUANTITY: 0.015 cfs.  SOURCE: 6 in. well 60  ft. deep POD: ( 1 ) S 1756  W 840 from NE Cor. Sec  16. T3S, R20 E USE:  Iirigation: from Apr I to  Oct 31, total acreage  0.2500 acs;  Stockwatering: 100 head  of livestock; Domestic: I  family. POU:  SEl4NEI4Sccl6.T3S,  R20E.  HEREAFTER. QUANTITY:  QUAN-TITY: 425 ac-ft.  SaC5& 6 in. ell 60  fL?p!POI'i)S 1922  W VfVrotn NE Cor. Sec  16, T3S. R20E. (Dry  Fork) USE: Irrigation:  from Apr 1 to Oct 31.  total acreage 0 8100 acs,  stile supply 0.8100 acs;  Siockwatering: 20 head  of livestock; Domestic: I  family. POU: Same as  Heretofore.  ROBERT L.  MORGAN, RE,  State Engineer  Published in the Vemal  Express Sept. 5 and 12,  200!.  NOTICE TO WATER  USERS  The State Engineer  received the following  Application(s) to  Appropriate or Change  Water (Locations in  SLB&M unless otherwise  designated.)  Persons objecting to an  application must file a  CLEARLY READABLE  protest stating FILING  NUMBER. REASONS  FOR OBJECTION.  PROTESTANTS' NAME  AND RETURN  ADDRESS, and any  request for a hearing.  Protest must be filed with  the State Engineer, Box  146300, Salt Lake City,  UT 84114-6300 (801-538-7240)  on or before  October S. 2001. These  are informal proceedings  as per Rule R655-6-2 of  the Division of Water  Rights.  (LEGEND: Point(s) of  Diversion POD; Place  of Use POU; Nature of  Use USE)  UINTAH COUNTY  45-25ll(a25928):  Steven R. Pierson proposes  pro-poses to correct the POD  of water as evidenced by  45-2511 (A235 II).  HERETOFORE:  QUANTITY: 3.05 cfs.  SOURCE: Green River.  POD:(l)S 1630 W 440  from NE Cor, Sec 21,  T6S. R21E. USE:  Irrigation: from Apr 1 to  Oct 31, total acreage  82.2000 acs. POU:  EI2SE14 - SEC 20;  SE14NE14,  S I2SWI4,  N W 1 4 S W I 4 ,  N12SE14 SEC 21, T6S,  R21E.  HEREAFTER; QUANTITY:  QUAN-TITY: 3.05 cfs.  SOURCE: Green River.  POD:(l)N 1100 W 200  from Sl4 Cor, Sec 21,  T7S, R21E. (8 miles NE  of Randlett) USE: Same  as Heretofore. POU:  Same as Heretofore.  ROBERT L,  MORGAN, P.EL-,  State Engineer  Published in the Vemal  Express Sept 12 and 19.  2001.  12, 2001 .  . - 7  NOTICE OF  TRUSTEE'S SALE  On October 3. 2001. at  10:00 am. at the frvmt  door of the Uintah  County Courthouse in  Vernal, Utah, Basin Land  Title & Abstract, Inc.. as  Successor Trustee, .will  sell at public auction to  the highest bidder for  cash, ail payable at the  time of sale, the following  follow-ing described property  located in Uintah County,  Utah:  Beginning at the  Southeast corner of Lot 2.  FREESTONE ADDITION  ADDI-TION NO. 3 to Vernal  City; thence West along  the lot line 99 feet; thence  Nwth along the Division  line between Lot 2 and  Lu I - NX) feet; thence  East parallel to the East-West  East-West lot line 99 feet;  thence South 100 feet to  the point ol beginning.  Being a part of the  Northeast quarter of the  Northeast quarter of  Section 22. Township 4  South, Range 21 East.  Salt Lake Base and  Meridian. (702 West 300  North, Vemal. Utah  k 84078)  The sale will be made  without covenant or warranty  war-ranty regarding title, possession,  pos-session, or encumbrance,  to satisfy the obligation  secured by, and pursuant  to the power of sale cm-tained  cm-tained in that certain  Deed of Trust executed  by Norman B. Winter and  Rohyn Winters, as  Trustors, to the United  States of America, acting  through the Farmers  Home Administration,  United States Department  of Agriculture, as Trustee,  for the Benefit and security  secu-rity of the United States  of America, Beneficiary,  dated July 13. 1989. and  recorded July 14. 1989. in  Book 470. page 224.  Official Records of  Uintah Counly.  Notice of Default and  Election to Sell said real  property was recorded in  said Official Records on  September I. 2000, in  Book 738, page 224.  Dated this 10th day of  September, 2001.  Basin Land Title &  Abstract, Inc.,  JOYCE GARDINER,  Office Manager  Published in the Vemal  Express Sept. 12, 19 and  26, 2001.  PUBLIC HEARING  The Uintah County  Planning Commission  has scheduled a public  hearing to review a  Conditional Use Permit  issued to Daughn Morrell  to operate a furniture production  pro-duction operation at 930  North 1450 West, Vernal  in an  ResidentialAgricultural  (RA-I) zone. The meeting  meet-ing will be held on  August 15, 2001 at 7:00  p.m.  The meeting will be  held in the Commission  Chambers. StateCounty  Building. 152 East 100  North, Vemal. Property  owners and other interested  interest-ed persons are urged to  attend. Further information  informa-tion can be obtained by  contacting the Planning  Office at 781-5336.  Published in the Vemal  Express Sept. 12, 2001.  PUBLIC HEARING  The Uintah County  Planning Commission  has scheduled a public  hearing to review a  Conditional Use Permit  issued to 4 The Youth to  operate a Home to provide  pro-vide a Therapeutic structured  struc-tured living environment  for youth, located at 3013  East 7750 South, Myton  in an Agricultural (A-l)  zone. Tne meeting will be  held on September 19,  2001, at 7:00 p.m.  The meeting will be  held in the Commission  Chambers, StateCounty  Building. 152 East 100  North. Vemal. Property  owners and other interested  interest-ed persons are urged to  attend. Further information  informa-tion can be obtained by  contacting the Planning  Office at 781-5336.  Published in the Vernal  Express Sept 12,2001.  NOTICE TO  CREDITORS  Estate of Louise  Wright, deceased.  All persons having  claims against the above  estate are required to present  pre-sent them to the undersigned  under-signed by Oct 15, 2001,  or said claims shall be  forever barred.  Ralph Wright  1536 La Mesa Circle  Rangely, ' Colorado  81648  Published in the Vemal  Express Sept 5, 12 and  19. 2001,  NOTICE Ol  TRUSTEE'S SALE  The following  described property w ill  be sold at pubis; auction  to the highest bidder,  payable in lawful money  of the United States, at  the main entrance of the  Uintah County  Courthouse at 147 E.  Main. Vemal. UT 84078  on September 25, 2001 at  12:30 pm. fur the purpose  pur-pose of foreclosing a  Trust Deed dated  October 16. 2000 in  favor of BNC Mortgage,  live., as Beneficiary, covering  cov-ering the following real  property located in UINTAH  UIN-TAH COUNTY. State of  Utah:  Beginning 400 feet  North of the Southwest  corner Northwest quarter  Southwest quarter  Section 21, Township 5  South, Range 23 East,  Sal Lake Meridian;  thence North 103 feet;  thence East 188 feet;  thence South 103 feet;  thence West 188 feet to  the beginning.  Parcel No. 06-108-5-0008  The address if the  property is purported to  be 6167 South 9500 East.  Jensen, UT 84035. The  undersigned disclaims  liability for any emir in  the address. The present  owner is reported to be  Virginia K. Patton and  MicheleP.O'Shayne.  Bidders must he prepared  pre-pared to tender to the  trustee $5,XK).0O at the  sale and the balance of  the purchase price by  10:00 a.m. tlie day following  fol-lowing the sale. Both  payments must be in the  form of a cashier's  check. Cash is not  acceptable.  NOTICE IS HEREBY  GIVEN THAT THIS  FIRM IS ATTEMPTING  TO COLLECT A DEBT  AND ANY INFORMATION  INFORMA-TION OBTAINED  WILL BE USED FOR  THAT PURPOSE. IF  YOUR CALL IS  ANSWERED BY  VOICE MAIL PLEASE  LEAVE A MESSAGE  AND WE WILL  RETURN YOUR CALL  NO LATER THAN THE  NEXT BUSINESS DAY.  DATED: August 27,  2001  STUART T.  MATHESON,  Successor Trustee  648 East First South  Salt Lake City, Utah  84102  (801)363-2244  Published in the Vemal  Express August 29. and  Sept. 5 and 12.2001.  NOTICE TO WATER  USERS  The State Engineer  received the following  Application(s) to  Appropriate or Change  Water (Locations in  SLB&M unless otherwise  designated.)  Persons objecting to an  application must file a  CLEARLY READABLE  protest stating FILING  NUMBER. REASONS  FOR OBJECTION.  PROTESTANTS' NAME  AND RETURN  ADDRESS, and any  request for a hearing.  ' Protest must be filed With  the State Engineer, Bex  146300. Salt Lake City,  UT 84114-6300 (801-538-7240)  on or before  October 2, 2001. These  are informal proceedings  as per Rule R655-6-2 of  the Division of Water  Rights.  (LEGEND: Point(s) of  Diversion POD. Place  of Use POU; Nature of  Use USE)  UINTAH COUNTY  49-1401 (A29l05a):  Wembco Incorporated  QUANTITY: 2.0 cfs.  SOURCE: Green River.  POD: (1)S 2125 E 2150  from NW Cor, Sec 7,  T6S. R22E. USE:  Industrial: Mining and  milling operations and  related uses on properties.  proper-ties. -Applicant requests  extension to complete  construction of additional  facilities and water works  which will put water to  full beneficial use.  ROBERT L.  MORGAN, P.E,  State Engineer  Published in the Vemal  Express Sept. 5 and 12,  2001.  NOTICE OF PUBLIC  MEETING  Notice is hereby given  that the Board of Trustees  of the Uintah Water  Conservancy District will  hold the Regular Monthly  Board Meeting of the  District at 10:00 a.m. On  Tuesday. September 18,  2001, at the District  Office, 78 West 3325  North, Vemal, Utah.  Published in the Vernal  Express Sept 12, 2001.  NOTICE TO  CREDITORS  Estate of Inez W.  Kettle, Deceased  Probate No. C138OO032  Notice is hereby gives  that Lvk KeoJe. has beea  appointed Personal  Representative of the  above estate.  All persons having  claims agaiast the above  estate are required to prevent  pre-vent them to the undersigned  under-signed or to the Cierk of  the Court within three (3)  months after the dale of  the first publication of  this notice or said claims  shall be forever barred.  Dick Kettle  RT 3 BOX 3310  Myton. Utah 84052  Published in the Vemal  Express Sept 12, 19 and  26,2001.  NOTICE OF  TRUSTEE'S SALE .  The following  described property will  be sold at public auction  to the highest bidder,  payable in lawful money  of the United States, at  the South Main Entrance.  Uintah County  Courthouse. 147 East  Main, Vernal, Utah, on  October 4, 2001, at 11:00  a m., of said day, for the  purpose of foreclosing a  trust deed originally executed  exe-cuted on February 14,  2000 by Joseph J.  Renwick and Christy A.  Renwick, as trustors, in  favor of BNC Mortgage,  Inc., coveting the following  follow-ing real property purported  purport-ed to be located in Uintah  County at 244 Last 700  North, Vemal, UT 84078  (the ' undersigned disclaims  dis-claims liability for any  error in the address), and  more particularly  described as:  Lot 13, PINE MEADOWS  MEAD-OWS MOBILE HOME  COMMUNITY AND  PUD, according to the  official plat thereof on  file in the office of the  Recorder, Uintah County,  Utah. TOGETHER with  a 1.1 interest in the  common areas.  Together with all the  improvements now or  hereafter erected on the  property, and all easements,  ease-ments, appurtenances,  and fixtures now or hereafter  here-after a part of the property  proper-ty The current beneficiary  of the trust deed is First  Union National Bank, as  Trustee and the record  owners of the property as  of the recording of the -  notice of default are  Joseph J. Renwick  Christy A. Renwick.  and  Bidders must tender to  the trustee a $5,000.00  deposit at the sale and the  balance of the purchase  price by 12:00 noon the  day following the sale.  Both the deposit and the  balance must be in the  form of a wire transfer,  cashier's check or certified  certi-fied funds payable to  Lundberg & Associates.  Cash payments are not  accepted.  DATED: August 29.  2001.  SCOTT LUNDBERG,  Trustee  (801)263-3400  LACaseNo. 18680  Team AMLE  THIS COMMUNICATION  COMMUNICA-TION IS AN ATTEMPT  TO COLLECT A DEBT,  AND ANY INFORMATION  INFORMA-TION OBTAINED  WILL BE USED FOR  THAT PURPOSE.  Published in the Vemal  Express Sept 5, 12 and  19, 2001.  PUBLIC HEARING  The Uintah County  Planning Commission  has scheduled a public  hearing to consider a  request for a Re-Zone of  a property by Stacy  Galley from a R-2 zone  to a C-2 zone located at  1927 West Hwy 40,  Vemal. The meeting will  be he'd on September 19,  2001 at 7:00 p.m.  The meeting will be  held in the Commission  Chambers, StateCountv  Building, 152 East 100  Deadlines for  publication  in the  Vernal Express  are:  News Articles  Monday 12 noon  Public  Notices  Monday 3 p.m.  Advertising  Monday 5 p.m.  Norsh, VernaL Property  owners and other interested  inter-ested persoss are urged to  acead. Farther informa-uoa  informa-uoa can be outlined by  contacting the Planning  Office at 781-5336.  Published m the Vernal  Express Sept 5 and 12.  2001.  SUMMONS  Case No. 014800234  Judge: Payne  IN THE EIGHTH  JUDICIAL DISTRICT  COURT OF UINTAH  COUNTY, STATE OF  UTAH  Michelle L. Keller,  Peoaooer,  vs. Wyatt Pmsenbarger.  Respondent  THE STATE OF UTAH  TO THE ABOVE-NAMED  ABOVE-NAMED RESPONDENT:  RESPON-DENT: You are hereby summoned  sum-moned and required to  file as Answer in writing  to the attached Petition  with the Clerk of the  above entitled Court at  the following address:  219 W. 650 N.. Vernal.  Utah 84078 .  and to service upon, or  mail to the petitioner at  the address above, a copy  of said answer, within 20  days if you are served in  the State of Utah, or  within 30 days if you are  served outside the State  of Utah, after service of  this Summons upon you.  If you fail to do so judgment  judg-ment by default will be  taken against you for the  relief demanded in said  Petition, which has been  filed with the Clerk of the  above-entitled Court and  a copy of which is hereto  annexed and herewith  served upon you. READ  THESE PAPERS CAREFULLY.  CARE-FULLY. These papers  mean that you are being  sued for divorce.  DATED this 29 day of  August. 2001.  MICHELLE L.  KELLER,  Petitioner  Published in the Vernal  Express Sept 12, 19, 26  and Oct 3. 2001.  PUBLIC HEARING  The Uintah County  Planning Commission  has scheduled a public  hearing to consider a  request for a Conditional  Use Permit by Lorin W.  & Joyce Wood to operate  a Transitional Boarding  School, to be located at  14403 North 5250 East  Whrterocks r 4m\"M  Agricultural (A-l) zone.  The meeting j3 be held  on September 19t 2001.  at 7:00 p.m.  The meeting will be  held in the Commission  Chambers, StateCounty  Building. 152 East 100  North, Vernal. Property  owners and other interested  inter-ested persons are urged to  attend. Further information  informa-tion can be obtained by  contacting the Planning  Office at 781-5336.  Published in the Vernal  Express Sept. 12, 2001.  NOTICE OF  ELECTION  Notice is hereby given  by Jensen Water  Improvement District  that an election will be  held on November 6,  2001 for the purpose of  electing two board members  mem-bers to the Board of  Trustees of the District  Voting will take place at  the District Office located  locat-ed at 5950 South 8500  East Jensen, Ut  All qualified registered  voters residing within the '  boundaries of the Jensen  District are entitled to  vote. Even though the  deadline for filing was  Aug. 15, any persons  interested may file a  write-in declaration of  candidacy with the  District Clerk by Oct 23,  2001 by 3:30 RM.-The  Trustees elected will  serve a four-year term.  MARJEAN MURRAY,  District Clerk  Published in the Vernal  Express Sept 12 and 19,  2001.  Vets attend  picnic  By Virginia Harrington,  Feature Writer  Roy James and American Legion  Post 124 hosted the annual All-Veteran's  All-Veteran's Picnic in the park in  Jensen on Saturday, Sept. 8.  James said the purpose of the  picnic is to bring all local veterans  together under one roof for a good  time, good food and great companionship.  compan-ionship. He emphasized that in  spite of belonging to several different  differ-ent organizations, such as DAV  and VFW. they all served in the  U S. military at some point in their  lives and share many things in  common w ith each other.  The women's auxiliary of the  American Legion provided salads,  baked beans, breads and deserts  while the men cooked corn and  grilled chicken. Dorothy Evans,  current president of the auxiliary,  said there is a great sense of family  among the veterans and their  spouses. \"You make so many great  friends in the military,\" she said,  \"and this annual picnic gives us a  chance to get together for an afternoon.\"  after-noon.\" Mr. and Mrs. Jim Barth, and their  Itttle Dachshund who also attended,  attend-ed, agreed that many friends made  during a military tour become  friends for life, sharing values and  goals.  Entertainment was provided by  Preston Smith and Lyle Harlow,  who refer to themselves as \"Kindly\"  Country\" singing country songs to  the accompaniment of their guitars.  Harlow also acted as auctioneer,  auctioning off the leftover food to  raise enough money to offset the  cost of the picnic. Harlow was so  successful that he even auctioned  off a $20 bill for $24.  Three teachers join  Discovery Elementary  Cudrun Parr. Amy Struthers, and  Tammy Christensen have been  hired to complete the staff at  Discovery Elementary this school  year.  Mrs. Parr, who has lived in Vernal  for over five years, is originally  from Sandy. She has also lived in  California as well as the Salt Lake  City area She has a degree from  BYU and is completing another  bachelor's degree through Utah  State University. She and her husband,  hus-band, Ron, have five children. Mrs.  Parr - did her practicum for  Elementary Education at Discovery  Elementary. She said she is  impressed with how wonderful and  helpful the other teachers are and  what a great class she has.  Tammy Christensen is originally  from Tremonton and has lived in  FinditinUtah to  local business  Governor Mike Leavitt today  announced . the launch of  FinditinUtah, a dynamic on-line  resource that promotes Utah businesses.  busi-nesses. The service allows local  communities and businesses to better  bet-ter position themselves to compete  in the new economy, strengthens  municipalities' ability to keep tax  dollars in the state, and helps consumers  con-sumers locate Utah products and  services.  \"FinditinUtah is a public-private  partnership that can help every  Utah business have an on-line presence,  pres-ence, ultimately boosting their bottom  bot-tom line,\" said Leavitt \"Soon,  rather than buying goods over the  Internet from companies around the  world, Utahns will be able to use  FinditinUtah to find goods and services  ser-vices offered exclusively by busi-  nesses right here in our communities.\"  communi-ties.\" FinditinUtah was developed  under the direction of Utah's i  Department of Community and  Economic Development (DCED).  \"Internet commerce is here to stay,\"  said David Winder, Executive  Director of DCED. \"Companies  that fail to take advantage of marketing  mar-keting opportunities offered  through the Web are simply giving  away a share of their market  FinditinUtah offers a cost effective  tool to help companies maintain  their local market share and expand  their business through exposure to  thousands of potential iiew customers.\"  cus-tomers.\" The FinditinUtah portal  was developed through a contract  with Novell and subcontractors NIC  and Digital Signature Trust  The FinditinUtah service is sup-  . ported by a powerful search engine  that directs consumers to local  providers, and never leads a con-  . sumer out-of state. The interface  allows the user to locate goods and  in Jensen  annual  - : sr..---  UL\"\" \" -  Roy James  James announced that Jean  Stanton, a good friend to the veterans  veter-ans in the area and a veteran herself,  her-self, is recovering nicely at her  daughter's home in Salt Lake City  following surgery in Roosevelt, an  airlift to the V.A. Hospital and 1 1  units of blood. This was good news  to all and was met with cheers.  James said the only disappointment  disappoint-ment during this year's picnic was  the weather. It was a bit cooler  than normal for Sept so next year  he plans on moving the picnic back  to August as in years past  James also announced that the  American Legion District Meeting  will be held Oct 5 in Legion Hall  in Jensen. Social hour will be 6-7  p.m., dinner will be a 7 p.m. and  the meeting will take place after  dinner. This is for not only Post  124, but for all American Legion  Posts in the district  Vemal for three years. She has also  lived in Altamont, Nev., and Idaho.  She graduated from Utah State  University and taught at Todd  Elementary last year. She had previous  previ-ous experience in substituting in  Nevada and in Vernal.  Mrs.. Christensen and her husband,  hus-band, Vincent, have five children.  She said that so far she loves it at  Discovery Elementary and has the  best class here.  Amy Struthers taught at Lapoint  Elementary last year. She also graduated  grad-uated from Utah State University.  Mrs. Struthers and her husband,  Kevin, have five children and have  lived in Vernal for six years. She is  originally from the Salt Lake City  area. She ' said she loves it at  Discovery and is so happy to be  here.  promote  on - line  services by utilizing a variety of  search techniques (business name,  keywords, industry category, SIC or  NAIC codes). More than online yellow  yel-low pages, FinditinUtah can represent  repre-sent any community, association or  organization in the state. For example,  exam-ple, a consumer might access the  service while visiting the state portal  por-tal (www.utah.gov) or their hometown  home-town website (www.findnin  provo.com) or while working with  their favorite association like the  Provo Chamber of Commerce  www.thechamber.org.  FinditinUtah can be utilized to  promote the entire state or be very  specific and only return results for a  selected community or association.  Provo City is an excellent example  exam-ple of how a local community will  benefit from FinditinUtah. All  Wrapped Up in Riverwoods (a  rirtinProvo pilot business) plans  to take advantage of this service to  attract new customers. \"When  searching for better ways to promote  pro-mote our business, FinditinUtah  and FinditinProvo stood out as a  way to reach new customers and  attract them to our store without  breaking the marketing budget,\"  said Mark Neves, owner of All  Wrapped Up.  \"We were looking for a way to be  competitive as more consumers use  the Internet to gather information  before they make their purchase  .decision,\" said Ron Fakler,.  Manager of Commercial Tire Sales  and Service at Fakler Tires in  Provo.  \"My hat is off to the creators of  this system - it is very easy to use,\"  said Christina Lauritzen, Hospital  Director at Riverwoods Pet  Hospital in Provo.  For more information about  FinditinUtah visit www.finditinu-.tah.compress.", "parent": 22658299, "version": 1739895031392632835}, {"id": 22658306, "paper": "Vernal Express", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/2f/44/2f44c7a2088574c7871d952f340edf10754f665c.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/5b/20/5b20dd2fd55f62f9bcf59760a3abb2ae5465110c.pdf", "page": 7, "ocr": "Vernal Express Wednesday, September 12, 2001  .... \" . i - ?  \" ' ...\"  . . - - ; . -  . . \"  .::--. ,S- j 1  - i '  :W 1 If I  11 v &i  Fi - J fan i  Mark Elder paddles through northern Minnesota in solo canoe  Canoe camp is set up on Lac LaCroix.  Elder to be first in  Winter Program series  On Thursday, Sept. 13, the Uintah  Mountain Club will begin its Winter  Program series, at 7 p.m. at the  Golden Age Center.  The first speaker is Tom Elder,  who w ill present a slide program on  the Boundary Waters Canoe Area  Wilderness, in northern Minnesota.  One million acres of piney, lake-studded  lake-studded woods was set aside  decades ago for the enjoyment of  the people. Tom was with a party  I -  ' - A\" :'  . -  AVMC engineer Randy Gray  was 'King for a Da during the  month of August.  Gray named  'King for a  day'  Randy Gray, engineer, was named  as Ashley Valley Medical Center's  \"King for a Day\" for the month of  August Gray has been an employee  of AVMC for over nine months and  is a member of the engineering  staff.  \"I like working at AVMC,\" stated  Gray. \"It's nice to work with people  that you like and get along with, if  makes the day go quickly and the  work environment more pleasant.\"  Gray joined the AVMC crew in  January of 2001 after retiring from  CIG, where he worked for 22 years.  The \"King for a Day\" program  was started in March of 2001 as a  way to recognize employees who  go the extra mile in providing cus-tomer  cus-tomer sen ice to the patients and  customers at AVMC. Gray was  nominated by another staff member  who cited seven incidents of customer  cus-tomer service. Gray was observed  helping an older woman pick up  papers she had dropped, assisting  more than one patient who could  not find the department they were  looking for and lending a hand to a  patient who desperately needed a  wheelchair.  \"Randy exhibits both the behaviors  behav-iors and attitude that we hope to  reward with this program,\" said Si  Hutt, CEO at AVMC. \"Customer  service is about anticipating patient  and visitor needs and working to  meet tiiose needs. It is important  mat patients who come to Ashley  Valley Medical Center not only  have an excellent clinical outcome,  but also a positive experience with  our staff.\"  - Gray will receive a monetary  reward for being \"King for a Day  and will be recognized at the annual  hospital Christmas partly along with  the other nominated candidates for  the year. \"  that journeyed for a week into this  watery wilderness. Hoisting  canoes, they portaged from lake to  beautiful lake, passing beautiful  waterfalls to camp on granite  shores. The land seems untouched,  the same wilderness that French fur  traders traveled centuries ago.  The public is invited at no charge.  Grandchildren  have feast at  Beehive Home  By Virginia Harrington  Feature Writer  Sunday was Grandparents Day  across the nation and the residents  of Beehive Home celebrated early  with a special dinner on Saturday,  Sept 8. Children, grandchildren,  nieces, nephews and a variety of  spouses visited for an evening of  good food, lots of conversation, a  talent show and even a watermelon  seed spitting contest  More than SO people gathered on  the lawn in front of the home to  dine on home grown vegetables,  roast beef sandwiches and plenty of  deserts. With plates piled high, families  fam-ilies gathered around long tables to  catch up on the latest news and to  share some high quality time 'with  their favorite senior citizens.  When everyone was full to the  brim and had no room for even one  more cookie, the talent portion of  the evening began. Such a variety of  talents has rarely been gathered in  one spot before! There were crocheted  cro-cheted vests, weaving, drawings,  poetry thought for the day recitals, a  puppet, two singers, two doggers,  two very talented employees who  sang \"Happy Birthday\" backwards  well, they turned their backs to the  audience, anyway and a real show  stopper cake decorating by a died-in-  the- wool practical joker.  (Anyone wishing to know how to  make a water balloon look like a  birthday cake waiting to be cut just  ask the Beehive residents. They  learned how.)  Dennis Green proved he had the  best spiting ability by winning the  men's watermelon seed spitting  contest and by spitting farther than  Beehive residents Sarah Foster. Fem Daniels. Betty Brothers, Rae Stewart, Sarah Myers and Mildred  Jones rest up after a big night with the grandchildren.  anyone else. Michelle Valdez, a visitor  vis-itor from Colorado, won for the  women and April Merrick won for  the kids. Before the contest began,  participants were guaranteed a prize  to match TV game shows should  they win. Green won a truck complete  com-plete with tools while Valdez and  Merrick each won a car. The happy  winners put their vehicles in their  pockets before kissing Grandma  goodnight and promising to return  soon.  As the visitors were leaving they  were reminded, \"You don't have to  wait for Grandparents day to visit  again!\" There are plenty of reasons  to visit during the week of Sept 9-15,  9-15, which is National Assisted  Living Week. Monday, Sept. 10 featured  fea-tured the Flake Family from 1-3  p.m. and the Barber Shop Quartet,  Intoneations, at 6:30 p.m. Tuesday  was trusts and wills from 1-3 p.m.  the the Kevin Dickson family dog,  Mowgli, who played \"Toto\" in last  springs musical presentation of the  Wizard of Oz.\" entertained at 6:30.  Today, Wed. Sept 12 will be emo-  ' - . - , - V  - '  & O J  Three members of the lour plus one' barbershop quartet, the  'Intonations,' performed several classic barbershop songs for  Assisted Living Week, including 'I Love You Toil and 'Down By the  Riverside. They are Mickey Wells, Laura S. Foley and Fay Howells.  tional well-being from 1-3 p.m. and  \"Laughter Night\" at 6:30 p.m.  Thursday's presentations will be  meditation from 1-3 p.m. and the  Wilson family at 6:30 p.m. Friday,  Sept. 15 will feature hand therapy  from 1-3 p.m. and a big surprise at  6:30 p.m. Anyone in the community  may take part, free of charge, with  or without a family member living  in Beehive Home.  MM  mm  O '  O If you signed a petition thinking it was to  study a change in government think again!  The deal has been done. The proposed  councilmanager form of government is on  the ballot  O The 7 part time council members meet  twice a month. You vote for 3. The single  manager will make 90 of the day to day  decisions  O Studies have shown that costs and taxes  go up with this form of government  IT  in  LIU  LJJ Ul  urn  Paid Political Ad", "parent": 22658299, "version": 1739886012478259200}, {"id": 22658307, "paper": "Vernal Express", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/97/26/9726ab9423c75c39e487fc100cc026681ac4dc9a.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/54/89/5489ea351460d02275653f501cafa7da0138241d.pdf", "page": 8, "ocr": "8  Vernal Express Wednesday, September 12,2001  CLASSIFIED AD  RATES AND  INFORMATION  RATES:  2St per word (5c per  word extra tor black type)  $5 minimum, cash in  stance. $1 extra charge  DEADLINE:  Monday, 5 p m.  ERRORS:  please read your ad and  ca! us immediately r!  there are errors. We wil!  cheerfuffy make any corrections  cor-rections necessary  However, we cannot be  held responsible tor any  errors that continue after  the first pubbcation.  PHONE  (435) 789-3511  FAX  (435) 789-783-6690  OFFICE HOURS:  8 a.m. to 5 p m. Monday  through Friday  Closed Saturday  PUBLISHER'S NOTICE  Al real estate advertised in  trm paper a subject to the  Federal Fair Housing Act of  1968 wruch make I illegal to  advertise \"any preference,  iimitaton, or discrimination  bas9d on on race, rotor, religion,  reli-gion, sen, or ration origin.  or any mention to mike any  such preference, kmriation or  dracrimtnation.\"  This newspaper will not  knowingly accepi any sdver  Using tor real estate which is  n vtoiatton ol the law Our  readers are informed that all  dwefcngs advertised in this  paper are available on the  equal opportunity basa.  LOOKING FOR  tambi. 789-1060.  feeder  run  PET SHOP. We have  birds, fish and furry critters.  crit-ters. Dog's boarding, training,  train-ing, grooming. Kep's. 1678  N, Verne!, 781-1390.  ADOPT A friend for Me!  Uintah Animal Care has  the perfect pet for you!  Call 781-1813 or see pictures  pic-tures at  wwwuintahpets.org  FOR SALE: $30. Black  and choc, tab puppies.  First shots, dew claws  removed. 789 2369  PUREBRED PIT BULL  puppies. 5 left. I wiH be in  Vernal the 29th of Sept  (90)216-3331 or  (970)858-7897.  REWARD. Lost small  blond dog. Missing two  bottom teeth. His name is  Muffin. 789-3193, 789-3494.  789-3494. PASTURE FOR RENT.  Naples. 789-1060.  HORSE AUCTION:  ANDREASEN Diamond A  Ouartar Horse Production  Sale, Saturday, September  15, 1 p.m. Box Elder  County Fair grounds,  Tremonton, Utah. Featuring  Featur-ing 2001 foal crop, mares,  geldings, wfh color and  breeding galore. 1-435-286-2281  Bus.  Opp.  UTAH STATE UNIVERSITY  UNIVERSI-TY SmaS Business Development  Devel-opment Center offers seminars  sem-inars and free business  counseling and statafed  eial procurement assistance.  assis-tance. CS 789-6100.  THEME PARTY IN a box.  DeSvared to your doorl Al  occasions - al ages. Free  catalog. We're expandingwork  expand-ingwork from home. 1-877-900-6502.  www.the-mepartyusa  www.the-mepartyusa com.  Animals  Lis  I ite(.to I  I NEED an Investor. I'm  having a nam or character  char-acter trademarked for  movie, books, ale Than  rm having an agancy go  on-line and have bidding  start al 11,000,00a To  finance this venture I  want to eeft up to 10 of  everything I make for  $2500 for each percent  If this idea sells for  $3,000,000 you wW  receive $30,000 for each  $2500 Invested New  phone number 781-0984  call Rick.  A M1M MARSNESTLE.  Established vending route.  Wil tea by 92401. Under  $9,000 minimum investment  invest-ment required. Excellent  monthly profit potential.  F nance available good  credit 1-800-637-7444  For  Rent  213 BEDROOM apartments.  apart-ments. Available Sept. 1.  789:8426 or 790-5801 .  CLEAN, THREE bedrooms,  bed-rooms, gas heat, major  appliances, wd and cable  TV hookups, storage and  carport. Close to town.  Rent starts $380 and up.  Sorry, No Pets. Senior citizen  citi-zen discount. Twin Cedar  Apartments, 769-8811.  789-4654.  23 BEDROOM apartment  apart-ment for rent Great locations.  loca-tions. $395 for 3 bedroom,  $350 for 2 bedroom. Call  789-7813.  ASPEN PARK APARTMENTS.  APART-MENTS. Large, beautiful,  2 and 3 bedroom apartments.  apart-ments. Quiet, excellent  location, ges heat, AC,  WD hookups, carports.  Senior citizen discount.  789-7341. 784)721 or  789-6875.  Rffiiiwmi  FOR RENT. 1600 sq. ft.  office space. 38 W. 100 N.  (formerly TriState Surveying)  Survey-ing) Available July 1.  $600mo. Phone 789-2888  days, 789-5263 evenings.  FOR RENT: Buiiding on  Main Street. 1500 sq. ft.  Great foot traffic. Prime  location. Contact John at  UT1 Internet 78 M725.  FOR RENT: 726 q. ft.  Main St. office space  (reception area, storage &  2 offices) $400month &  share of utilities. Cal 789-1352.  789-1352. FOR RENT: office space.  650 sq. ft. $350mo. 36 W.  100 N. Formerly Lenox  Insurance Agency. 789-  2888.  OFFICE SPACE or small  store for rent in Vernal.  Garage  Sales  CASH ONLY GARAGE,  YARD, MOVING SALES.  Deadline tor classified  advertising is 5 p.m. on  Mondays  2-FAMILY YARD SALE.  Furniture, wheel chair,  hospital bed, smal appliances,  appli-ances, complete household  house-hold items. 8-3, Thursday,  Friday and Saturday, 209  S. 500 W., across from  temp  Help  Wanted  THE ADVERTISEMENTS  appearing in this column  may or may not constitute  offers of employment Persons  Per-sons responding to these  advertisements- may be  required to pay fees in  advance for licensing, permits,  per-mits, dues, portfolios, registration,  reg-istration, processing or  other services. Opportunities  Opportuni-ties advertised in this column  col-umn may require Saining  at the expense of the  applicant No guarantee of  job ava&bUity, implied or  drsct m made by pubfish-rs.  BiHIfrWiflMil  DIRECTOR OF  ENGINEERING  SERVICES  UTE WATER  SETTLEMENTAJTE  TRIBAL ENTERPRISES  Directs the duties of the  engineering office within  Water Settlement and  UTE. Acts as an engineering  engineer-ing coordinator for al construction  con-struction projects, responsible  respon-sible for the coordination  and completion of  approval construction projects,  pro-jects, and oversees the  design, EPA and protect  approval, and budgets.  Acts as a general contractor  contrac-tor and Insures contractor  compliance and completion.  comple-tion. Acts as a procurement  procure-ment coordinator and  manages staff responsible  for the purchasing of raw  material for the Tribe.  Coordinates purchasing  and insures high quality,  low-cost vendor support  Organizes and coordinates  training and mentoring  programs for Tribal members.  mem-bers. Bachelor degree in  Construction Management,  Manage-ment, business management,  manage-ment, engineering, drafting,  draft-ing, or accountingeconomic  accountingeco-nomic prefened. Industry  experience will be carefully  weighed. Must qualify for a  Utah Contractors License.  Full time benefited position.  posi-tion. Send resume to UTE  Engineer Search Committee,  Commit-tee, PO. Box 520, Ft  Duchesne, Utah 84026 or  fax to 435-722-6810.  Published in the Vernal  Express August 29, Sept.  5 and 12. 2001.  EMPLOYMENT  OPPORTUNITY  UINTAH BASIN APPLIED  TECHNOLOGY  COLLEGE  1100 EAST LAGOON  (124-5)  ROOSEVELT UT 84066  The Uintah Basin  Applied Technology Center  is now taking applications  for a teaching position in  the Allied Health Department.  Depart-ment. QUALIFICATIONS:  Good background in medical  med-ical field with teaching  experience helpful. Areas  to be covered:  AnatomyPhysiology  Nursing Assistant  EMS  SALARY: Negotiable  OPEN UNTIL FILLED  For more information  and application form, call  (435)722-4523 br  (435)789-4886  AN EQUAL OPPORTUNITY  OPPORTU-NITY EMPLOYER  Published in the Vernal  Express Sept. 5 and 12,  2001.  EVERY CHILD  DESERVES A HOME!  Need loving, nurturing foster  fos-ter parents, (single, coupleteam)  cou-pleteam) For children of  all ages. Training available  avail-able Cal Wasatch Family  Services at 801-361-7204,  Mon.-Fri., 8:30 - 5:30.  ON-SITE APARTMENT  managermaintenance  person. Great for retired  couple. Send resume to  P.O. Box 1628, Vernal, or  cal 789-8811 for more  information.  ASK YOURSELF: Would  an extra $500-$ 1400 help  out this month? Would you  like to earn $50,000-  $100,000 a year, work  from your home. Set your  own hours? Vacations,  money, lifestyle! Cal 800-936-6222  or  www.wfhbiz.com.  100 WORKERS NEEDED.  Assemble craft, wood  items. Materials provided.  To $480 per week. Free  information package. 24  hrs. (801)264-5665. .  MATURE INDIVIDUAL  needed for  receptionist Tront office  personnel at orthodontic  office. Must be high energy,  ener-gy, dedicated, self-starter  and excellent with the public.  pub-lic. Basic computer skills  needed including Microsoft  office and Windows 98 or  above. Previous professional  profes-sional experience including  includ-ing dental, medical or  orthodontist office preferable  prefer-able but not required.  Hours vary but wifj include  after school until closing.  Please hand deliver  resumes to Dr. Wright's  office at 751 West. Hwy.  40.  ITTTi7gfiTr?ll  PATTERSON UTI ENERGY  ENER-GY INC- 1250 E. Hwy 40.  Vernal, UT 84078. Looking  tor experienced safety  man for Vernal area. Send  resume or tax to 435-789-7857.  Phone 435-789-7856.  .  PART-TIME, EXPERIENCED  EXPERI-ENCED merchandiser  needed. Must have reset  experience and be available  avail-able daytime hours Cal 1-888-609-4899,  leave number,  num-ber, area code and number  num-ber for ext J 12.  PTFT POSITIONS avaa-abte  avaa-abte at local 7 Eleven  stores. Great benefits  including medical, dental  and optical. Competitive  wages. Great work environment.  envi-ronment. To apply visit  your local store or cal 1-800-711  -JOBS. Must be  over 21 . EOE.  STRIDE  STRIDE  WELL  SERVICE  YARO MANAGER; Individual  Indi-vidual needed immediately  to manage the Wortand  yard. Must possess good  interpersonal communications  communica-tions skills. Minimum 3-5  years of management  experience in the wel service  ser-vice industry required. We  otter competitive salary  and safety bonus. -BENEFITS  AVAILABLE: Hearth.  Vision, Dental, Life Insurance,  Insur-ance, 401 (k), Paid Vacation,  Vaca-tion, Cafeteria Plan, Safety  Incentives, Uniforms,  AD&D, PPE. If interested  in applying contact: Teresa  Tere-sa Burnett, 580-548-5218,  P0 Box 3505,  Enid. OK 73702, bur-nengQ  bur-nengQ centres com. Drug  Free Workplace.  BUSINESS OFFICE  DIRECTOR. FuB time.  Must have experience in  collections and billing. B S.  degree in business related  field and hospital experience  experi-ence preferred. Must have  good computer skills,  including Excel and Word.  Supervisory experience is  preferred. Closing date  September 17. To apply,  please send resume to:  Human Resources, Ashley  Valley Medical Center, 151  West 200 North, Vernal,  Utah 84078. Fax 435-789-1314.  EOE.  PEAK USA ENERGY  SERVICES (A subsidiary  of Nabors Industries). A  leader in the oilfield hauling  haul-ing Industry is accepting  applications for the following  follow-ing positions: openings for  experienced Crane Operator  Opera-tor (wages $16.00-$21.00  hr); Bed Truck Drivers  (wages $16 00-$20.00 hr);  Gin Truck Drivers (wages  $14.OO-$17.00 hr); winch  Truck Drivers ($12.00-$15.00  ($12.00-$15.00 hr). CDL. Clear  MVR. and Drug Screen  required for these positions.  posi-tions. Interested applicants  should apply 1101 North  Street. Reliance. Wyo.  Phone 1-307-362-9773 or  to! free 1-877-744-6683 or  1382 Seven Mile Road.  Casper, Wyo. Phone 307-234-0629  or toR free 1-877-785-0416.  BENEFITS  include health, dental  insurance, 401 K, safety  bonuses and vacation.  NO RECESSION HEREI  Finally be your own boss.  $12OO-$6000mo. FTPT.  800-936 .222 or www.wfh-twz.com.  www.wfh-twz.com. IMMEDIATE OPENINGS.  SUPERVISORS and  assistants. Ful time and  part time. $$$$$ free information.  infor-mation. 1-800-662-3562.  www.provenfreedom.com.  GROSSED $90,000 LAST  yearl With this professional  profession-al carpet cleaning business.  busi-ness. Other. Interests force  sale of complete system  and van for only $9,850.  Cal B-ett, 1-601-818-279208-2518993,  MEDICAL BILLING. No  experience necessary.  Training provided. FTPT.  Computer required. Up to  $6,CXXVyr. 1-800-998-7094  ext 4023,  FREE TRAINING AND  education! Job Corps  means free education and  training. Live on a Job  Corps center and get the  skills you need for a good  paying job. Jcb Corps staff  wil help you plan your  career and find a great job  when you graduate. GED  and high school diploma  programs available. Ages  16-24. Cal 1-800-733-JOSS  for more informa-tioO-  ITCflffiSmrffl-SII  MERCHANDtSER. Part-time  Part-time employee to perform  daytime merchancfcrig  and resets in Vernal. Cal  1 00-86393 ext541V  AGE 1S-24? Job Corps  offers free job tramcng and  placement. GED classes  and college programs  plus tree housing! Over  100 careers! Cal 1-800-426  5627L  GET HIRED! GET trained!  Get paid! Training and hiring  hir-ing 250 drivers! CDL Class  A and B. refreshers! 100  percent financing available!  avail-able! Cal 1-800-770-1631.  Experienced cal 1-800-958-2353.  MAY TRUCKING IS your  road to success!  Teams soios run reefers  48 states. High miles, top  pay, benefits and equipment,  equip-ment, Cal today - start  tomorrow! 1 800-251-8846,  .  A NEW PAY PLAN at J-  MAR Trucking! Teams  solos needed. Freighitner  condo fleet, 90 percent no-touch  no-touch treigtit. Home often.  CDL with HazMat, 23  years old. 1 year OTR  required. 1- 888-216-5627  wwwj-martrucking.com.  DRIVERS: OTR DRIVERS  needed. Class A CDL with  experience required, good  work record, clean MVR.  Cal Bit) Horrocks today.  Marten Transport, LTD 1  800-786-4135. Or visit our  web site wrww.marten.com  on pay and benefits,  DRIVER-NEW LEASE  purchase program! Don't  overpay for CDL training!  15 day course for only  $120.00Cal for details!  Free CDL training for  spouse! We offer Excellent  Excel-lent pay and benefits, job  stability, consistent miles.  Experienced driver welcome!  wel-come! 1-888-490-8343  www.swifltrans com (eoe  mf: minimum 23 years  ,  GET A BETTER JOB? Let  Job Corp train you and  help you get a good paying  pay-ing job. Live on center for  free. Our career counselors  coun-selors wil help you plan a  successful future and  place you in a career with  long-term potential after  graduation. Get your GED.  Ages 16-24. Cal 1-800-733:  JOBS, (ucan) 1of2  RADIOLOGIC TECHNOLOGIST:  TECHNOL-OGIST: FULL 'time position.  posi-tion. ARRT required. CT  and Ultrasound preferable.  Competitive wage and  benefit package. Beaver,  Utah. Fax resume to 1-435-438-7224  or call 1-435-438  7172.  OWN ROOM, KITCHEN,  bath in exchange for part  time childcare (2 children)  and light housekeeping.  Needed Mondays Thursdays.  Thurs-days. Spanish Fork, Utah  call Melanie 1-801-798-1452  or fax 1-801-794-9865  Misc.  THE VERNAL EXPRESS  does not endorse, promote  or encourage the purchase  or sale of any product or  service advertised in this  newspaper. Advertisements  Advertise-ments are the sole responsibility  respon-sibility of the advertiser.  The Vernal Express hereby  here-by disclaims al liability for  arty damage suffered as  the result of any advertisement  advertise-ment in this newspaper.  The Vernal Express is not  responsible for any claims  or representations made in  advertisements in - this  newspaper. The Vernal  Express has the sole  authority to edrt and locate  any classified advertisement  advertise-ment as deemed appropriate.  appropri-ate. The Vernal Express  reserves the right to refuse  as j advertising.  -SMALL BUSINESSES\"  PLACE your classified ad  in not 1, not 2, but 49  newspapers thnxxxxrt  Utah. One placement, one  payment puts you into Vie  \"Utah Classifed Advertising  Advertis-ing Network and on the  Internet Reach over  500,000 Utahns for only  $125 for the first 25 words  and $3 for each adeftionaf  word. Cal the Vernal  Express at 435-789-3511  for further information.  For  Your Classified  32.000 readers in the Vernal for 20 words or less  Shopping Area (does not include billed ads)  1 00 Total Market coverage of  Uintah County Daggett County  Dinosaur and Rangely, Colo.  1 want a Classified Ad\"  Please run the foflovvmg Ad in the Classrfied Section of the Wednesday Vernal  ExpressThrifty Shopper and the Vernal Express internet edition at wvAv.vemal.com  25 per word, $5 rnin. (5C per word extra bold type) print or write piainty.  Ad Copy Deadline is Monday at 5:00 pm  Ad to run this  Name:  Address:  Bank Card Number:  Clip and Mail  P.O. Box ICOOeUlale  i ir-mm i  WOLFF TANNING BEDS.  Tan at home! Buy direct  and save! Low monthly  payments. Free color catalog.  cata-log. Cal today 1-800-711-0158  www.np.etstan.com.  MATTRESS SALE. Best  quality. Best prices in  town. AAA Pawn, 789-  4034,  HEARING AIDS. May wa  suggest Little Fiekf s hearing  hear-ing aids? They are manufactured  manu-factured in Sal Lake. Their  agent comes to Vernal  once-a-month. WiH give  you any service you may  need. Nerve- deafness  specialist. I have had hearing  hear-ing aids from them for over  5 years. You can send  your hearing aids to them  and have them back in 3 ,  days. You may cal them at  1-800-833-3021 In SLC.  1441 E. 2100 S., or you  may cal us at 789-2126.  Woodey BjSearte.  COOKWARE EXCITING  product! Cook with no  water! Heavy, 7 -pry surgical  surgi-cal stainless steel! 17-PC.  set! NormaPy sold for  $1695 at dinner parties,  now only $396.50! Not in  stores! Lifetime guarantee!  1-800-434-4628!  FREE GRANTS - never  repay. Housing purchases  repairs, medical, business,  busi-ness, emergency funds,  arts, writers, education,  non-profit groups, debts,  funding is guaranteed. ToN  free 1-866-298-4357,  wwwgrants-dot-com.com.  -HOT TUBSPA- Self  contained. Al options, with  cover. New, never used,  stil in original wrapper.  Cost $6,900 sacrifice  $2,600. Can deliver. 1-801  381-3551.  GOING OUT OF BUSINESS  BUSI-NESS sale. Must liquidate  $1 million in fabric, we wiH  build custom upholstered  sofas, loves, actionals,  re-upholstery e& at cost,  it al must go. 4674 South  Hcfladay Blvd. 1-801-277-6327.  29C0 South 300  West 1-801-486-6636.  Sofa Factory.  BUILD YOUR OWN steel  fences, gates and corrals.  Steel tubing, pipe, low  prices. If you need metal,  you need MetaJmart 181  South 1200 East, Lehi. 1  800-947-0249.  i  PROMPT DELIVERY service  ser-vice on your bottled gas.  Cal 789-3198. SAV ON  PROPANE.  BUYING Cfl GAS &  MINERAL RIGHTS. Send  Wo.: P.O. Box 73, Denver,  CO 80201-0073.  FREE GRANTS - never  repay. Housing purchases  - repairs, medical, business,  busi-ness, emergency funds,  arts, writers, education,  non-profit groups, debts,  funding is guaranteed. Tol  free 1-866-298-4357,  www.grants-dot-com.com.  Only  Ad wiH reach over  'I \"T 3 4  5 6 7 8  r 10 vT 12  iT 14 i7 16  17 l7 iT 5\" 20  5 21 5\" 22 5 23 6\" 24  6\" ! 25 T 26 5 27 7- 28  7\" 29 30 7 ST 32  many times: ,  to: reSS THRIFTY SHOPPER  SHORT ON CASH? We  make loans on anything of  value. Cars, trucks, motorcycles,  motor-cycles, guns, TVs, VCRs.  AAA PAWN, 57 North 500  West. 789-4034.  COLLECTOR'S LIQUIDATION  LIQUIDA-TION AUCTION. Saturday,  Satur-day, Sept 15th, 10 a.m.  Bridgeland, UT (turn on  12850 W., first street after  crossing bridge and go 12  mile - follow signs.) Selling  over 50 years worth of cot-lectjbies  cot-lectjbies including: antique  furniture, glassware, dolls,  crocks, bamboo fishing  poles, saddles, tools,  guns, toys and games,  stoves, and much more.  Also vehicles, trailers, 4-wheoler,  4-wheoler, 3-whee?, new  tools, sign shop equipment  and accessories and much  more. For more info or to  request a flyer cal ZJ Auction  Auc-tion Service 435-789-7424.  \"Have Us Do An  Auction For You.\"  FOR SALE: Macintosh  Plus, Classic, Classic l  Apple lasers, large format  laser printer, Epson Dot  Matrix printer. CaH 789-3511.  789-3511. TAKE ADVANTAGE OF  THE SUMMER MEAT!  Now is the easiest time of  the year to create a  healthier diet to enjoy year  'round. Cal Heartfekjt  Farms Hypnosis at 781-0218.  781-0218. Notices  O  ATTENTION CRAFTERS:  Fine Folk Arts Guild meeting  meet-ing for Santa's Workshop  wil be held Thurs. Sept.  20, 7 p.m.. Commission  Chambers, Court House,  2nd Floor. Plan to be  Personals  ARE YOU drawn to another  anoth-er era and feel you were  bom in the wrong time?  Explore the possibilities  with a journey into past-life  regression. Cal 781-0218  for appointment  CHANGING YOUR  LIFESTYLE can be as  natural as the changing  seasons. Let go of the  anxiety and stress that  keeps you locked in a rut.  Daytime and evening  accelerated change sessions  ses-sions are available at  Heartfeldt Farms Hypnosis.  Hypno-sis. 781-0218.  .Date of Issues:  Phone:  Signature  .Expiration Date:,  j  START DATING tonight.  Have fun playing the Utah  dating game. For more  information cal toll-free 1-800-FtOMANCE  ext. 1509.  ADOPTION: HAPPILY  MARRIED childless couple  cou-ple wishes to adopt a new-bom.  new-bom. Wei provide a lifetime  life-time of love and security.  Please call Nancy Ron  tolfree: 1-866-708-1894  Real  Estate  12 ACRE lots for sale.  Exclusive area. Cal  evenings, 7892444.  4-PLEX LOTS. Close in.  Al utilities. 801-486-4792.  RESIDENTIAL BUILDING  LOTS. 13 acre tots  $11,000 to $15,000. No  manufactured homes. Cal  Bob 731-0783.  TRI-LEVEL HOME for  sale. 4 bedrooms, 2 bathrooms,  bath-rooms, corner lot with  great neighborhood. Asking  Ask-ing $139,000. 241 N. 1250  W. 789-6847.  HOUSE FOR sale in  Dinosaur. 4 bedroom, with  garage on 3 lots. Wil take  best offer. Cal between 9  a.m. -9 pm. (907)488-6240.  (907)488-6240. LARGE HOME, possible  duplex, half acre, includes  appliances, Maeser area,  first $85,000 cash. Cal  after August 19th or leave  message 435-781-0813.  Great neighbors!  6 BEDROOMS, 3 betts,  two kitchens, famty room  3 fireplaces, laundry room.  3300 sq. ft pus lots of  storage. 24x36 garage,  welt, 3 sheds on 1.82  acres. $155,000. 781-0806.  781-0806. BUILDER DEFAULT!  CANCELED subdivision!  New high quality structural  insulated panel home kite!  Fast simple assembly.  Your foundation! 34  bedrooms. Flexide layouts.  lay-outs. Lifetime warranty. 1-800-847-9723  www.vai-ubuild.com.  www.vai-ubuild.com. UTAH'S NUMBER 1  Guerdon Home dealer  now has 18 models, with  optkxls from leg siding to  6-12 roof pitches. 945  North 2000 West  Springyiile, Utah. 1-801-489-3344,  1-888-224-6637.  1982, 14X56 mobile  home. 2 bedrooms, 1  bath. Furnished. Flaming  Gorge Meadow Park.  Must move. 601-262-3072.  $10,000.  I BUY single family  homes, duplexes, tri-plex-es  and 4-plexes. Ask for  Jerry at (301)221 9441.  CHEAP STEEL ROOF-MGSSDING,  ROOF-MGSSDING, heavy duty.  26 gauge galvanized, 3'  coverage, 8' $8.40 each.  10' $10.50, 12 $12.60.  14' $14.20, 16' $16.80,  20\" $21.00, 24' $23.50  Limited supply. Metalman  181 South 1200 East,,  Lehj.I-800 947-0249.  STEEL BUILDINGS:  DEALERSHIPS overstocked!  over-stocked! WiH deliver now!  25x25, 30x30, 45x80,  50x120. Must sellhuge  discounts! Cal now 1-800-462-7930  ext 56.  3ffi  YOUNG PEOPLES DAYCARE,  DAY-CARE, infants to 12.  preschool plus after  school care, state  licensed, 14 years experience,  experi-ence, certified teacher,  extended hours available,  snacks and meals included.  includ-ed. 789-7231.  DO YOU NEED free education  edu-cation & training? Are you  16 to 24? Come chock  our Job Corps.! Contact  1 -(80 1)466-5737.  WWW DEVELOPMENT  and consulting. Put your  message on the internet:  including cniine catalogues,  cata-logues, indexes, mail service,  ser-vice, home pages. Contact  Con-tact Steve at 789-3511.  Rwsonbie prices.  PROFESSIONAL COMPUTER  COM-PUTER repair and installation.  instal-lation. You call us, we  come to you. Call 789-7979.  789-7979. I .eTtTr?fifir\"  THE BANKRUPTCY  FIRM. Wmward and  Toscano LLC. Stop: Foreclosures,  Fore-closures, garnishments,  repossessions. Free information  infor-mation - $0 down. Personal  Per-sonal service. Salt Lake  City 1-801-359-1313,  Ogden 1-801-392-8200,  frwl -866 jTjjj.  Vehicles  2001 DODGE 3500 for  sale with flatbed ready for  Hot Shot business. Tail-rol,  Tail-rol, winch, gin poles. Only  3,000 mites. Call 789-3128  789-3128 or 828-3128 for info  $34,000 OBO.  Services  a\"j((R'S,te", "parent": 22658299, "version": 1739889042502189059}, {"id": 22658308, "paper": "Vernal Express", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/d1/01/d101b84a19a7ef429228b584ea9169983948cdfd.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/82/b8/82b8e4471ba2bfcc99c554a3f1eca77e7fc5643c.pdf", "page": 9, "ocr": "TO  www.vemai.com  Vernal Express Wednesday. September 12. 2001 9  t -w : ii\"  r IT II Hill 111 HI I lllllMIMaMMMJOMSMM  'WORTH WAITING FOR!  One level 1,900 square foot home on 2.1 acres.  30x70 shop. Great view. 57 98,000.  'END OF THE RAINBOW!'  Totally remodeled. New kitchen, carpets, just painted.  4 bedrooms, 2 baths. $129,900.  p;  i .  TroyAlIred  7mm or cefl 7904335  ori-eo(wesai22  Custom Backho Dump Truck Loadar  Sarvte DHcNng Tranchino, Excavation  Sawar A Watar Una InataltatkMi Sapdc  Tank A Drain FtaMa Gaa, power, Phona  Hnaa Snow PuaNng A Ramoval  Licensed, Bonded Insured  Foston L Chivers  emu, 70.0040  120-2343 ww w 789-1620  MAIL YARD  2100 Wact 1000 South 1104 Eaat Hwy. 40  Vernal, Utah  MOP  435-789-1755  FAX 435-789-0841  TH7TT  7i- O-lu'MtiM-Q'M-  1 LCSAtSOD bnSSI2-k.iJ  Quality Turf Grass I r 11 11 H  Prompt Delivery A DtvWon ot tiAa Mictgnary Co.  Affordable Prices SS.-\"\"5  888-294-7074 .  j-. f TracuDozwt StaO U)def Pump  iSTfew 'IPltlflt EeaorljilPITrfKi  ifjy - - V'l' . Shooting Boom Fortdrf ConcrM Equip  VallPV Snd 1345 S. 1500 E. Vernal, UT M078  V-' uw 435-789-0635 FAX: 435-7G-0ft41  f DESERT 1 A FOR ALL  SPLASH SPA'S fSV pp\"\".  Cd CONNELLY MEEDS  With years of axpartanca and knowl-  Iy5 We Sell the adga In tha propana bolna.  rTOfy Bgsf Service Come by and see our complete Sne of  y , heaters, torches and propane bottles.  S theRest rjan  789-4867 146 W. Main I OPAJIZ 789-3198  LET PEOPLE  KNOW ABOUT YOUR  BUSINESS  CALL  789-3511  Let us get you out of the mud  EE  Licensed and Bonded  PAVING- Private or  Commercial  HAULING -Road Base,  Top Soil and Gravel  Excavation for New Homes  mem  I  li  FOR LOADS OF  CLASSIFIEDS  709-351 1  a. u  InsaiHtcn  Corxutaniaj Fnt  Estnng SySem  Rk 4 Mttsumg System  789-6718  1732 W. 1000 S.  MMkPlDaHalWna  I  MACrflNERYCQ  Vernal Service Center  T - ir 'STOCK:  ItexraS S Wmk Parts Kmrarth fl  VtBama Hesdlctoaa .and feai e  kVe have good pnees on remanuiactund  Transmsstons - Dmerenbals- Starters -  Atomato and Ak Corvfxesson  1345 & Hwy 40 Vrnal,Utah  435-789-0635  Freestcr.3 Construct!::.  Co,, Inc.  2E26N. 503 1 Vernal  435-789-1637 CeS 435-824C2S  , . Chcs Fretoff ;  ' WH DO CONCRETE  COMMERCIAL DEALER FOR  B&C STEEL 'BUnJiMGS  STEEL ERECTION 15,C0O  BOOM TRUCK 58 BOOM  1 !i  I SAM'S JiTX  BODY SHJHj  .ar riuiu mna  GETTING MAMEDl  Register at  MILT'S ACE HOME CENTER,  JC PENNY & RADI0SHACK demir  And Receive A  Fgg $15 gift certificate  Choose from a wide selection of  gift ideas in both stores!  Housewares Hardware Appliances TVs  VCRs RCA Satellite Dish Systems Phones  Stereos And Much More!  Come In dr Register Today!  Free Gift Wrapping dr Delivery  J3ridal ZRjegisiry  rr i FFT i run c . X  Saturday, Sept. 22,  Haslcm Residence  690 W. Main - Vernal - 435-789-2150  Mon. - Fri. 8 am - 7 pm Saturday 9 am - 7 pm  ActCard - AmEx - MC - VISA -Disc  BxS Pharmacy H  Vernal Pharmacy:  789-7011  v  Roosevelt Pharmacy:  ,H 722-2255  Tree Trimming  & Removal  Free Quotes  Kim Harding  '(435)646-3089  Myton, UT  SATISFACTION ABSOLUTELY  GUARANTEED  Mt. Olympus Waters  789-2875  Hot Soups  Hot Chocolate  Complete Coffee Service  Fresh, dean tasting mountain  moun-tain spring water  Serving Home  or Office  ... ..m. .......................... i  PROFESSIONAL  CARPET CLEANING  Meier's Carpet  and Upholstery  Call Cheryl Meier  for an appointment at  789-8667  FREE ESTIMATES'  References available. Licensed  insured, work guaranteed.  SCOTT  MURRAY  LP GAS  24 Hour on Call Service  Sale & Service Fire Extinguishers  Competitive Prices  789-8883  Qjffigan Drinking Water Wate Coolers  Pkg. Products, 172 liter, 1 hier, I5htec etc  D( Tanks Rita CanisJere 4 filters  ? Krverse (Xrrssis, Rent or Buy  Water Softeners, Rot or Buy  And lots, lots more  - Service you can depend on!  Servicing Home or Office  146 Wt Mian 789-4867  V  feu All  lalAl Your  J Propane  Needs  2001 5:30 - 7:30 pm  186 East 1200 North  WANTED  Old motor scooters,  Vespas, Cirshmans,  mini-bikes, mopeds,  Endures, & anything  else. Please can now,  Salt Lake City  801-898-5865  Subsidized Housing  for the Low Income  Elderly and Disabled  (EMarty must ba 62 yn 01 Aga)  1 Bedroom Apartments  EQUAL  OPPORTUNrrYX\"  HOUSING  COMPLEX  TOO  Sharon Slwri 781-6383  2Z \"  Deadlines  NEWS  ARTICLES  Monday  at 12  (Weddings, Births,  News Releases,  Obituaries,  Public Notice,  Sports, etc.)  DISPLAy  ADS &  CLASSIFIED  ADS  t Suits From Chaps.  Arrow  rr All  t i les rrom a i  Durable Leather  ft Dexter- Dr Martens  Quality 4-piece Luggage sets from Maestro  Socks, Belts, Sweaters, Shoes & Personal Care  Items, Watches & Much More!  All The Best Quality At Great Prices  Plus our Missionary Discount 20 off regular priced items  Extra 10 off  WeMng  This Weeks Registry... A  RECEPTION  I SarnrHav. .nr 1  M Manwarine Residence  RECEPTION  Saturday, Sept. 15, 2001 6:00 - 8:00 pm  Brixey Residence 936 East 2910 South  r-  CEREMONY & RECEPTION  Sat., Sept 15, 2001 6:00 pm Reception to follow  IK  Tree (jift Wrapping cZ (Delivery  Mon.-Fri: 8-8 Sat: 8-6 Sun: 10-5  280 W. Main Vernal 781-1556  COLLECTORS LIQUIDATION AUCTION  Saturday, September 15th, 2001 at 10:00 am  Bridgeland, Utah  (North off of Highway 40, turn on 12850 West firet street after crossing  bridge, then go 12 mile to Morrisons Triangle M Ranch. FOLLOW SIGNS)  Avnot rr.s mi i Ffnm rs ANTIQUE FURNITURE CQNT.  (jbwaR jenny Lrnd Bed  Muool Imvun Quick Desk  Train Sen - fare fieaai Camd Back Trunk  Boob Snuli Mod T Punted Trank  Crodb Bwduit  Early Pruis Dmtcn  The Smrj-ofOmFUg\" Print And Much. Murk. More!  Recordi  OxmnnrSer MliCf.lMNFOUS  Eight Track Tpa UrT Set Prtnnng Pna  Lght Fixtures Show Card Madtmc Tank  tampi Sicn Shop hqatpmem  SeiMaduna Stww Card Machine  OJlecrJUr. Tori & Gne Silk Satena  ' (Aincncan FV- Ijncoln lop. nc) Textile lnkt  Cold Pana Flatbed Preaaa  190i Sear Roebuck Catalog Flatbed Pm rCabinea & Table  Kick Parade Saddle Scpeegca  Old Took Compound Sock Bom  30 'i Cadi Register Quners  30 1 Coal Burnet Stow Arrows  Wooden Crates Craft Paints  Coflecnrt Baseball doves Embroidery Punts  (Mits, Baa. BaBs. etc..) And Much. Much. More!  50i Car Ajr Goodjtxjoer  Cast Iron Macdianrcu. ' VFHin.F.S. TTtATl FRS. FTP  Enamel Ware ' Omn Pickup  Coilctntjic LoxA Ion 1 95 II - Happy Home House Trailer  Minm HawLight FoarWhorltr  Wheat Grinder Homemade Long Metal Trader  Tin (Heavy Duty Dual Axles)  Too. Oldn Hone Trailer  Saddles: Misc. Tack Moal Detectors  Fishing Poles at Reds BJm  Bamboo Furung Poles Rjding Lawn Mower  Oeek Propane Heater  Victorian Minor Frame Mist. Took fc New Took  Misc. Crocks Mkc Parts  30 1 Burner Stove And Much. Much. More!  SyoSe  Flash Gordon Penrrv Gum Machine GUNS  Early ISOO's Horse Hair Sleigh Blanket 2 Hamngton Ac Richard Specsai  And Much, Much, More! Modd 732 6 Shot Revorvrr  J C Higgons Modd 58 3 20 Gauge FuB Choke  ANTIQUE FURNITURE H&R Topper Modd M 12 Gauge (Only Shot  Oak Press Back Chairs 0ncl  Miscellaneous Omrs 1946 Scrim Mauser Action  Pionea Kitxhen Tables 2 rWrline Pellet Guns  Wicket Chair wDesk And Much, Much, More!  c  AUCTIONEERS NOTE: Fred & Sharon Morrison have been  collecting stuff for over 50 years. It was impossible to list everything.  You will find lots of treasures at this auction.  For more information or to request a flyer call  ZJ Auction Service  Zander & Johnna Mclntyre (435)789-7424 (435)828-7424  \"Have Us Do An Auction For Yon!'  Haggar. Hard wick  White Shirts  rn 1-  ne famous Makers  Dress Shoes From  - Skecherc- Harks'  sale price items  (Registry  2001 a S-00 - 7:00 nm  1275 West 2500 South V  3", "parent": 22658299, "version": 1739883640828985347}, {"id": 22658309, "paper": "Vernal Express", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/fb/83/fb833e0e524ba6bafcf9964f5295f8b0e39462c7.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/12/6b/126be2c797662220d341219b9fd6a6206cfe56c4.pdf", "page": 10, "ocr": "rf\" to otoeea. i mm.tuw  1 0 Vernal Express Wednesday, September 12, 2001  SATURDAY AFTERNOON SEPTEMBER 15, 2001  1 12:00 1 12:30 1 1:00 1 1:30 I 2:00 I 2:30 I 3:00 I 3:30 i 4:00 4:30 S:00 5:30  KUTV Q ER (In Saaroo) (CC) iFooaaoi Cottage Fooabal Tamosaoe a Fonoa (Lo X) j  KTVX Q PQAGc WorMGod Cceg Footbad: Reownar Cowt raaa 1?? . -  KSL e Auto Racing NASCAR WotOi Sanaa\" iBrwadora ' Cup Prawow (Nt (at Srorao) Paid faaj P?i f?5?l  KUED Q Woa iBaidng CJCuona Cox Dutc jYon- IWora- Hco Hg j-KBYU  j-KBYU a Sowing ICuttnary jrHewng IGorion Houoa HrjuoojKeiiia- rtorao- Worb- IWdwrif WojroJanjo  KSTU O MaiorLoorp7Baoabal Poa- lOtar- I'jutcaoa-Educ IStargata SSj J'f?ci  KJZZ OlAWtla IGomo- jCoaaga Footpoa Utan Ajr Foroa ftje iFtmdTV Xamv Warnojr  AMC (ti45)-Howyaernto\" 'An Afar pflemornper-( 1957) jBacaa- eh -Easy Coma. Earn Gg-faoT; fj  DISC I Chora IChoaa jBottaoida-WiM 'Gtoat SphJrg Ivabay-T-loM Paraoiaaa. Ai jWaiaatrCWabb  DiSN Honoy, I Shrunk Jaraay Boy- Ey iLteo lh Iriaovr fct'ii95) PG' (CC) So IFomoMe  ESPN ! Coaoga Footbod conaga OnvWy Auto Boring: WASCAfl True Sanaa ISprjrtacanwr (CC) Gomo- Footooa  FAM s(TlSolJttabKa7BVaacti ITotal jSo Uete l -Batye DovqjroW, Comadyt a xaHorg-(i9fj  HBO bMdathoKFL jAiojericanop: Labno LWo a D-(2!0)Sanarar3ufec. lAaianoa Ve fjmjt  LIFE Vroddmgolia Goidon IGotdon Golden jGoUon I SarorearCg-SirargOT';i987) yraor rVorai-  MAX (11:30) T?ia WaolaoomonB- -Atnostan A-iger (19!g0) PG H XtGiaf'(194 -PG' (CC) Supoefl'jg  KICK Hica- jWtcb- HkM- Nick- jWicb- 'rfceo- Nicb- Wicb- iAmotd IThom- RrgjRga  PSN Ww. VohWyboil RurW\"1couoga Foodjoa: Caiorado al Waarangton San (Uw) Cottage Tj  SHOW Fib- j Uan oi tna House\" (1995) i Tha Baor-Stfs Que-199s7PG' l Tna rhrSejaL'gJO0 , Dramaj  TNT I (11W) -Snag'' . Tna Song\" r$Ti)Padi hewr-arrricC) Sat JPoa(1977) JohjiTravooa  USA vcman Undone-Qnini) M ngnTjm Cra r(ta-(199'r) iCC) TcWHajpanadip3apy -Wie?-  WGN jAndromooa (CC) Loot World iCCj taaior Uoguo BaaabaoV Panouroh rVatw al Cncaqo CuBa. rmohPr iFmohPt  WTBS W fi.'nrn farm\" (1986. Comedy) fint tuck'iWi Monm Sno U -Mr moo Gc (1S87 Comooyi  17-year-old  dies in  crash  A 17-year-old student at Uintah  High School was killed in a two-vehicle  two-vehicle accident Monday.  The accident occurred ,t 5 p.m.  while Anthony Lynn Davis was  traveling on a bullet bike north on  2500 West at 1000 North. At the  intersection he ran broadside into a  van. Me died as a result of the collision,  colli-sion, reported the Uintah County  Sheriffs Department.  77r vernal  KLYTV  JUL.  WEE  LOGJ  Subscribe  to the  Express  for a  Friend  by Calling  789-3511  Catesi &  Tekvwoa Specialists . I  AUTHORIZED SERVICE  AAA SERVICE RAUNG  CY THE FE0FESSI0NA1  . SHIVICB ASSOC. -  TELEVISIONS,  -VCESVIDEO  BIG SCKEENS  COMPUTER ,d.iw  -MONITORS -  Frte VCR Tips Bzxrxl  In Homo Servico  Plch'Vp end  Delivery  Estimates .  ;i .709-3332'  975 7. Hwy 40  l Vernal  Venr.l Yhsatrc  Now Snowing  H. & Sat 7:00 ft 9:00 Sun Thur 7.30 Only  THE OTHERS  fptod PG 13  r m a, M  11  Now Showing .  6:50 & 8:45  Rock Star  Now Showing  7:10 & 8:50  RAT RACE  RotoO PQ-13  s  Now Showing  7:30 & 9:10  4  Now Showing  7:00 & 9:00  MUSKETEER  Start Fricay  720 & 9:10  SUMMER CATCH  PleoM Mots Earry Shorn  SAIVBBAYS ONUX  Rock Star 4;30. 6.50. 8 45  Rat Rase 4:15. 7:10, 8.50  Jeepers Creepers .5:00, 7 JO, 9 10  Musketeer 4 00. 7.00, 9 00  Sonmer Catch . . .4 45. 750. 910  Sunset Drive-In  GfxmUSSMMS FrltSatOrty  Carload Met tlO Al Wsitand  m AMERICAN RS 2,  ORIGINAL SHI  WEEKDAY MORNING  6:00 I 6:30 7:00 7:30 8:00 1 8:30 9:00 9:30 1 10:00 1 10:30 1 11 :00 j 11 :30  KUTV O We Wo jEariy Shorn Prico H Wight Young neotlooa Aa Wortd Turn  KTVX fl Hi Cone a Good Mornaig America Boaio and Kedy ( Mental WiUiame The View  KSL O jWo Toot Martha Strew Other Ha  KUED Q Ixjm- jMr Barney Sooaroe Soaol Liona 'Beading 'Science Wardt America Look Up Grand  KBYU B YU Reo dme, Joy Joy ArkSe- Clifford Cioi Dragon Zoboo Barney Tola- BYU Oevoponal  K8TU 'Qf Good Day Utah Good Day Utah Jenny Jonoo Judy Brown Judy Attorney WA'S-HlM-A'S-H  KJZzTc Undor- Menace Son- GorfMd 5aW Toi MaraVerue Toll ITmI Moral varied  AMC Mono Voriod 'Movie Viriod .Movie Vanod Progreme  JHSC Paid femt Paid Pud Paid Peai iPwd Paid Aeaignmont Homo Mate  DISN J \" kW A H Cruo Imoqo- 'o o) Bawo Pooh Br PBJ PB J jRotw Pooh lOUot  fSPW SoonooonMt Sponooomor iSpotlooorrtor i?oftcontr Booobol TorootO Vanod Programo  FAM Cnwo lUlo U vrtod lllontif jZoct -1 Font jFonl 'toy iLrwng 1700 Club  HSO Moto Vonod ProgrKO n  J.kff PMJ Paid iPoid d !FH Urn lwiojl jPooign- iDooign- iGotdon IGoMoii iBoyond Chono.  MAX o V\" Movio Vortod Progromo Movwi Vorted Prooomo iMovto  NiCK Arnold RugtH Bob FronWIn iBIuoo- Oowotd iDonj Dorp UBIo iBIuot- iMoaolo Uto  P8N Po Ou- Oomo WW ISporto NW ISporu !b l-Spoti iPoid Pid Prd  SIOW MovwContd Mowo iVoriod Wooronw Mow 1 Vnq Ptooj mm  TNT UACr tW ER IWYPDaiuo Mirtflo  \"lS A StoMwbofg Totoirtiow Www jo Mortiw ;Urnn Voront- IwVo  WON CtuoWcY- Poronl IWoyonoTtUcOYVOf Hoi al Wight ttoooctl Wo  WTE8 fo\"- WW- UWoHouoo iLimoHouoo Mwtm ICooby Mttoc Humor  WEEKDAY AFTERNOON  1 12:00 j 12:30 1 1:00 1 1:30 2:00 I 2:30 I 3:00 3:30 4:00 4:30 i 5:00 I 5:30  KUTV j Q two Ourdmo, Ugjrd Botd jTBA Booio 0 Donnoll Wo 'nutty- Wow howo  KTVX Q A y CMKtron Qwo LWo to Uvo Gonorl Hooprno Foud U'potdy Oproh Wimroy ABC Wo  KSL ti Wo Poooiowo DY 0 Our th Anonoo Lowmj Moury No WBC  UUCP f) DoHoro JVortod iPoooW iHood- Tow- ICoiHou Drogon CMrlord Sogw Arthur Zoom Buot-  JI.BYU Q Vortod lonMj ttroot Mr ArUwr Sogw Drogon Drogon Arthur- Zoom CHfiord Vrrtuoo  KSJf H ' 'wo jro IjonnyJonoo Woody Triin- Hongort iDigirnonTM'A'S-H 3rdBoc' Horn- 3rdHoc  KJZ2 J Bowlton iJoonrrTyWorloo Solly \" llyonii Grimth Lucy Sovod- Snoot  AMC \" I MotIo Com d Ivonod Movio iHortywood Lro Rocjr ThrooStoogoo  JMSC Potion Poolgn ICnrtotophorL Homo Honor. IDooign Chriotophor L. Choto Voriod  DiaN Boor PBJ IroUo jPoott loutot IWormoKl Doug iPoppor\" Honoy, I Shnmfc Jorooy jFomouo  ESPN Voriod Progromo Sportocoricor Vonod Progromo  f AM Hoj rloY IWory Oomud Bod Dog iGoagot jGorflold k.k lAngolo Zocr-. lAddomo Big WoH  HBO HoiH Coma Vonod Progromo  LrFt Uraiorvoo Hryot Unooto7lityot IMoyW rovio  ' Ml \" Tvonod Progromo .  J4XK boug jPimry lAmoid Thom- iBugroU Iwtcli- ISpon- lAnrmon- Wicli- 1 Thorn- iRoclat Rugjotf  PSN Vortod Progromo IBIuotorchTV  \"MOW Movio\" j Vonod Progromo iMovIo Voriod Progromo  TNT Hooiot Wight 1 Tour ol Duty Loot World Pol Factor WYPO Bluo jProtondor  U8A otoyto Voriod Piuyioiiio Moyio Vonod Progromo Momo .  WOM Chonqo Stroot ICooby jCity- Fonioy ICIuoloaa\" TthHoovon Full Hoo.jFroohPr jFocnwy Sud-  yVTBS Huntor Cooby Cooby Furl Hoo\"fuII Hiio IRooo- bop- FroohPr Voriod  WEDNESDAY EVENING SEPTEMBER 12, 2001  6:00 6:30 I 7:00 7:30 I 8:00 I 8:30 I 9:00 j 9:30 10:00 1 10:30 ! 1 1 :00 1 11 ;30  KUTV I q\" CBS tntor- 60 otoKtoo Jl ;CC) Amoilng Boco H Wart Loko (N) CC) Wo Lata Snow (CC) Lata  KTVX P Wo Fortuno Ity WlioBrody Prow Caroy (CC) MW (CC) Wo Wight- jtrtro Edrtton  KSL 'ff Wo Wo Loot (N) (In Srorooj woot Wing (CC) Law 4 Qrdor (CC) Wo Tonight Show (N) Mod  KUED iaw Lohror SWoar Woody a Amortcon Corloctton Onry Toochor sorod KoopUpAlto ISurvtv  KBYU JL Urtto Houoa WawaTohror fwova (In SWroo) Scwnco Odyoooy (CC) GoodoK-Bonoo  KSTU i p Simp- ISormold ICIng-HIM jOround- jfrlua jFamiry FOX 13 Wo IStmp- IWA-S-H M'A-S'H j Aroot  JCJZZ JJ Frlonda Choara yplomy\"(19ei) Bun Roynolda. Acoaaa Tchoori Frronda Fraaiar Trok: Voyooor  A MO Borrio al th Buigo\" (1965) honry Ponclo \"ThoEiofionrMyi (1560) PG \"T)0(ftor'(',J?fi  Ot5JC Your Wow Houaa i IWHdDiocovory Iwnd Dtocovory jGroolSphlni IVoHoy Tw DoodHno Droc.  CXSN Boy- tvon Smart- iBoy Morao Sonso\"(l99 Drama) Jumping Shp' (?0O1, Advoniure) pSrwr  fcSPN Mo)or Looguo Boaaball: Toarna TEA Major Loaguo Baaibirl Toama to Be Arinounood. frwd) jSpoftoconior (CC)  FAJ 1 Club T T iGrow- Prow- Stop jstop Too Triri tpout Cats md Dogs (1996) 1st Stata  HBO fioaoy lo Rumtxt' Amortca 7io Brm&y Qjnch Mow\" Rovorb (In Storoo) band ot Brothora (rn Storoo) (CC)  JL.IFJE Dowgrv iDooigtv IGotdon Gotoan Irrtlmota Portrarl lunaotvod iMyat 1 r ro Mo' (1996) Yasmria Blooth  MAX \"flro- imtchr '(1965) 'R' (CC) 'Ciam Cmora\"(?XirNRl I Tht Big Turn On \"(?009) Rmptaetmants\"  NICK Spon- UPldi I Brady \" Brady .Brady Brady Brady IBrady Brady Brady AIIFom- Alffom-  JSN Soa Thiol loot WAS- iMartnaraiMaror Looguo BaooboH: Mannors at Angela WW Ispoita  SHOW \"TVrga Cnaoga\" Xocar Noro\"(19r) PGICC) v 'Wulea o Foauornonr\" (?000) 5oul Fooo (iTV)  TNT Law Qrdor (CC) \"Gnoaa gtMmiuippi \"(1996, Dramai Aloe Balow (CC) '.. And Jusnc tnrAt\" (1979) (CC)  JJ8A Taioa Bangor ITamw Rangor IjAO -Yoah, Bapy Waah Brtdgoa (CC) Death Wrranf'1990, Drama)  WON tS IMadnouaa' lig, Comooy) Wo (In Store) Hoat of Wight Motiooii (CC) Sud- CaroMna  WTBS (Wioy BoHovo Spn \";i97) Mat Jai Whua Ripley BoIioyo f Target (?QQfl) paryi Honnoh  THURSDAY EVENING SEPTEMBER 13, 2001  I 6:00 6:30 7:00 7:30 I 8:00 8:30 9:00 9:30 1 10:00 1 10:30 1 1 1 :OoTTT:30  KUTV I a CBS jtnaar- ot Houra; Lwng Big Brofhor (CC) iCSI: Crtmo Sen Wo Lata Show (CC) Lata  KTVX 0 Wo Town Murine, Bo a MiWorwrro Primotimo Thra Wo Wight- Erta Edition  KSL Q Wo Wo jFrtondo (In Storoo) WW 4 Onato (CC) ER Rampaaa\" Wo Tonight Show (N) Mad  KUD Meoa Lohror HYTV: Paopla Myotoryl ' Inopoctor Morao\" (In Storoo) Sorvod Koop Upj APo Wove  KBYU q\" LUtio Houoa Wowo-Lenror Wocita (In Storoo) WatJonoil Goo. Wa Europa Amorlcan trp  KSTU B Simp- Tsomtold World Roeordo Night Vrokma (CC) FOX 13 Wo Simp- M'A'S'H jM-A-VH lArrool  KJZZ Frlonda Ooara SocrorPacf (1 999) Rwor Strong lAeoaoa Choora rrrondo Fraaror Troll. Voyagaf  AMC Tho ftrdt H 963) Pod Taylor Mt HobbaTaki Vacation\" 196!) Tho Lot lT'Vc?\"(1974) 'PG (CC)  DISC Your Wow Houoa jWltd Dieooirary Wild Dlacovory Ligrrlnlng Striaoo Paraoitoa' AHvo Scionco toyatortoo  ptSN Boy jEvon Smart- Bor- iiiayMorno (1996) PG' \"My Dfa-Prat Vy  JESPN ( 30) Coaogo FoorboJ Pom Sioto Virgrma iSportacomor (CC) Baaobod Tonight Scwtoeontor (CC)  FAM Motor Looguo BaaiBoil: Gionta al Aatroa jOro- Qrow \"ProedX (1967, Drama)  HBO -Throe ro ranoolo \"Pnvo Me Cmry\"( 1999) PG-13' (CC) tnaid tha NFL (N) Root Sporto (CC) Sopranoa (CC)  LIFE ' loolgrboalgn- Goidon Qolnon flriBmoai Portrait lUnoohrod Myat Strmg Poses\" (1999, Drama) (CC)  M AX noadEiDor\" t \"Jo Ihe Kmo\" (1999) R 'Waff Sfrof\"(i967) Mtchaol Dougtat R' i TW FWi?\"  ?; j Spon- UPlcti Strooao Istroaoa IStroaae Tslrolioa Stroa IStroaoa ISrrotoa Strokoa AHFom- I AHFom-  PSN Sao Thla Laot WAa\" Morlnora'Mo)or Laogua BaaoboH Tonaa Rongan al SoaWo Marrnort WW ISporta  SHOW HBur-eyiPwFamiy'(i9t) v Chanooe jo' (199) PG' W 3 Stnkm\" (?000) 'R' iGornrjteCd.  TNT Low 4 Qrdor (CC) 'Bmen rnaC (199S) Torn Soroct Muroor r me Fret' (1995) Chntio.-i Suw I'Poaoy  USA Toaoa Rangor iToMaRangor JAO Yoah, Baby' Wooh Bridgoa fCCj \"An Innocent Man \"(1989 Drama)  WQnl Motor Looguo BaaebaP, Wo (In Storoo) Hoal oi Wight iMotlocti (CC) jSud- ICaroliria\"  WTB8 Mofpr Looguo Saoacpa P.i a' rVavoe W \"Gmuntfvyg Boy \"(1903, Comply) jBurty Boar \"FaOng'  FRIDAY EVENING SEPTEMBER 14, 2001  6:00 6:30 I 7:00 7:30 8:00 8:30 I 9:00 I 9:30 1 10 00 1 10.30 j 11:00 1 11:30  KUTV Q jCBS iEmar- Orognoora Muroar CSI: Crimo Sen t Houra: Tug IWo Law Show (CC) Low  KTVX Q jNe jportune Homo VWooa Bo a Miiwno Dporttown (CC) Wo Wight- Tlrta EdWoaj  KSL O :Wo Wa jPioirtdomja (CC) Dotelliia (CC) Lew 4 Qrdor We Tonight Show (N) Mad  Jyf R Q ;\" Cahror Waoh wa H Anakajoa Rdoho Amoa (CC) Sorrwd Kaap Up j Wowar'a Chorea  JBYU (D \"TLrWe Houoa No Lohror )RodwaHodwall weBone Goo. We He I School Qroup  KSTU tt Sowe- Srtntold aa'i The X-fnee' (199) Dawd Durjwvny (CC) FOXUWa \" Simp- MASH MASH  KJZZ O Frlonda Chopra t GcCroorodlbrr-'(i9tl) lAeoaoa Choara iFnonda jFrooW jTrote Voyagar  AMC Men wMhtWmemam\" (1971) Clnomo Croarune aoc Lagoon- The Haunted Palaco '(1863) Cwmma  PISC Your Wow HouooTwild Woootajry WWd Wecovary Mornat Aria 'Martial Aria lllltfliwoy Plratoa  OISN Venal Choroo jyieooia Choice \"The Poor Point' (?001) (CC) \"OoaraPon Dumbo Drop (1-395) PG' fCC)  ESPN Coooo, rootboll Coronjac Stale al Hovooe-Lae Vogaa jSportocorrtor (CC) WFL iBoaobaa ,3pu1joiiliii (CcT  r1 S Club Par?y (CC) Grow- Prow- I Stop Stata Lanea Burton To Bo Announcod Eaptr. IJnarrwri  HBO FromoW earW Root Sporta (CCj motdoPwHFL esme'KH Earth (?000) PG-13 ' (CCj \"Hekl Up\" i&XJOj  t-IFE Daalgn- lOaoign- IGotdon jttoloori rMtmote Porb-aH \" Mater Mode n Hpevpn\"(i997j (CC) Waddoga-LBa  MAX Xn rronriorie r (?CXXT) I The lhole Vne Varoa- W \"Big Homme House\" (3000) (CC) W \"Blue Streak\"  WICK Spon- jOddpor- jlmroBor iKoBtoml jn Co. 3'Co. jBrady Bd AHFom- j AHFom- Lacy iLucy  SooTmalLaot WAS- IMarlnara ,Mo)or Loogue Booobao Taa Rangers a! Soatrw Marinoni. WW Sporta  SHOW umoayflnoa- ap\"ir)GrogoHriot ITV -Snar (2000) T (CC) Ebao IStargata iGotruj  TnTT tttt Encounters of the TnmKrxf (1977) ;CC) -Superman- ('978 Fantaay) Oiatorhor Roovo  USA 'TpiMRanoor Teiaa Ranger JAG(CC) Wooh Bndgaa (CC;Waajior, Total i Ranger -maBemT  W3N 9uojoyo'-(i989iMchooCario Wa (In Sronw) Haoto(Wlght jMeBoctt (CC) Tsad- jCoroOrwl  WTB9 'atojry league Booet Many otBnrnw U\" Tm('eTinj\" ;'oa? Hqito fpng Uis\"t?iS  SATURDAY MORNING  KUTV  KTVX  KSL  KUEO  SL I Q (5 JO) Tader, (CC) jCltr- jAI  KBYU  KSTU  KJZZ  AMC  DISC  DSN  E5PN  FAM  HBO  LIFE  MAX  PSN  SHOW  TNT  USA  WON  WT33  6:00 6:30 7:00 7:30  Q ;Saturdoy Early Snow jN; (CC,  SEPTEMBER 15, 2001  O Hcuoa iPooh jToodv jUoyd  V :Rod-  Wood- Wort- THouaa  Q Aoro- rdooBi Mo- Bod  jRongera Diglmon jModa-  18 !U. Farm Woport jPaj  PaM  mtt 4 Paint Pub  Racbrg: CAPT - aman 500  Oawald 1Dora  8:00 8:30 9:00 9:30  ,Biut  :Le  One  HOUoM iHOHSo  Chartaa  l-FineA  jPaK fPad jatary  \"The Low Loay (,iy9) fCC)  FaMl  ;Uroe  JCC  Dymon Rlppinoj Alama-  Paid  1GooSe-So-  iPard  IPBo PBJ  Cojfcrge Gordy ;  r ,Kna  i3rS.  10:00  iTaeb  Sabnna  wn.  10:30 11XJ 11:30  Paid  IPGA QoW (1)  iCttdna  Handy Cioo  4?  JeTA.tae-9r?) Voua-  Yow Maw Houoa jYoar Mew Vtouae  tyvieuM roooaaa  Anerfcd joH feas Rurnoie  jPratarat- Mad Star ;Bmca  POQOj Pa-ir Sugar Ray R.  1(5 as)--? Tonntee-(i9aT) la -ThaOjraoot-lT?, PG (CC) torooi An? (1989) PG' (CO  'Thom- I Thorn- :aMoraaa !ojMaiaa iflwMi IttnMb :1hmM IimM !n,, fcrf '.aZa ln4lN  Pa  Downa .WW  43g jspg  TSporta WW  tong Smce' wti tacal Hero' (19H3) PQ fCC)  i'00) 'jnyXong- -Support our LoceJ OjnrV'iojr (1971)  ;Fartnft Paid  IPwd  Fa r iFaOy jramoa Fem; Pyiw o..rx  AmotrJlArnord .Roetrrl iRoeaot jOddttw-  Patrl  Poxl  Crfof  3ax 10 ft Ztr-m G-oWr g930) G  TJwf l'l7ij Donrw Wowar  lootwt (Paid Patd  noaorofgT-c  SovJTram  Prricoaa-Barno\"  ShrjT1971  SATURDAY EVENING SEPTEMBER 15, 2001  i 6:00 6:30 I 7:00 j 7:30 I 8:00 I 8:30 I 9:00 I 9:30 10:00 1 10:30 j 11:00 1 11 :30  KUTV Q Early Edrfjon (CCj Trjuctrao-Angol Drolnot (CC) iDrabict ;CC) Wa TaHan' Sporta Enoar-  KTVX QjEiiba (In Sroroc) \"ThePaacaniaAer\"9Q7, Suaponog) Goonja Doortay Wo RolcjtunloiJCCI Qj?  KSL \"p j(S 30) Coltogo FootbaL Bngham Young al Mjeartaajpi State. jLoat (tn SWroo) Wa SporW- Out- Homoa  KUED O I Arrbquoa Rdoho j Rhythm ol Lao part. olia Sur.-(1968) Rod- Rajd iDf. Who jBtefcod-  KBYU Q\" Watuia (In SWroo) Lawronoa WoMi AntaauoaRdana jtargom 1 Bargain mnwioaari jWio. Soccer  KSTU Q Simp- SafrrWo\" Cope (N) Cope Hoot Wanted FOX13We Mad TV (In Sioroo) iStaroata SG-1  KJZZ O Frianda I End Acoaoa HollywoodUa t)A R yL'(1965) Mpry Bet Hurt. rcircoror4 The Agyaiaor\" ('9l)  AMC Olonada-(1963) Cory Grant \"tiottnae Moorapooaaa IT (1993) Bacfca- 'An ArloWerriempor  CHSC AHooauruo-WoaX iDaodHne Droc Prooocutura Hioi Rooar'e iCrjamottc Surg' JuobooFaeo (CCj  DISN Boy Evon I Lima I Boy- I Evan iBoy I Tha Poof PorT (2001) (CC) jPreud :nanwirhc'  ESPN Coaoga Footbod Goorpa Teoh at Ftonoa Stale Isuoitacawear (CC) ICoaaga Gmdoy jSponboantor (CC,  FAM (5 00) o XUhnT \"i Xrooodm Dundee rr(19eai j Way Wonrai end the Chocolate factory\" (1971) I'Sett-  HBO (5 00) -JWw Eyre' i \"BaaoyrO Rurnpaj (?000) PG-13 ,Spaca Cowooya' (joob) 1G-13 iBond of Brothara  LIFE i Pracwua Veins\" The Deebenm Stranger\" 1916, Drama) Mart Harmon (CC) Woman Doca (CC)  MAX 175001 auopacr-R rgntwpnoa' (1998) fT (CC) lirarrVi full Mara) Jacaaf (1987) tT \"Next of Kn'  NICK Kenan Konan Konan jGarcia Brady Brady IjotWr- jattor- Attfant- AHFam- Lucy iLucy  PSN Cooege Footboll Rioe al SooraaKa Icoooga Football Areona St at UCLA (Liva) WW  SHOW Boxing (iTV) (In Storoo) (CC) iFWaaurVaction Whoro tie Money ' 2000) iFbck -Sarocrioa-  TNT ' groajoT(T97g, Muacai) John Trawaa. ! Xama-(1976) Sajey Space., -Saruroy non(faw(1977;  USA at -BAPS.\" (1997) HoJe Barry. jaw \"71 Tnont Waa Yot (1997) (CC) \"AtFwst Srghf\"(1999) Val Karwr.  WGN Tha ficCToroaf (1991, Advanturo) Wo (in Storoo) FroahPt 1laatot'Dooi,'(1995, Drama) \"Spj-  WTBS \" ! \"SrHpar\" (1993) Tom Boronger ' W Tna(XK!ran(wDoatf'(l995) i TTwM,-ircerT Sow' (i960)  SUNDAY MORNING SEPTEMBER 16, 20pT  I 6:00 I 6:30 7:00 7:30 I 8:00 8:30 9:00 I 9:30 1 1 0:00 1 1 0:30 1 1 1 :00 j 1 1 :30  KUTV feT HourotPo T ranjln' Bob Sunday Morning (W) (CC) Notion NFL Today (CC) WFL Footbod (CC)  KTVX'O Paid iPard Houaa RonH. RaboocalPard IPard Utah ThraWaoli (CC) iPGA Gott (Uro)  KSL g Animal Wall St Today (ki Sioroo) Meat the Prooa (N) Sw it Muotc Homoa Tuna Up Auto Racing (CC)  KUED O journal Horlh Religion I School Money Anna Bootraro rm Bunch tin Shwoo) (El) (CC)  KBYU P CESFVaoido Woman Woman Mualc Mormon Mormon Family Religion j WorohipTcES Fttoordo  KSTU 9 Peal Houoa Bua WMd Wild Sporta Foi Wowa Sunday FonWFL Sunday NFL Footboll (CC)  TUZZ gi\" Faith Main St Paid I Paid Paid Paid ISaMr ICrttiar jctHWr IChorloo \"Masaor-Qoarn-  AMC Floow\" Raacala Three Stooged \"Cheyenne Autumn- (1964, Waalarn) -The rot(uraJ,\"l1964)  DISC Paid iPold Paid iPawt Paid IPabi\" IPaid PaWI 1 Chriotophor L lOhrtobjphor L.  DISN m 4 Paint Ctub Boer Bear Pooh Pooh PI J pBJ Borio Roaa Stantoy Stanloy  ESPN Game- INFL Sportao- Llnoe Roporv aportoe- NFL CounWown (N (CC) Woman 'a Soccor  FAM raid iLWa IBaytaaa Facta Mary T Hide lAnooia Brace- I Pretend- Marl SwrlBraeo-  HBO (5 50)a -SpacoCowooye 'tgQOO) . aoa \"BCoebr - HrnseT-1W?) PQ' a 'Gaay Cvaat\"(1999) Tim Aaen,  LIFE Paid I Paid Paid Paid Paid Paid Jhmj Paid Paid Paid iDoargn- DaoryT  MAX VleesGokT-rX \"Pokemor tna Mowa 2000\" Turk iay(196S) Tirrwthy Hulton, \"hAachief19Q5) K (CC)  NICK Thorn- Thorn- Rugrabi Bugrata Spon- Spon- Arnold \"JjrnoM Rocket Wockal Imvadar ICatdog  PSN Paid I Downa wA5CAR Thwi Ntning (W) WFL That Morning (N) hAS- lOutooot Coaoflo Footboll  SHOW Tho Batr-Sitters Qua\" -T Boy ' 194) Jomae Bmen TloWvw' (2000, Horror) PQ (CC) I 'THrgi'  TNT (4 00) 'Airport- a \"Woo5n Ccbum\"(1975, VVoeaam) laaoH The Shootr'(1976, Woelam) l-Qunaw Jooay\"  USA Paid I Paid HorcuWJmya. I Paid IPaid Paid Got God iTeiaa Rangor Vpcy Dck\"(1998)  WON Forney Fun Hoe, ramlty Cluaraoa Mallbd Paront Parent FroohPr Beeotirlar (CC) Xona: Waroor  WTBS Austin lore\" firewaaiM- 196) Chuck Noma Uncrn'tTg, Drama) SySwater Slaanna I'yurol-  SUNDAY AFTERNOON  KSL  KUED  KBYU  KSTU  KJZZ  AMC  DISC  DJSFL  ESPN  FAM  HBO  LIFE  MAX  NICK  PSN  SHOW  TNT  USA  WGN  WTBS  12:00  12:30 1:00 1:30  NFL Footbok: Broryoa al Coke  2:00 2:30 3:00 3:30  SEPTEMBER 16, 2001  4:00  4:30  NFL Fooibad Wow York J al Oakland RarrJoia. (CC)  PGA God): World Go Crawip .American Epreoo Champ  Auto Racing NASCAR VWwton Cup - Wow Hamper XX? j NASCAR 0O1  Lawrance) Walk IMormon Mormon  Pakttiirig Sawing Europe iTravokf Fy  NFLFootbaH: Packark alGanta  MaakofOoadi\"  Tha NeluraT  Chara I Chela  S Club T So Uma  Real Sporta (CC)  Goidon IGotdon  EipWrar  CtWlltt WaaVtof  !WFL  Daar-  . \"Foe Auah kt\"  Boot LA.P.0.  199) PG-13'  r (CC)  IJeraay Boy lEran ILtezle Tha Poo PW (2001) Mark Curry  Yacht-  M-904aat p4MCt)  Your Bkj Brook  One  BYU Doyononal Mualc lUttla Houaa  3SU  Utile  5:00  ABC  WBC  H TarTin \"(1986) Piorca Broanan.  Pmal Conflict  5:30  Tabal  CMc  Simp-  Vt -rtorrbrs  Raal LA P .O.  li Whu irr'  PaJrwwman. The Lot  DangeroMo Joba Dangaroua Joba  AuWPctrig kidy Raong League - Chavy 500  So Uma v AiParr(200i,Corniidy-Drsma)  Boorb (in Slnroo) 'The Bratty Bend Movw\" \"XAWn-(2000) PG-131  \"The Pnhcipar (1987, Drama) fr  . 'Om Mmj Doan' (1989) (CC) I 'JuefAat My OHdren\" (2001, Drama)  GAS (In Sioroo)  uoooga ruwuoh  \". Smrka k Sanaa of Snow' (1P87)  Mariners  Kenan j Kenan I AM Tnat  Sportao-WFL  T God\" Boo W  \"fla Go-Kue\" PG  XrW-Ganano-  lCcooon\"(1985) Don Amoche.  Ketaai Amanda iTalna  Mayor League Beeebai Tanaa Rangera al SaaMe Mamara  -Things Change- i Paaaan ot Mno (2000) PG-13' o iQarKaa Ar\"(1989) PG'  Staying Akvo\"  (1100) TiCXirwJoaay Walea' \"Hign Pleme Dnnar\" (1973) (CC) 1Came\"(1976) Saay Spaoek.  (11-00) Tatocy Dck\"(19ae, Advontjro) Puna, Stewart  Major Looguo Baalbek Pirttburgh Prratea at Chicago Cuba. Hnowg  (11 30) Purel.uc\"(1991) ' ThaOickandlhoDaa,\"(15)  Vi 'Ania' (2001 Advanturo) Gerard Buntr (CC)  Coaoh Coach i Freer-Pr Xmc Warrior  lethal Weapon-(1IW7 Drama) Mol Giboon  SUNDAY EVENING  KUTV  KTVX  KSL-  KUED  KBYU  KSTU  KJZZ  AMC  DISC  DISN  ESPN  FAM  HBO  LIFE  MAX  NICK  PSN  SHOW  TNT  USA  WGN  WTBS  e  JR.  6:00 6:30  7:00 7:30 8:00 8:30 9:00 9:30  SEPTEMBER 16, 2001  90 MInuWa (CC) Piknotkiio Emmy Awarda ('n Srorao) (CC)  Wait: Tho Mart Behind the Myth (CC) Practtca(CC) IPracBoe (CC)  (N) (CC)  Banyldaaangol  Unk(CC)  H -Siar Trek tneurrecnori' IV)  Ahice (N) (CC) I JuggWrg Work end Family (ki Stereo)  TheComlGroon\"(1945) Any-  \"(rioapandence aey\"(1996, Scwnoe Fcoon) Wi Smeh  Tnoqodftify\" (1964, Drama) llnviaibie Man (CC) Maximum Era. Newe-  Tha HaturaTQM. Drama) PG'  Darigoroua Joba IfJeoolraot Job  f3t  'Even  Link) Boy-  Wa Sporta  10:00  Monarch I Bleoe  10:30111:00 11:30  Tahon' Soorle  Edition. SOS  Twa  OCWjkwl PaMTIM  Scraon Tkacna\"( 1968) Jarraw Stewart. The Lot  OoMH WtTWttH ITtTTW tWnJi lFwtxH&p0 M\"o, aBHlifdkl  Ub)  ER(CC)  (CC)  Ckteelcal Mualc  X-FHaa (ki Stereo)  End iFWdTV  The HatumT  Tha Poor-PawT (2001) Mark Curry  NFL NFL FootoeJt Cleveland Browne al Pktaburgh feeier (CC) Seerlacantar (CO WFL PrtmaBma iSportec-  Oi Goc\" 6Va IT l! -Crocodile Dundee rT(1988)  reeWfionrus'-'PG' \"Gakuy Quajf\" (1999) TjmAkan  Ue-Ganand\" \"Ue WUh Xoy Genand-  \"Aff the Right Moves\" (1983) \"Big Trouble i Uttte Chrm\"  TBA Nick- Grtm Qrr?mti Grrmm OrlflWi  (5 30) Cottoge Football Washmgion al Miami Sao Thla  \"SvA- !' -Noma H\"(1999) JuW Roberta. PG-1T  ' Jawa' tlgTS, Horror) Roy Schetoor (CO !  v \"Cedoyehet r (1968, Comedy)  ICQ  Sonj WxJteiWat  IPCL  -Wood Page' (2000) Cooper Van Own  Qilfltth lOilflWi QrlrPMl QrlfltaJi  Qeyond the Glory jytfctory Lane  \"SoumPark pyflgar\"  Erlrae  Xddrshackr  ICurb  Any Day Wow (CC)  WW  Andromeda (CC) I Final Conflict  \"Cornpery Theory-(' 997) Mol GOaon  Raotay Heot of Wirjht Matlock (ki Staiao)  TJaop  ,OTC II i, il Da. \" frV-  (3 00 v, -Attee\" \"Bmvehearr (1 995, Drama) Mel Gfcocn, Sophaj Marcoau (ki Sioroo) (CC) JA0 The Return'  Tonaorroiy Theory iwn 2 Suopanea) Mai ftnn  m.  I'S-jrvr.  MONDAY EVENING  KUTV  KTVX  KSL  KUED  KBYU  KSTU  KJZZ  AMC  DISC  DISN  ESPN  FAM  HRO  LIFE  MAX  NICK  PSN  SHOW  TNT  USA  WGN  WTBS  ft  CBS  Si  Send Me No Flowers\" (1964)  6:00  6:30 7:00  7:30  8:00  Errkar- King Yea lftoy- EMon (VI) Famay Law (CC)  8:30  SEPTEMBER 17. 2001  9:00 9:30  MaHnTaVffttnW  Uttia Houaa  NR. Footbok MWota Vkunoa al Bhmore Ravana (CO  Wnakaat Unk (CC) Third Watch (GO ICiooaina  Antlquoa Rdoho I Whoa Houoa  Simp-  WaWrJo3M4naV  T Wortda Apart Cowv.-Ooarmif  Spmtotd I 'The qatt\" (200 1 1 Vincent Speno ICQ jfOXUWa  Juat- -Steel Magncen\" 19m Setfietrl.  Your Now Houoa  Bojt,  Countdown  S Club 7 T  H You Only Knew'  WeddWge-LJia  \"Under Suapoon\"  Spon- U Pick  Sao Thta Laat  (5:35) -Tjooaorr  law 4 Order (CC)  (3:00) 'BanwTrr  Smart- Boy-  10:00  iBocfco- a-rni -Varraa-(19V) Ttscr Hao-on PQ' -Sanjrf Me Mo ftewora\" (1964:  10:30 11:00  LW Vrvm (CC)  ontght Show (Nj  Europe  11:30  Law  Wjgkr  WotlonalQaa.  erAKkg4l  Trote Voyagar  Wrld Dlatoaary Venom: Waya iVohay-T-Paw  The Olhar Ma\" (2000) (CO I \"Pp Grtt\" (2000, Advanturo)  TonyHawk'a  Growing jGrcwing ;Swa 3ee-  -Wtie-a tW Heart It\" (20001 PQ-I?  Gordon Gordon inameke Porkok  -Random Hears \"(199) Tr (CC)  GHIioan iGkhqan Gimgatt Qilkgan IcSmgan GHHgan Toldigan GHtigon\"  WA3- IWW  So Lima So time State I Stole jTa Be Announnod  Tonight  t peeppeariB Acr-gO0n)- Tjot Carby-(2000.  UnaeWodMyat -TVr3-( 1397) Amy Jo Johnoon.  T-arapt)rp-p-(196: W (CC)  BaMCtMfi iCoJdWQS ftWtbaawl Mpffaaaflal 5tatt9 (  Law 4 Order (CO  SajaVMjcfxjuj\"(1989)  -CkJb Pernod\" 19W,VG-1 1 OCjTrriewmTelr Eiw  State.  Low 4 Order (CC) H ol reght\" 1. Suaponeo)  jCCj  'pWanckjna'  AHFam- jA9Fam-  Spon  Leap Yeora (TV)  Auto Pacing (Cq  Waws rtn Stereot Hoot of Wltl  SaPey. Sevan ntrw-iggg  wonota (in Monto) ISud-  H Pteroon jaeov  J22L  TUESDAY EVENING  KUTV !Q  KTVX  KSL  KUED  KBYU  KSTU  KJZZ  AMC  DISC  DISN  ESPN  FAM  HBO  LITE  MAX  PSN  SHOW  TNT  USA  WGN  WTT-S  CBS  6:00  6:30  Enter- jJAQ \"AorsT (CC)  Fcrtana  7:00 i 7:30  Guarcoan -PtrT  Enter! iShrtera  Wova Tho Vikinoa'  70a  8:00 8:30  SpmCty(N)(CC)  SEPTEMBER 18. 2001  9:00 9:30 10:00  iJudg-g Amy ,CCi 'Wo  PHjPy Tiof (CQ  ! WaliMy of 4W Fubtra  Loot (H) Or SWroo)  Lova Cnwoe  Axrclryira; Motrig\"(1994)  \"FcrtApact)\"194t, Woatern)  Vmar aj, ii-. 'laVTU '  TOMT rvTeTaT fUJrVWm WIW UWggPflfy  Boy lyn jSwirt-  PflA Bomlinj  SCtub7iT  (5:45f TjJ(jb'  FOX1I  10:30111:00  Wighk- ,  Tonight Show f-fj  kjkrjpjfc  1150  1582!:  WaaonalOoo.  rTAiKirtyHIri  fJuek- jFraoher Trrat Vofogar  w Tntftia-(1ata) RgWa B laH TwrWHaairi19S  WodD-acovory  TrwrPoar-(2001)fCO I \"Bnn(1998, Advarfcjo)  Tonight (N) fCC  9.  -Eayauafca f Vow Yortr\" j 1 99, (cq  FBtFUeafN)  \"\"OiPruiuef  WeontarcTl  Scgloat Ptacea  (5 JO) TrrryMha\"(1985)  SVeradO-(i96S!KevTKIrx PG-13- I -Sinnai-rnni  , , ' 1 r \" iiraoa  Goidon ImWrrata Porjrad IUnogrod MvaL I Xova t HAner\" QVXi. Dr i (oc  Golden  Soon- lUPrck  7(Co.  Soa Thta Leal  \"Hjgh fid-Chjrm\"  Law 4 Order (CQ  HAS-  t gkStrwt-(1999) j-BloodarioVio-Hgc-cf muWB iTierJiLfa;  Marinera Major Le3aa Baaobalt: Angaai al Marinari  The TVt Bie L\" 12000, Drama) 'Whero fWMTnevfc'20ra pSj  \"SNrjy DearCT';i993, Drama) j Sr-jDBatnce(l993.  -A Cham Uw'(1985, Mujcaf)  .jEnWCWoi Sjis'Hjp?\")  3-aCa 13-a Co. iraCa jraCo. jraCs. Ira Co. jyaCo. AfcyygTjS:  Sporta  iJAfliinSMmoj jWaak. aVirdgak .Wcher (20Q1) Sry T  sajsuncir  Wa y Stereo) Hael of Wignt  i1  t Pwva-ioao. u hqTT  A", "parent": 22658299, "version": 1739889197496401920}, {"id": 22658310, "paper": "Vernal Express", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/d8/b9/d8b9681c44a1b0703bc57b35d3d8e373edbd1134.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/c5/5c/c55c9bd481e88a161b05d0938845fa384bd7b81f.pdf", "page": 11, "ocr": "Vernal Express Wednesday. September 12, 2001  11  6)  Candle and prayer vigil attract about 100 to the south side of the  Uintah County Courthouse  Financial Focus  Pay yourself first  and keep investing  submitted by Sttvtn S. Holt  f dward Jones  Investing in llto MikI nuikcl can  be like riding a nller umstcr as  prices occasionally move up and  down. As an investor, there isn't a  lot you tan do about nutrket volatility  volatil-ity but you tan become better  prepared for it. Here are a few suggestions:  sug-gestions: Pay yourself first. Ik-lore you  get a chance to vpend all of your  paycheck, you sImhiIJ invent some  of it. If you want to achieve your  financial goals, you need to nuike  investing a priority. The best way to  do this is to pay youisctf first. If  you wait until you pay all your  other bills before you invent, finding  find-ing the money will be more difficult.  diffi-cult. By sctti gp a hank authorization,  autho-rization, you can automatically  deposit money in an investment  account every time you pet paid.  Once you've gotten in the habit of  investing this way, you'll find it  easier to increase your contributions  contribu-tions as your income increases.  Invest systematically, hveryone  says you should always \"buy low\"  and \"sell high.\" But the fact is that  nobody can accurately predict market  mar-ket peaks and valleys, and it just  doesn't make smart investing sense  to try. So, instead of waiting for the  \"right\" moment to buy as low as  possible, or to sell as high as you  Airport...  Continued from page 1  lights need replacing and other  improvements need to be made. By  extending the runway or building a  large one at a different location, it is  hoped that larger corporation jets  will be able to land at the airport.  \"I don't think a longer runway  makes much difference to commercial  commer-cial carriers,\" Wardell said.  Uank-issuecl.  5.05  mat Percentage Yield (APYHrteest cannot reman on deport; pariodc payout of  Herat it reaured Effective 9H0O1. SiAject to svaiacy and pica Chang The  armrt mcewsd from a sate of a CO at curent  leat tian the amount frtaty invested  i HI  can, take a different approach and  become a systematic investor by  dollar cost averaging.  Dollar cost averaging involves  , putting a fixed dollar amount into  an investment on a monthly basis.  By investing a regular amount of  money each month, you'll purchase  more shares when the price is down  and fewer shares when prices are  high While this strategy cannot  guarantee you a profit or prevent a  Ions, it helps to ensure that you  won't be investing all your money  at a market high. Keep in mind  thai dollar cost averaging is a long-term  long-term investment strategy, so you  need to evaluate your ability to  continue investing through up arid  down markets.  Stay in the market. When the  market heads south, you might be  tempted to go on an investment  vacation yourself. However, getting  out of the market is not a good  idea, because you never know  when it will bounce back. When it  does come back as it historically  has you may miss out on some  great opportunities if you. are not  still investing at the time.  Need proof? Consider this: If you  had invested in the stocks making  up the Standard &. Poor's 500 Index  every day between 1970 and 1999,  you would have earned an annualized  annual-ized return of 9.7 percent. But if  you had missed just the 100 best  days over this 29-year period, your  annualized return would have been  a negative 0.8 percent In other  words, by jumping out of the market  mar-ket at the wrong time even for a  very short while you would have  ended up losing money. The lesson  to be learned? Stay invested.  By following these few basic  techniques, you won't get rich  quick but you will be laying the  groundwork for investment success.  suc-cess. And that's no small feat.  FDlC-insared to $100,000  marts vauemaybetweHne, motaor  Steven S. Holt  Investment Representative  755 West Highway 40  Vernal, UT &W78  Bus: 435-781-2100  Toll Free: 877-781-2120  www.wtwarfJionea.MHB  Member SIPC  Edwardjones  Soring lo&niotl Iroeaton Since 1871  \"iQtn (i Qb lUittK- I  Pet Corner  Mew era in  By Toml William  There has been an evolution taking  tak-ing place in the way this community  communi-ty deals with animals. For years  there has been a problem in the way  that people see and interact with the  wonderful creatures that we call  pets. It has been mostly an unspoken  unspo-ken problem, with the exception of  a few sensational moments in our  history. If you haven't lived here  long enough to know what Im talking  talk-ing about, let's just say there was a  time when our \"animal control'  methods got national attention.  When pets were thought of as less  than they deserved. Even now there  is a lot of room for education and  higher standards of behavior when it  comes to the way we deal with animals.  ani-mals. In the past year or so major strides  have been made in mis evolution.  Such as, many people have decided  that the problems we face should no  longer be silently dealt with, but  that the community as a whole  should work together to' better current  cur-rent situations. One of the things  openly discussed in public forums  and meetings was the need for a  new animal shelter. The fact that  the facility used was out dated and  inadequate for the current needs was  brought to the attention of elected  officials who responded with concern  con-cern and action. As a result, we will  see a new animal shelter built soon  that will be the beginning of (dare I  say it?) a new era. Along with the  need for a new shelter, officials realized  real-ized that education, prevention, and  a new community philosophy  Proposal...  continued from page 1  differences, and we know the  majority of residents in Grand want  the present form of government,\" he  said.  Grand County Councilman Jim  Lewis, who is also a physical therapist  thera-pist and lifetime resident of Moab,  said there was some action earlier  this year to change the county back  to a commissioner form, but it was  soundly defeated.  Members' of the Grand County  Council are. paid $700 a month.  \"I am 'going to move to Uintah  County and run for office,'  m wm rail  w- 11 t r t  jaiimaanss  jacogaisegi  ca will herp you fund big-tickt tsmsata  low.roirperith'eiate:  dealing with animals  would be just as important as a new  building. With these things in mind,  the Animal Shelter and Services  Advisory Board was bom.  For several months this Board  worked on a Strategic Plan. The  people serving on the Board are volunteers  vol-unteers appointed by officials of  Uintah County and its communities.  These people are from various  walks of life and represent the following  fol-lowing entities and interests: Vernal  City, Naples City, Uintah Animal  Care, veterinarian profession,  American Kennel Cub Breeders,  Uintah County Animal Shelter, and  Uintah County. The role and responsibility  respon-sibility of this board is to provide  direction on how to achieve effective  effec-tive administration of the Uintah  County Animal Shelter. In addition,  board members have developed recommendations  rec-ommendations for animal services  within the communities of the county.  coun-ty. This Strategic Plan was presented  present-ed to elected officials of Napjes  City, Vernal City and Uintah County  all of whom whole heartedly  approved and adopted it  This is an exciting time for pet  owners and people in our community.  communi-ty. As great as 1 believe this to be, it  will take more than officials and  boards to maker a real difference in  the way we think about and treat  animals. We can help the people  around us to understand the benefits  of taking good care of our animals.  ' We can support our officials and the  decisions they make about Animal  Services. We can educate ourselves  and get involved. We can volunteer  our knowledge and services in many  different ways. But first we must be  responded Councilman McLeod  when he was told that Uintah  County Commissioners are paid  over $62,000 a year in salary and  benefits.  Residents of Uintah County can  still register to vote in the  November election either by mail or  by going into the Gerk-Auditor's  office as long as it is done or post  marked on or before Oct 17, 2001.  Also resident can register in person,  Oct 26 and Oct 29 at the Clerk's  Office.  Eijpy life alitfJe rrvm  rigjliow and Ute  admtage of our  hose equity ban at a  special tatrodictary  g n .  ate.' ForaEmited  timeAIouitaiiAmeri-  Homeimpmmmts  TtopcdvGooibncrcmise  RnfiascarzwczrcrSUV  taxmedzxtbsd expenses  &eymwfimud&s  HE,  responsible pet owners ourselves.  Last week I went to the new location  loca-tion of the Animal Shelter. They  have a temporary home, until the  new building is complete. Debbie  Perrigo, the Shelter Manager and I  were visiting about w ays that we as  animal owners can help. For  instance, put a pet I D. tag on your  dog's collar. That way if he gets out  of your yard, he can be returned to  you. Animal Control will try to get  your dog back to you if be is picked  up. As an example, w hen I got there,  Debbie had just called a pet owner  to come and get their dog. He had a  microchip so they knew who to call.  !' 'o'S  Uintah County Animal Shelter  Pelt Off 7fae UlfacCs  -  This blackbrown female mix dog is probably less than one year old.  She is a happy, loving dog that wags her tail so hard she hits herself  in the face with it. What a fantastic companion she would make for  dog lovers of any age. She was found wandering on north Vernal  Avenue with no identifying tags, collars or markings.  The Animal Shelter now has a 30-day, no fee fostering program  which will help adopting families determine if they wish to keep the  pet permanently. If you wish to foster or adopt this or another animal,  or if your pet is missing, please call the Shelter at 781-7297 or visit  them in the first bam at the west entrance to Western Park.  'fern I  ' v,'f- its' ?.  '  Hwerjoi ise it, a Horn; Equity Loan  u-cmAtouah America is fast too easr  especially with its potential  (cmsslt your tax advsor).  You've worked hard for your home- now  IH IV nvtAMIUUiUWl TVIIltWlUUaUUn  visit cur internet site  0fcaDl-800-74S-  4302tolxate  thebrancii  vou. Mounmn  w  C IE I i I  (a iitmbmkip rrquirti  Calling the owner to come get the  dog gave Debbie the opportunity for  education without having to  impound the dog. Another way we  can help is to get our animals  spayed or neutered. There are many  unwanted animals born every year.  We all need to do our part to stop  mis cycle. There simply are not  enough homes.  If you are interested in helping out  at the Shelter, there are volunteer  opportunities. Just give Debbie a  call at 781 7297. Uintah Animal  Care is a non-profit organization  dedicated to animal welfare and  responsible pet ownership.  1\"  o  4U --'.v  tax advantages  America  UNION  bssei en rigibiiy  w  )", "parent": 22658299, "version": 1739893872134193152}, {"id": 22658311, "paper": "Vernal Express", "type": "page", "date": "2001-09-12T00:00:00Z", "year": "2001", "month": "September", "day": "12", "thumbnail": "https://newspapers.lib.utah.edu/udn_thumbs/03/85/0385b69fdaef63ba90ef7cfb0a476ad8b7ea999b.jpg", "file": "https://newspapers.lib.utah.edu/udn_files/21/bd/21bd068be014400cb259f563715dc29d4b86b016.pdf", "page": 12, "ocr": "un.\" lie then thanked Glen Vernon  IV his k't'J aJh.e ith the coo  traci ar.d RkruirdMm Design  GuHsp of Salt lfie City fot the  grcit architectural job uVy did.  Heather Hot thanked True Value  fW donating the use of the shovdi.  Once the snivels were set aside,  rcfieshntenis eie served by Care  Center employees and mu-ic vas  pimiJed b Cay Brady. Frank  Reynolds, han and del a Pope,  Dale Nkiuire and June Murdock.  Center resident Helen Bacon, ho  4tttK'J the event from the shade of  the poah. said. \"I think U wwider-tul  wwider-tul It's progress. \"  I he expansion of the Ciire Center  u'im.-s at a tinte when demand for  mh.Ii Ijiilii) is increasing and the  !Jer jKiHi!ation is growing. Other  tacts ah.tit the expansion arc:  -The project i headed by  W jilin.in Corporation, Ogden.  Wadtiun'k Project  Superintendent for the expansion of  the iaie center will be Ron Davics.  I he county's Owner's  K.jveiitjties will be Dale  Petersen and Charlie Walker, both  are County Building inspectors.  I he design firm for the project  is Richardson Design Partnership,  Salt Lake City, Utah. The Chief  Architect has been Joseph Coates.  - Ihe addition to the existing  I.kiIiIv will add another 58 bed-.,  making ttie total capacity of the  building 1 10 beds.  Ihe expansion will add  approximately 35.000 square feet.  I pon completion of the addition,  addi-tion, residents will be moved out of  the existing facility and into the  new addition; at which time the  existing facility will undergo significant  signif-icant renovation. The renovation  will include updating all finishes,  including carpet, wall coverings,  ami handrails. The renovation will  also include updating furnaces, air  conditioners, and water heaters.  There are also plans to expand the  existing lobby, which is often cluttered.  clut-tered. There arc also plans to  expand and update the bathing  facilities.  The old 52 bed facility, with  its secuied doors and exits, will be  designated for serving the needs of  cognitively impaired clients  (Alzheimer's Dementia), while the  new 58-bcd addition will be designated  desig-nated for serving the needs of more  cogmiivdy alert clients. Separating  dining rooms, activities, and the  like will allow the facility to provide  pro-vide need specific attention and  caie.  I'intah Care Center was made  1 2 Vernal Express Wednesday. September 12. 2001  Care Center...  Continued from page 1  Unttfi County fteafateat Pofkutctan  fcdMduris IS Vtsw 4 Cite  5eece: S4ktnDvlpMnt  SI9I  4184  l.ttl  2.  - i  2l  200S  2011  2C  a Special Service District on  December 11, 2000. paving the  way for the county to contract with  a private management firm to run  the day to day operations and make  recommendations on how to be  more efficient and financially  viable. Traditions Health Care, St.  George, Utah, has been managing  the care center since February 14,  2001.  Since February financial losses  loss-es have been significantly cut and  the care center is now nearing a  break even status. The savings are  a result of increased income and  decreased non-direct-care expenses.  expens-es. Savings from non-direct care  staff cuts have been redirected to  increase staffing ratios. In July the  facility averaged a 1 to 7 CNA to  Patient ratio. Industry average is I  to 12.  According to Sahara  Development (1999), the Uintah  County elderly population (65) is  expected to nearly double over the  next 20 years. The care center currently  cur-rently has a waiting list of 34 people.  peo-ple. The expansion project will be  funded as follows: $2,000,000  Community Impact Board Loan,  $500,000 Community  Impact Board Grant, $6,440,000  Bond sold by George K. Baum and  Company, $8,940,000  The loans will be paid for  through a ten year 410 of  Sales Tax adopted in April I, 2000  per an election February, 2000.  The design of the facility will  allow for greater efficiencies for  clients needing day care, post hospital  hos-pital rehabilitative care, and long-term  long-term care.  Uintah Health Care Special  Service District Board Members  are: Board President, Keith D.  McDonald, CPA; Board Treasurer,  Gary Show alter. Owner of  Showalter Ford Company; Edwin  C. Bulloch, Administrator, Dialysis  Center, Joseph B. Shaffer, Director,  Tri County Health Department;  Duane Hall, Utah State  Commander to the National VFW  Legislative Committee; Dr. Karl  Breitenbach, Medical Doctor and  Len E. Gotfredson, Retired  Principal.  Medical Director for the  Uintah Care Center is Dr. Jon  Hughes.  Uintah Care Center  Administrator is Shawn Matheson  Uintah Care Center Director  of Nursing Services is Terri Rimer  , Traditions Health Care  President is John Bramall, who tnci-dently  tnci-dently served as Uintah Care  Center's Administrator in its early  beginnings.  According to Shawn Matheson,  Care Center Administrator, it is the  best cf both worlds for the community  commu-nity to have a skilled nursing facility  facili-ty that is county owned but privately  private-ly run. Being privately run the care  center enjoys access to the efficiencies  efficien-cies of private enterprise, while still  having the support the county.  Under private management the care  center has significantly cut its financial  finan-cial losses while actually increasing  its direct care. Being county owned  allows the facility to use money that  would otherwise pay for a mortgage  and instead direct those funds to  higher staffing ratios. Because of  the support, pride, and ownership of  the community, people's post hospital  hospi-tal and long-term care needs will  continue to be met for some time to  come. Community members will  enjoy the newest and nicest nursing  home in Utah, with most likely  some of the highest staffing ratios.  The project is expected to be  completed by January, 2003.  re  1  Monthly save $200  Special! In Reti savings  i i  m pintail Mini  RlJiiinO Ijhu&hiiu ii):  &  4 I  J  0  1J  SSL  U DAYS  I SAME  M as  : CASH  c  ModdGCHZC  Big things do come in small packages! If you're looking  to improve your existing gas or wood burning zero  clearance fireplace, the GDIZC gas insert is the perfect  solution! This zero clearance direct vent unit fits perfect  into ft ie smaHest of spaces, yet stifl provides you with over  400 square inches of ceramic glass viewing area I  3 or 4 sided teshng Us . wad mounted tnermosut  Upper door mm n brass or gold plating . tMI brick panels  Df-orve wick panels  Lowest Price Guaranteed  f ) (HAPOLEOH  On Napoleon Stoves!  Quality FirepUce  Plumbing & Heating, Inc.  1286 East Hwy 40 789-6918 or  Toll Free 1-888-789-6918  f -m m --  -  ht (Jutdcopo  j - -s s i \" '  ith I thoGO  Greet Doals! I  -  , '  1 '. \"\"\"\"Vr- , i  UU 01 S-19 Cre Cab  11140 V S-II CmCeb  IMM llWa CitwCcb  linf 61 S-19 Crew Cab  im II S-19 Crew Ccb  IHn'lf S-19 Crew tab  S2W74 52UC3  S2WW $21,7:3  t  1M2I JlSubwioiiJori isU'  1111! 91fctvttai12la  PH t-X..  1M12 61 $-19 Eswde(JCd S25,W $193  IW'gfrV  -:., C4,475  1 - MGMC1500  EX-CAB. WHITE  K1T422A  SAVE  $10,925  1ibiwmww A mmm 1 1 ' ii i  S10A  . jf- :-T r  M j -- - vy .  09 . ( 2091 ' ;  AURORA ' fxmmmssx. I  bave s--clir5  C24t995 \"  ' 1, - v , . I  Otcount prioatf tWlM llQurad Ml Klud CMh vafcj or ntioli.  WlhosDesr CIhlev!roDell, Co.  You Have Our Name On It!  C MBV T  wmuiHEsr  i ,1  T H B  rr  2200 Foothill Blvd., Rook Spring  362-66T7  In Wyoming 1-800-48-567T  S urn mt whllrcrvy.com  Hour) Mon.  m. to 7  owm  f n tiO 1 li  Orasnrxxslio.  ooooooooouoooa  TTf Parts  VERNAL  AT HOME FOR 75 YEARS  Celebrate Americjl 11 appliance brand and  75 years of innovation, performance and value.  It no wonder Konmore appliancei are found  in 1 out of every 2 homei in America.  shop sears'  o  Where else?\"  Home appliance, electronics and hardwart  Sale prices in effect Thurv, Sept 1 3th-Sat, Sept 1 5th  water  'S fiRraticn  -\"\" for dean,  grtat-tasting  drinking water  u  fi  .ff'financina '  irti! April 2002'-  I maBfenrnore  arWlorvw? mar  399whenyou  use your  Searecartf  \"3  r  3  69998  Exceptional Values  a. limited eoltion radiant  range Self -cleaning racks  94752 eai!i m  b. Limited Edition gas  range Self -cleaning racks  75942 wmi tunma im  f5  399  A  99  sale  Super Capacity Plus washer; : .  aveeu iupwMuiuiMuiLdiur, new  Uttra Rinse system 22722. Reg. 469.99  Kenmore dryer 62622. Reg. 339.29.  sale 299.99 Gr  m 399 sale  r t  Utfra Wash dsriwasher,  save $70 America's  cleanest disfies Nylon  racks. Time Saver cycle  16769. Reg. 469.99  Anung MonQ brandi  n  25-cc gas blowervac. Save $20  ISS-MPH'SS&CFM peak, up to 10:1  mulching ratio. 79730. Reg. 1 19.99  999!  88  'doseoui  just 123 monthfy  14.5-HP, 42-bt lawn tractor, Save $50  Briggs & Straffir lC OHV engine, verted deck,  6peed 27153. Was 1049.99  While ojuvMn iMt  Owned & operated by Terance A Carolyn Batty 12S6 W. 400 S.- Vernal  Phone 781-0409 Store Hours: Mon. - Sat 9 am to 6 pm. Sun.: 12 Noon to 5 pm  241 -pc. mechanic's tool set, Sears low price  146 standard and metric sockets, 3 ratcnets,  26 wrenches, 40 hex keys and more. 33841  free 4-drawer chest a 5959 value, with  purchase of tie tod set oc7 oarpeemsm 22  99  just $14 monthly  SONY  27-in. Trinrtron TV, Sears tow price  Flat picture tube, 3 line digital comb filter and  16:9 Enhanced Mode. 47661. .  0 financing unti Apl 20G2 on aE Sony  audo & video over $-199 when you use  your Sears card  :) \"i  !\"J\" i T mm n iirtwiiil Mum mnr no pnkMi nl km w wwtH to fhn km M hnK ffcm. Dmn e RNryn ta SIMS tVSlDOt IKMSE ON  EXCmiOMlMNnwpiMIgm' VkMtmMcmn tl ON SMJt AOOmOHll SMp w wMtti m MaM  mninM-iimorMHgKn  u - .w \" 1 , \" w.j mm nam memo um. mwuun. a ma naaHO iwiwi m um ew pncsi inr. n m inw etjnmj.  f POOR", "parent": 22658299, "version": 1739889737305423872}]}